const translations = {
  shared: {
    next: 'जारी रखे',
    start: 'करे',
    info: 'जानकारी',
    copy: 'प्रतिलिपि',
    about: 'अबाउट',
    chapter: 'अध्याय',
    chapters: 'अध्याय',
    challenge: 'चुनौती',
    challenges: 'चुनौतियाँ',
    coming_soon: 'जल्द आ रहा है',
    start_chapter: 'अध्याय प्रारंभ करें',
    back: 'जाए',
  },
  status_bar: {
    begin_message: 'जारी रखने के लिए ऊपर दी गई चुनौती को पूरा करें...',
    error_message: 'हम्म... यह अभी पूरी तरह ठीक नहीं है...',
    in_progress_message: 'अब तक अच्छा लग रहा है ...',
    success_message: 'अच्छी तरह से किया!',
    next: 'अगला',
  },
  ///ABOUT PAGE
  about: {
    title: 'अबाउट',
    mobile_title: 'यह किसके बारे में है',
    subtitle:
      'वर्ष 2139 है। अंतिम बिटकॉइन खनन होने से दो सप्ताह बाद है। सतोशी स्क्वायर में महीनों से एक घड़ी टिक-टिक कर रही है।',
    intro:
      'दुनिया आखिरी ब्लॉक का इंतजार कर रही है। फिर, अचानक, नेटवर्क ठप हो जाता है।<br><br>आपको सतोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति से एक होलोकैट प्राप्त होता है। (यह किसी भी अन्य ई-होलोग्राम की तरह है, लेकिन यह एक बिल्ली के आकार का है)। आप इसकी नाक को उछाल कर प्रलय खोलते हैं, यह सुनने के लिए उत्सुक हैं कि इसे क्या कहना है ...',
    project: {
      title: 'मजे से बनाया है',
      paragraph_one:
        'सातोशी को सहेजना डेवलपर्स के लिए संपर्क का एक हल्का-फुल्का पहला बिंदु है जो बिटकॉइन के विकास के बारे में उत्सुक हैं। सेविंग सातोशी में तकनीकी पाठ और कोड-आधारित चुनौतियों का मिश्रण है, लेकिन बुनियादी कोडिंग कौशल वाले किसी भी व्यक्ति के लिए चुनौतियाँ साध्य होनी चाहिए। यह परियोजना स्वतंत्र और खुला स्रोत है और सभी कलाओं को मिडजर्नी जैसे टेक्स्ट-टू-इमेज (उर्फ एआई) टूल का उपयोग करके उत्पन्न किया गया है।',
      paragraph_two:
        'परियोजना का यह संस्करण वर्तमान में समग्र अनुभव पर प्रतिक्रिया प्राप्त करने और शुरुआती उपयोगकर्ताओं के लिए अवधारणा का प्रमाण प्रदान करने के लक्ष्य के साथ एक डेमो स्थिति में है। इसके आलोक में, उपयोगकर्ता की प्रगति ब्राउज़र में स्थानीय रूप से संग्रहीत की जाती है और छवियों के साथ कहानी को अंतिम रूप नहीं दिया जाता है।',
      paragraph_three:
        'हमें प्राप्त फीडबैक के आधार पर, हम फिर एक आधिकारिक रिलीज़ (हम इसे V1 कहते हैं) की दिशा में काम करेंगे जिसमें 2-3 पूर्ण पाठ अध्याय, खाते और बहुत कुछ शामिल हैं। 10 अध्यायों की योजना बनाई गई है और समय के साथ उन्हें पूरा कर लिया जाएगा। अतिरिक्त सुविधाओं में सहयोगी शिक्षा, बैज, अतिरिक्त-चुनौतीपूर्ण पक्ष खोज, और बहुत कुछ शामिल हो सकते हैं।',
    },
    contributing: {
      title: 'योगदान कैसे करें',
      paragraph_one:
        'हम एक ओपन-सोर्स प्रोजेक्ट हैं, इसलिए इसे आकार देने में आपकी मदद के लिए सभी दरवाजे खुले हैं।',
      feedback: {
        title: 'प्रतिक्रिया',
        paragraph_one:
          'योगदान करने का वास्तव में एक बढ़िया तरीका है अध्याय 1 को पढ़ना और हमें इस फ़ॉर्म का उपयोग करने के आपके समग्र अनुभव पर कोई फ़ीडबैक देना।',
      },
      contribute: {
        title: 'योगदान देना',
        paragraph_one:
          'सभी सुझावों का स्वागत है, सामग्री परिवर्तन, खेल यांत्रिकी सहित - वास्तव में कुछ भी। हम हमेशा समीक्षा और <a href="https://leaf-singer-0fc.notion.site/How-to-QA-5177e63f65a4406da01bc57d886b5ac2" target="_blank" rel="noreferrer">क्यूए-इंग कोड परिवर्तन</a>। कोड सुधार के लिए, आप सीधे किसी समस्या को खोल सकते हैं या GitHub पर पुल अनुरोध सबमिट कर सकते हैं।',
        paragraph_two:
          'यदि आप डिज़ाइन, कहानी, या किसी अन्य चीज़ में शामिल होना चाहते हैं, तो <a href="https://discord.gg/DC8Dys4G3h" target="_blank" rel="noreferrer">Bitcoin Design Discord</a> में #Saving-satoshi चैनल में हमसे जुड़ें। उल्लेख करें कि आप कैसे योगदान देना चाहते हैं और हम आपको सही दिशा में इंगित करने में मदद करेंगे।',
      },
    },
    contributors: {
      title: 'आनंद लीजिये!',
      contributions_by: 'द्वारा योगदान',
      many_more:
        'और <a href="https://github.com/Saving-satoshi/Saving-satoshi/graphs/contributors" target="_blank" rel="noreferrer">और भी बहुत से लोगो द्वारा</a>।',
    },
    satoshi_needs_you: 'अब जल्दी करो, सातोशी को तुम्हारी जरूरत है।',
  },

  ///CHAPTERS TITLE PAGE
  chapter_one: {
    title: 'स्पष्ट दृष्टि में राज़ ',
    paragraph_one:
      'वर्ष 2139 है। अंतिम बिटकॉइन खनन होने से दो सप्ताह बाद है। सतोशी स्क्वायर में महीनों से एक घड़ी टिक-टिक कर रही है। दुनिया आखिरी ब्लॉक का इंतजार कर रही है।',
    paragraph_two: 'तभी अचानक नेटवर्क ठप हो गया।',
    intro_one: {
      title: 'उत्पत्ति',
      paragraph_one: 'क्षण भर बाद, आपकी होवर स्क्रीन सक्रिय हो जाती है।',
      paragraph_two:
        '-Deborah Chunk: "Thomas Vanderpoole। BitRey के CEO के रूप में, आप दुनिया के सबसे बड़े बिटकॉइन माइनिंग पूल में से एक चलाते हैं। आप बिटकॉइन माइनिंग मशीन भी बनाते हैं। क्या हो रहा हिया? क्या बिटकॉइन मर रहा है?"',
      paragraph_three:
        '-Vanderpoole: "हाँ, मैं करता हूँ, Deborah। उससे पहले मेरे डैडी और उनके डैडी की तरह। Vanderpoole 21,000 ब्लॉक के बाद से खनन कर रहे हैं। इसलिए मैं विश्वास के साथ कह सकता हूं कि दुनिया भर के खनिक अपनी मशीनों को बंद करके इस देरी का कारण बन रहे हैं। यह एक विरोध है। कोई नहीं चाहता कि बिटकॉइन 21 मिलियन पर जारी होना बंद हो। हम केवल फीस पर जीवित नहीं रह सकते हैं।',
      start: 'जारी रखना',
    },
    intro_two: {
      title: 'उत्पत्ति',
      paragraph_one:
        'सतोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति से आपको एक होलोकैट प्राप्त होता है। (यह किसी भी अन्य ई-होलोग्राम की तरह है, लेकिन यह एक बिल्ली के आकार का है।) आप इसकी नाक को उछाल कर होलोकेट को खोलते हैं।',
      paragraph_two:
        '—“बिटकॉइन मर नहीं रहा है, लेकिन इसे आपकी मदद की जरूरत है। बिल्ली को मत भूलना। – सातोशी नाकामोतो',
      paragraph_three:
        '—सातोशी? सातोशी? नहीं, यह नहीं हो सकता। उन्हें एक सदी से अधिक समय से मृत मान लिया गया है। क्या वे नहीं हैं?',
      paragraph_four: 'क्या वे नहीं हैं?',
      paragraph_five:
        'होलोकैट: "बेहतर होगा कि आप काम पर लग जाएं। मैं मदद कर सकता हूं, लेकिन आपको म्याऊ शुरू करना होगा।',
    },
    genesis_one: {
      title: 'उत्पत्ति',
      heading: 'आपकी पहली चुनौती',
      paragraph_one:
        'बिटकॉइन सेंसरशिप प्रतिरोधी पैसा है। कोई भी व्यक्ति नेटवर्क पर लेन-देन प्रसारित करके पैसा भेज सकता है। प्रसारण के बाद, खनिकों द्वारा लेन-देन को ब्लॉक में पैक किया जाता है। श्रृंखला पर निर्माण के विशेषाधिकार के लिए खनिक अन्य खनिकों के खिलाफ प्रतिस्पर्धा करते हैं। यही बिटकॉइन को विकेंद्रीकृत रखता है।',
      paragraph_two:
        'बिटकॉइन के छद्म नाम के आविष्कारक सतोशी नाकामोटो ने भी पहले बिटकॉइन ब्लॉक का खनन किया। उसने दुनिया को पहले बिटकॉइन लेनदेन में एक गुप्त संदेश छोड़ा था जो कभी भी किया गया था। आपकी पहली चुनौती इसे ढूंढना और डिकोड करना है।',
    },
    genesis_two: {
      title: 'उत्पत्ति',
      heading: 'छिपे हुए संदेश को खोजें',
      paragraph_one:
        'आइए बिटकॉइन ब्लॉकचेन में सबसे पहले ब्लॉक को खोजें। नीचे दिए गए बटन पर क्लिक करके एक ' +
        '<Tooltip id="genesis_two_paragraph_one" content={chapter_one.genesis_two.tooltip_block_explorer} theme="bg-[#30435b]">' +
        'ब्लॉक एक्सप्लोरर' +
        '</Tooltip>' +
        ' को ठीक ब्लॉक 0 पर खोलें, जिसे उत्पत्ति ब्लॉक कहा जाता है।',
      paragraph_two: `नीचे स्क्रॉल करें और इस ब्लॉक में संग्रहीत एकमात्र लेन-देन के विवरण को खोलें। “कॉइनबेस” नामक इनपुट खोजें। अब “SCRIPTSIG (<Tooltip id="genesis_two_paragraph_two" content={chapter_one.genesis_two.tooltip_hex} theme="bg-[#30435b]">HEX</Tooltip>)” लेबल देखें। इसके आगे दिया गया मान एक एन्कोडेड संदेश है।`,
      paragraph_three: 'उस मान को कॉपी करें और नीचे पेस्ट करें।',
      tooltip_block_explorer:
        'एक <a href="https://bitcoinops.org/en/topics/block-explorers/" target="_blank" rel="noreferrer">' +
        'ब्लॉक एक्सप्लोरर</a> एक उपयोगी टूल है, जिसकी मदद से बिटकॉइन लेन-देन से संबंधित जानकारी को जल्दी खोजा जा सकता है।',

      tooltip_hex:
        'हेक्साडेसिमल एक संख्या प्रणाली है जो आधार 16 का उपयोग करती है और बिटकॉइन में डेटा को ' +
        'संक्षिप्त रूप से दर्शाने के लिए उपयोग की जाती है। ' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520hexadecimal%2520encoding%2520and%2520why%2520is%2520it%2520used%2520in%2520Bitcoin%253F" ' +
        'target="_blank" rel="noreferrer">' +
        'और जानें' +
        '</a>',
      view_block_0: 'ब्लॉक 0 देखें',
      placeholder: 'आपको जो वैल्यू मिली है उसे यहां पेस्ट करें',
    },
    genesis_three: {
      title: 'उत्पत्ति',
      heading: 'आइए संदेश को डिकोड करें',
      paragraph_one:
        'आपको जो संदेश मिला वह हेक्स नामक प्रारूप में एन्कोड किया गया था। अब हम इसे ' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520ASCII%2520encoding%2520and%2520why%2520is%2520it%2520used%253F" target="_blank" rel="noreferrer" className="underline">' +
        'ASCII' +
        '</a>' +
        ' में बदलने के लिए एक कमांड चलाएंगे, जिसे हम पढ़ सकेंगे।',

      paragraph_two:
        'नीचे दिए गए आदेश को टर्मिनल में दाईं ओर कॉपी और पेस्ट करें और "एंटर" दबाएं।',
      terminal_challenge_lines: `यहां अपने आदेश दर्ज करें और एंटर दबाएं...\n चर $scriptSigHex आपके लिए पहले से परिभाषित है।\n\n var $scriptSigHex = '04fff...e6b73'`,
      waiting_for_input:
        'स्क्रिप्ट लिखने और चलाने के लिए आपका इंतज़ार किया जा रहा है...',
      success:
        'बहुत बढ़िया! डिकोड किया गया संदेश जनवरी 3,2009 से <Link href="https://en.bitcoin.it/wiki/Genesis_block" className="underline">The Times</Link> के पहले पन्ने का संदर्भ देता है, उसी दिन सातोशी ने खनन किया था उत्पत्ति ब्लॉक। कितना मजेदार है!?! यह संदेश हमें बिटकॉइन बनाने के लिए उनकी प्रेरणा के बारे में भी कुछ जानकारी देता है।\n\n चलो ऐसे ही चलते रहें।',
    },
    genesis_four: {
      title: 'उत्पत्ति',
      subtitle: 'बधाई! आपने पहली चुनौती पूरी की!',
      paragraph_one:
        'आपको जेनेसिस ब्लॉक में सन्निहित गुप्त संदेश सातोशी नाकामोटो मिला। आपने अभी जो सीखा है, उस पर विस्तार करने का समय आ गया है। अगली चुनौती में कहानी के बारे में एक महत्वपूर्ण सुराग को डिकोड करें।',
    },
    transacting_one: {
      title: 'लेनदेन',
      heading: 'लेन-देन में क्या है?',
      paragraph_one:
        'लेन-देन के दो भाग होते हैं: इनपुट और आउटपुट। पिछले अभ्यास में हमने लेन-देन इनपुट के अंदर पाए गए एक गुप्त संदेश को डिकोड किया था। इस बार हम एक संदेश को डिकोड करेंगे जो आउटपुट भाग से संबंधित है।',
      paragraph_two:
        'निम्नलिखित लेन-देन के लिए, हम OP_RETURN प्रकार के आउटपुट की पहचान करने जा रहे हैं।',
    },
    transacting_two: {
      title: 'लेनदेन',
      heading: 'OP_RETURN',
      paragraph_one:
        'लेन-देन में गुप्त संदेशों को छिपाने का एक और तरीका है। बिटकॉइन में एक विशेष प्रकार का कोड है जिसे OP_RETURN कहा जाता है जो उपयोगकर्ताओं को लेनदेन आउटपुट में संदेश संलग्न करने की अनुमति देता है। आइए देखें कि क्या हम एक खोज सकते हैं।',
      paragraph_two:
        '1. विशिष्ट लेन-देन देखने के लिए <Link href="https://blockstream.info/tx/ff9148605a772a51cba39004df5fb042d40515967a3e38ff5294cfd017c452a9" className="underline">यहां</Link> क्लिक करें।',
      paragraph_three:
        '2. विवरण खोलें और वह भाग ढूंढें जो "OP_RETURN" प्रकार का है।',
      paragraph_four:
        '3. अब "SCRIPTPUBKEY (ASM)" फ़ील्ड खोजें। "OP_RETURN OP_PUSH_BYTES_28" भाग देखें? इन्हें ओपकोड कहा जाता है। हम वास्तव में इसमें रुचि रखते हैं कि उनके बाद क्या आता है।',
      paragraph_five:
        '4. "OP_RETURN OP_PUSHBYTES_28" के बाद संख्याओं की लंबी स्ट्रिंग को कॉपी करें और नीचे पेस्ट करें।',
      input_challenge_label: 'OP_RETURN प्रकार दर्ज करें',
    },
    transacting_three: {
      title: 'लेनदेन',
      heading: 'एक और गुप्त संदेश',
      paragraph_one:
        'हमने लेन-देन आउटपुट के उस हिस्से की पहचान की है जो संदेश को धारण करता है।',
      paragraph_two:
        'अब जो कुछ बचा है, उसे डिकोड करना है, ठीक वैसे ही जैसे हमने पिछले अभ्यास में किया था।',
      paragraph_three:
        '$scriptPubKey बाइट्स फिर से देखने की आवश्यकता है? यह लो।',
      link: 'लेन-देन देखें',
      terminal_challenge_success:
        'यह सही है! अच्छा काम।\n\n जैसा कि आप देख सकते हैं, सुराग एक पता है। यह करने के लिए जाना है।\n\n आपकी अगली चुनौती आपका इंतजार कर रही है।',
      terminal_challenge_lines:
        'यहां अपने आदेश दर्ज करें और एंटर दबाएं...\n\n Command: \n echo $scriptPubKeyBytes | xxd -r -p \n\n ध्यान दें कि इस बार आपके लिए $scriptPubKeyBytes परिभाषित नहीं है। आपको इस चर को कोड में उस मान से बदलना होगा जो आपने पिछली चुनौती में पाया था',
      terminal_challenge_error:
        'लगभग! याद रखें कि इस बार आपके लिए वेरिएबल $scriptPubKeyBytes सेट नहीं है।',
    },
    outro_one: {
      title: 'आउट्रो',
      paragraph_one:
        'आप अपने गैरेज में भागते हैं, अपने पिता के पुराने सोलोकॉप्टर में कदम रखते हैं, निर्देशांक में पंच करते हैं, और पते पर अपना रास्ता बनाते हैं।',
      paragraph_two:
        'बिल्ली की एलर्जी इतनी तीव्र होने के बावजूद कि वे होलोग्राम पर भी लागू होती हैं, होलोकैट साथ आता है। आप आपत्ति करते हैं, लेकिन बिल्लियाँ तो बिल्लियाँ रहेंगी।',
      button_text: 'अध्याय 1 समाप्त',
    },
    outro_two: {
      title: 'तुमने कर दिखाया!!!',
      description:
        'अद्भुत। आपने पहला अध्याय पूरा किया और बिटकॉइन के बारे में बहुत कुछ सीखा। जब हम नए अध्याय और चुनौतियाँ लॉन्च करते हैं, यह जानने के लिए हमें <Link href="https://twitter.com/Savingsatoshi" className="underline">@Savingsatoshi</Link> पर फ़ॉलो करें।',
    },
    end: {
      save: 'मेरी प्रगति को सहेंजो',
      next: 'बिना सहेजे जारी रखें',
      feedback: 'अपनी प्रतिक्रिया साझा करें',
    },
  },
  chapter_two: {
    title: '51% हमला',
    paragraph_one:
      'नेटवर्क आउटेज को ब्लॉक सब्सिडी से संबंधित होना चाहिए। यह कोई संयोग नहीं है।',
    paragraph_two:
      'जब आप खनन किए जा रहे कुछ ब्लॉकों के बारे में कुछ असामान्य देखते हैं तो आप अपने कंप्यूटर पर खनन पर कुछ शोध करने की उम्मीद करते हैं। ऐसा लगता है कि वे सभी एक ही जगह से आ रहे हैं, संभवतः एक ही खनन पूल से भी। बाकी खनिकों का क्या हुआ?',
    intro_one: {
      title: 'एक योजना तैयार करना',
      paragraph_one:
        'HOLOCAT: “हैए, ये कैसी जगह है। इस जगह पर कुछ सार्डिन या सूखी मछलियों को रखना बेहतर होगा। मैं कुछ ई-निप के लिए भी समझौता करूँगा।',
      paragraph_two:
        'आप उतरते हैं, अपने आप को स्थिर करते हैं, और प्रवेश के बिंदु की तलाश करते हैं। वहां, उस टूटी हुई खिड़की से बात बन सकती है। आप एक ईंट के साथ खिड़की से जो बचा है उसे बाहर निकालते हैं, और अंदर कूदते हैं। इमारत हजारों धूल भरी, अच्छी तरह से संरक्षित बिटकॉइन खनिकों से भरी हुई है।',
      paragraph_three: {
        a: '—HOLOCAT: “यह कोई गोदाम नहीं है; यह एक संग्रहालय है। मुझे लगता है कि ये Vanderpoole परिवार के पुराने बिटकॉइन माइनिंग उपकरण हैं। बिटकॉइन के शुरुआती दिनों में, माइनर्स सामान्य प्रयोजन वाले कंप्यूटरों का उपयोग करके बिटकॉइन का खनन करते थे। लेकिन कुछ वर्षों बाद, माइनर्स को एहसास हुआ कि वे एक विशेष चिप वाली मशीनों का उपयोग कर सकते हैं, जिन्हें एप्लिकेशन-विशिष्ट इंटीग्रेटेड सर्किट, या ',
        b: ' संक्षेप में कहा जाता है। ये चिप्स केवल एक ही काम करती हैं: बिटकॉइन का खनन। उनका सीमित उद्देश्य उनकी दक्षता बढ़ाता है और माइनर्स को कम ऊर्जा खर्च करने में मदद करता है, जिससे उन्हें बढ़त मिलती है। क्या आप विश्वास कर सकते हैं कि कभी लोग अपने लैपटॉप से बिटकॉइन का खनन करते थे?”',
      },
      paragraph_four: `यह Vanderpoole परिवार के संग्रह में मौजूद सभी मशीनों की व्याख्या करता है।`,
      tooltip_one: {
        question: `ASIC माइनर क्या है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520an%2520ASIC%2520miner%253F`,
        highlighted: `ASIC`,
      },
    },
    intro_two: {
      title: 'एक योजना तैयार करना',
      paragraph_one:
        'कोने में, एक मंद, बमुश्किल काम करने वाला कंप्यूटर मॉनिटर, जिस पर एक नोट चिपका हुआ है, पलक झपकते बैठा है। नोट कहता है "उन्हें चालू करें, बेवकूफ।"',
      paragraph_two: 'होलोकैट: "कितना अशिष्ट है।"',
      paragraph_three:
        'वाह, एक यांत्रिक कीबोर्ड। होलोकैट कीबोर्ड पर कूदता है और उस पर चलता है, आपको दिखाता है कि किस कुंजी को हिट करना है।',
    },
    hashing_one: {
      title: `शून्य`,
      nav_title: `कंप्यूटर चालू होता है`,
      paragraph_one: `या तो संयोग से, या क्योंकि होलोकैट को सच में पता था कि वह क्या कर रही है, जिन बेतरतीब अक्षरों और अंकों पर उसने कदम रखा, वे बदलकर बन जाते हैं... और भी बेतरतीब अक्षर और अंक?`,
      list_one: `> QX23Y6VGECTUKSNIEUTUB[P[pihof`,
      list_two: `> 1c31d1d9fb848a505fc0cdbea848ff1bdd46a9ed4d639d413d3a93035194eedf`,
      paragraph_two: `मॉनिटर पर लिखा आता है: "गलत हैश। फिर से प्रयास करें।"`,
      paragraph_three: `बेशक होलोकैट ने जो भी बकवास टाइप की थी, वह गलत ही थी। आखिर वह सिर्फ़ एक अकड़ू होलोग्राफिक बिल्ली है!`,
      paragraph_four: `अगर आप कुछ अलग टाइप करें तो क्या होगा?`,
    },

    hashing_two: {
      title: `शून्य`,
      nav_title: `कुछ हैश करने की कोशिश करें`,
      heading: `कुछ भी लिखें`,
      return_hash: `नीचे आप देखेंगे कि आपका इनपुट एक हैश में बदल गया है`,
      progress_message: `जारी रखें...`,
      success_message: `ठीक है, अच्छा काम। अब आगे बढ़ते हैं।`,
    },

    hashing_three: {
      title: `शून्य`,
      nav_title: `SHA256 की शक्ति`,
      heading: `क्या आपने हैश के बारे में कुछ खास देखा?`,
      list_one: `उँगलियों के निशान की तरह, हैश भी अद्वितीय होते हैं। कुछ असाधारण परिस्थितियों को छोड़कर, दो अलग-अलग चीज़ों के हैश कभी एक जैसे नहीं होने चाहिए।`,
      list_two: `हैश फ़ंक्शन एकतरफ़ा रास्ते होते हैं। आप किसी हैश को उलटकर यह पता नहीं लगा सकते कि उससे कौन सा डेटा बना था।`,
      list_three: `हैश बेहद भरोसेमंद होते हैं क्योंकि वे निर्धारक होते हैं। इसका मतलब है कि आप एक ही डेटा को बार-बार हैश करेंगे और हर बार वही परिणाम मिलेगा।`,
      paragraph_one: {
        a: `यहाँ उपयोग किया गया फ़ंक्शन कहलाता है `,
        b: `, जो एक बहुत लोकप्रिय विकल्प है।`,
      },
      paragraph_two: `अब देखते हैं कि क्या आप एक विशेष हैश खोज सकते हैं।`,
      paragraph_three: `ऐसा हैश खोजें जो शून्य (“0”) से शुरू होता हो। नीचे अलग-अलग चीज़ें टाइप करते रहें जब तक कि मनचाहा हैश न मिल जाए।`,
      tooltip_one: {
        question: `बिटकॉइन में SHA-256 का उपयोग कैसे किया जाता है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=how%2520is%2520SHA-256%2520used%2520in%2520bitcoin%253F`,
        highlighted: `SHA-256`,
      },
    },

    hashing_four: {
      title: `शून्य`,
      nav_title: `एक शून्य वाला हैश खोजें`,
      heading: `कुछ भी लिखें जब तक कि आपको ऐसा हैश न मिल जाए जो शून्य (“0”) से शुरू होता हो`,
      hint_prompt: `क्या आपको एक <Tooltip id="hint_prompt" position="bottom" theme="bg-[#5e212a]" offset="-1" content="chapter_two.hashing_four.hint_tooltip">संकेत</Tooltip> चाहिए?`,
      hint_tooltip: `<span className="text-m whitespace-nowrap leading-none text-white/50">टाइप करके देखें:</span> <span className="whitespace-nowrap text-white">popcorn</span>`,
    },

    hashing_five: {
      title: `शून्य`,
      nav_title: `थोड़ा और कठिन बनाते हैं`,
      heading: `यह बहुत मुश्किल नहीं था!`,
      paragraph_one: `अब इसे थोड़ा और चुनौतीपूर्ण बनाते हैं। ऐसा हैश खोजने की कोशिश करें जो दो शून्य ("00") से शुरू होता हो।`,
    },

    hashing_six: {
      title: `शून्य`,
      nav_title: `दो शून्य वाला हैश खोजें`,
      heading: `कुछ भी लिखें जब तक कि आपको ऐसा हैश न मिल जाए जो दो शून्य (“00”) से शुरू होता हो`,
      hint_prompt: `क्या आपको एक <Tooltip id="hint_prompt" position="bottom" theme="bg-[#5e212a]" offset="-1" content="chapter_two.hashing_six.hint_tooltip">संकेत</Tooltip> चाहिए?`,
      hint_tooltip: `<span className="text-m whitespace-nowrap leading-none text-white/50">टाइप करके देखें:</span> <span className="whitespace-nowrap text-white">trigonometry</span>`,
    },

    scripting_one: {
      title: 'स्वचालन',
      heading: 'आइए कंप्यूटर को हमारे लिए ऐसा करने दें।',
      paragraph_one:
        'ठीक है, इसमें शायद आपको काफ़ी समय लग गया। अब एक हैश खोजने की कल्पना करें जो पाँच या दस शून्य से शुरू हो। यह वह चुनौती है जो बिटकॉइन नेटवर्क खनिकों के सामने रखता है जब वे लेन-देन के साथ नए ब्लॉक जमा करना चाहते हैं।',
      paragraph_two:
        'खनिक वे सभी सामान लेते हैं जो वे एक ब्लॉक, लेन-देन और संबंधित मेटाडेटा के एक समूह में रखना चाहते हैं, और इसे एक यादृच्छिक संख्या के साथ जोड़ते हैं जिसे नोन्स कहा जाता है। वे ब्लॉक हैश नामक कुछ बनाने के लिए यह सब हैश फ़ंक्शन में भेजते हैं।',
      paragraph_three:
        'बिटकॉइन नेटवर्क को सेट करने में कठिनाई होती है और केवल ब्लॉक हैश स्वीकार करता है जो एक निश्चित संख्या में शून्य से शुरू होता है। हम इसे "डिफीकल्टी" कहते हैं और 2016 के प्रत्येक ब्लॉक में इसका पुनरीक्षण किया जाता है।',
      paragraph_four:
        'अगली चुनौती के लिए, एक स्क्रिप्ट लिखें जो एक हैश ढूंढती है जो पाँच शून्य ("00000") से शुरू होती है।',
    },
    scripting_two: {
      title: `ऑटोमेशन`,
      nav_title: `एक हैश फ़ंक्शन बनाएँ`,
      paragraph_one: `ठीक है, अब अपना खुद का कोड लिखने और चलाने का समय है। एक ऐसा स्क्रिप्ट लिखें जो एक sha256 हैश बनाए जो पाँच शून्य ("00000...") से शुरू होता हो। आपका कोड sha256 फ़ंक्शन को अलग-अलग इनपुट के साथ बार-बार कॉल करता रहे जब तक कि आउटपुट इस शर्त को पूरा न कर ले। अलग-अलग इनपुट पाने के लिए आप एक लूप के अंदर किसी पूर्णांक को बढ़ाते हुए कोशिश कर सकते हैं। क्रिप्टोग्राफी में इस संख्या को अक्सर "नॉन्स" या "number used once" कहा जाता है।`,
      python: {
        paragraph_two: `जब आपको ऐसा नॉन्स मिल जाए जिसका हैश पाँच शून्य से शुरू होता हो, तो उस नॉन्स को फ़ंक्शन से रिटर्न करें। इस फ़ंक्शन को बनाने में आपकी मदद के लिए हम Python की hashlib लाइब्रेरी का उपयोग कर रहे हैं। आवश्यकता होने पर आप नीचे दिए गए बाहरी संसाधनों की मदद ले सकते हैं:`,
        list_one: `<Link href="https://docs.python.org/3/library/hashlib.html" target="_blank" className="underline">hashlib दस्तावेज़ीकरण</Link>`,
        list_two: `<Link href="https://datagy.io/python-sha256/" target="_blank" className="underline">Python फ़ंक्शन ट्यूटोरियल</Link>`,
      },
      javascript: {
        paragraph_two: `जब आपको ऐसा नॉन्स मिल जाए जिसका हैश पाँच शून्य से शुरू होता हो, तो उस नॉन्स को फ़ंक्शन से रिटर्न करें। इस फ़ंक्शन को बनाने में आपकी मदद के लिए हम JavaScript की crypto लाइब्रेरी का उपयोग कर रहे हैं। आवश्यकता होने पर आप नीचे दिए गए बाहरी संसाधनों की मदद ले सकते हैं:`,
        list_one: `<Link href="https://www.geeksforgeeks.org/node-js-crypto-createhash-method/" target="_blank" className="underline">crypto दस्तावेज़ीकरण</Link>`,
        list_two: `<Link href="https://www.educative.io/answers/what-is-node-cryptocreatehashalgorithm-options" target="_blank" className="underline">JavaScript फ़ंक्शन ट्यूटोरियल</Link>`,
      },
    },

    mining_one: {
      title: `खदान में प्रवेश`,
      nav_title: `ब्लॉकों का खनन`,
      heading_one: `अब जब हमें पता है कि खनन कैसे काम करता है, तो चलिए इसे व्यवहार में देखते हैं`,
      heading_two: `अब आप खनन कर रहे हैं`,
      heading_three: `अच्छा काम!`,
      heading_four: `चलो 100 ब्लॉकों तक पहुँचते हैं`,
      heading_five: `आपने कर दिखाया!`,
      paragraph_one: `इस समय, बिटकॉइन नेटवर्क के लिए आवश्यक है कि ब्लॉकों का हैश दस शुरुआती शून्य से शुरू हो। चलिए शुरू करते हैं!`,
      paragraph_two: `इस सरल सिमुलेशन के लिए, हम यह मान लेते हैं कि प्रत्येक ब्लॉक में 3,500 लेन-देन और 0.061 BTC का इनाम और शुल्क शामिल है।`,
      paragraph_two_one: `देखिए क्या आप माइनर्स को चालू कर सकते हैं।`,
      paragraph_three: `पिछले पाठ में आपने जो कोड लिखा था, जो बार-बार हैश की गणना करता है, वह अब चल रहा है।`,
      paragraph_four: `यह तब रुक जाएगा जब इसे दस शुरुआती शून्य वाला हैश मिल जाएगा।`,
      paragraph_five: `क्या आप नॉन्स फ़ील्ड को बढ़ते हुए देख रहे हैं? यह बताता है कि अब तक आपने कितने हैश आज़माए हैं!`,
      paragraph_six: `निम्नलिखित नॉन्स के साथ:`,
      paragraph_seven: `परिणामी हैश है:`,
      paragraph_eight: `इसमें वे दस शुरुआती शून्य हैं जिनकी सभी नए ब्लॉकों को आवश्यकता होती है। चलिए कुछ और ब्लॉकों का खनन करते हैं।`,
      paragraph_eight_one: `माइनर्स को फिर से चालू करें।`,
      paragraph_nine: `इसमें कुछ समय लग सकता है। लेकिन यह आपको दिखाता है कि ब्लॉकों का खनन करना और लेन-देन की पुष्टि करना कितना कठिन है।`,
      paragraph_ten: `वाह! इतनी सारी हैश गणनाएँ करने में काफ़ी कंप्यूटिंग शक्ति लगी। ज़रा देखिए कितने नॉन्स आज़माए गए! इसमें हैश पावर में बढ़ोतरी बहुत मददगार रही, यानी आपके कंप्यूटर द्वारा प्रति सेकंड आज़माए जा सकने वाले हैश की संख्या।`,
      paragraph_eleven: `जैसा कि अपेक्षित था, चूँकि प्रत्येक ब्लॉक में 3,500 लेन-देन होते हैं, इसलिए खनन किए गए 100 ब्लॉकों द्वारा कुल 350,000 लेन-देन की पुष्टि की गई है।`,
      paragraph_twelve: `और लगता है कि इस सारे खनन के लिए आपको एक अच्छा इनाम भी मिला है! ब्लॉक सब्सिडी के अलावा—जो नेटवर्क प्रत्येक ब्लॉक के लिए देता है—आपने लेन-देन शुल्क के रूप में अतिरिक्त आय भी अर्जित की है।`,
      paragraph_thirteen: `याद रखें, यह सिर्फ़ एक सिमुलेशन था। वास्तविकता में प्रत्येक ब्लॉक को औसतन 10 मिनट लगते हैं।`,
      paragraph_fourteen: `साथ ही, यदि हम वास्तव में वर्तमान मेननेट पर खनन कर रहे होते, तो इन ब्लॉकों को खनन करने के लिए कहीं अधिक कंप्यूटिंग शक्ति की आवश्यकता होती।`,
      progress_bar_title: `मिले हुए ब्लॉक`,
      progress_bar_one: `नॉन्स`,
      progress_bar_two: `प्रति सेकंड हैश`,
      progress_bar_three: `पुष्ट किए गए लेन-देन`,
      progress_bar_four: `कमाया गया बिटकॉइन`,
      button_hash: `10x हैश पावर, कृपया`,
      ten_x_hint: `हैशिंग तेज़ करने के लिए 100x बटन दबाएँ!`,
    },

    outro_one: {
      title: `समापन`,
      nav_title: `अध्याय पूर्ण`,
      heading: `शानदार काम!`,
      paragraph_one: `मशीनें गड़गड़ाकर चालू हो जाती हैं। सब कुछ सही तरह से काम करता हुआ लगता है। पुराने मॉनिटर पर एक नक्शा दिखाई देता है, जो दुनिया भर में फैले उन अन्य गोदामों के स्थान दिखाता है जहाँ Vanderpoole परिवार के पुराने माइनिंग उपकरण मौजूद हैं और अब सक्रिय हो चुके हैं। लगता है कि खनन चुनौती पूरी करने पर वे सक्रिय हो गए!`,
      paragraph_two: `—HOLOCAT: “देखो, वहाँ एक संदेश है।”`,
      paragraph_three: `“अच्छा काम। इससे बिटकॉइन को हर दस मिनट में एक ब्लॉक पर वापस लाने में मदद मिलेगी।” – सातोशी नाकामोटो`,
      paragraph_four: `फिर वही?`,
      button_text: 'अध्याय 2 समाप्त',
    },

    resources: {
      hashing_two: {
        hash_functions_heading: `हैश फ़ंक्शन`,
        hash_functions_paragraph: `हैश फ़ंक्शन कोई भी ऐसा फ़ंक्शन होता है जो किसी भी आकार के डेटा को एक निश्चित आकार के मान में बदल सकता है। हैश फ़ंक्शन द्वारा लौटाए गए मानों को हैश मान, हैश कोड, डाइजेस्ट या सरल रूप में हैश कहा जाता है। इन मानों का उपयोग आमतौर पर एक निश्चित आकार की तालिका, जिसे हैश टेबल कहते हैं, को इंडेक्स करने के लिए किया जाता है। हैश फ़ंक्शन का उपयोग करके हैश टेबल को इंडेक्स करने की प्रक्रिया को हैशिंग या स्कैटर स्टोरेज एड्रेसिंग कहा जाता है।`,
        tip: `बस टाइप करते रहें! SHA-256 एल्गोरिदम के कारण हर नया इनपुट एक पूरी तरह से यादृच्छिक हैश उत्पन्न करेगा, भले ही इनपुट बहुत समान हों।`,
        spoiler: `8 अक्षरों वाली कोई चीज़ आज़माएँ।`,
      },

      hashing_four: {
        power_of_random_heading: `यादृच्छिकता की शक्ति`,
        power_of_random_paragraph: `पूरी तरह यादृच्छिक स्थिति की तरह, संभावना के लिहाज़ से SHA-256 हैश फ़ंक्शन हर नए डेटा जोड़ने पर पूरी तरह यादृच्छिक होता है। यदि आप उपन्यास 'War and Peace' को हैश करें और फिर उसमें केवल एक अतिरिक्त अक्षर जोड़ दें, तो परिणामस्वरूप हैश पूरी तरह बदल जाएगा। प्रत्येक नया अक्षर हैश को पूरी तरह यादृच्छिक तरीके से बदल देता है। यह देखते हुए कि हेक्साडेसिमल प्रणाली में 16 संभावित अक्षर होते हैं (0-9 और a-f), '0' से शुरू होने वाला हैश मिलने की संभावना कितनी है?`,
        tip: `क्या आप गणना कर सकते हैं? प्रति अंक 16 संभावित अक्षरों के आधार पर, आपके अनुसार '00' से शुरू होने वाला हैश मिलने की कितनी संभावना है? और '000' का क्या?`,
        spoiler: `अक्षर 's' से शुरू होने वाली कोई चीज़ आज़माएँ।`,
      },

      hashing_six: {
        collision_resistance_heading: `SHA256 और टकराव प्रतिरोध`,
        collision_resistance_paragraph: `SHA-256 एक 256-बिट (64-अक्षर) का हैश मान लौटाता है, जो इनपुट डेटा का एक अद्वितीय प्रतिनिधित्व होता है। यह Merkle–Damgård संरचना पर आधारित हैश फ़ंक्शनों के परिवार से संबंधित है, जो सरल संपीड़न फ़ंक्शनों से हैश फ़ंक्शन बनाने की एक विधि है। इस संरचना में, इनपुट संदेश को निश्चित आकार के ब्लॉकों में विभाजित किया जाता है और एक चेनिंग तंत्र के माध्यम से इन ब्लॉकों को क्रमिक रूप से संसाधित किया जाता है। यह प्रक्रिया तब तक चलती है जब तक पूरा संदेश संसाधित न हो जाए और अंतिम हैश मान प्राप्त न हो जाए। SHA-256 की मज़बूत सुरक्षा विशेषताएँ और टकराव प्रतिरोध इसे आधुनिक क्रिप्टोग्राफी में डेटा अखंडता और प्रमाणीकरण का एक महत्वपूर्ण आधार बनाते हैं।`,
        tip: `इस पाठ में कोई विशेष सुझाव नहीं है। जैसे-जैसे आप Saving Satoshi में आगे बढ़ेंगे, आप पाएँगे कि हम आपकी मदद कम करते जाते हैं और आपको स्वयं समाधान खोजने देते हैं।`,
        spoiler: `यह जानते हुए कि हर नया अक्षर एक पूरी तरह यादृच्छिक हैश की पुनर्गणना करता है, आप नए अक्षर जोड़ते रह सकते हैं जब तक कि हैश '00' या उससे अधिक से शुरू न हो जाए… या फिर 'trigonometry' शब्द आज़मा सकते हैं।`,
      },

      scripting_one: {
        hash_libraries_heading: `हैश फ़ंक्शन`,
        hash_libraries_paragraph: `Node.js की crypto लाइब्रेरी और Python की hashlib लाइब्रेरी वे कोड लाइब्रेरीज़ हैं जो उन एल्गोरिदम को लागू करती हैं जिन्हें हम डेवलपर्स के लिए उपयोगी टूल के रूप में इस्तेमाल करते हैं। इन लाइब्रेरीज़ की गहन जाँच की जाती है ताकि उनकी शुद्धता और सुरक्षा सुनिश्चित की जा सके, क्योंकि कई लोग इन पर मूल्यवान और महत्वपूर्ण प्रणालियों को सुरक्षित रखने के लिए निर्भर करते हैं।`,
        nonce_heading: `नॉन्स`,
        nonce_paragraph: `नॉन्स, जिसका पूरा नाम “number used once” है, एक यादृच्छिक या अर्ध-यादृच्छिक संख्या होती है जिसका उपयोग विभिन्न क्रिप्टोग्राफ़िक और संगणनात्मक प्रक्रियाओं में किया जाता है। इसका मुख्य उद्देश्य अप्रत्याशितता जोड़ना और यह सुनिश्चित करना है कि किसी विशेष प्रक्रिया या गणना को आसानी से दोहराया या अनुमानित न किया जा सके। बिटकॉइन खनन की सुरक्षा में नॉन्स की भूमिका बेहद महत्वपूर्ण है, लेकिन इसके बारे में हम आगे और जानेंगे...`,
        tip_one: `सुनिश्चित करें कि आप इनपुट को सही तरीके से डिकोड कर रहे हैं। हैशिंग एल्गोरिदम अक्सर बाइट्स में डिकोड किए गए ऑब्जेक्ट लौटाते हैं, लेकिन हमें उन्हें हेक्स प्रारूप में पढ़ने योग्य बनाना होता है!`,
        tip_two: `सोचिए कि आप ऐसा फ़ंक्शन कैसे बनाएँगे जो तब तक चलता रहे जब तक उत्तर किसी निश्चित मान के बराबर न हो जाए।`,
        tip_three: `याद रखें कि अपने उत्तर को <span className="p-1 font-mono bg-[#0000004D] m-1">console.log()</span> या <span className="p-1 font-mono bg-[#0000004D] m-1">print()</span> के साथ लॉग करें। यही एक तरीका है जिससे हमारा IDE आपके उत्तर को मान्य करने की कोशिश करेगा।`,
      },

      mining_one: {
        mining_heading: `खनन`,
        mining_paragraph: `खनन वह प्रक्रिया है जहाँ ये सभी अवधारणाएँ एक साथ आती हैं। बिटकॉइन खनन वह प्रक्रिया है जिसके द्वारा नए बिटकॉइन बनाए जाते हैं और लेन-देन को ब्लॉकचेन में जोड़ा जाता है। माइनर्स प्रत्येक ब्लॉक के लेन-देन में एक अद्वितीय और मान्य ‘नॉन्स’ खोजकर जटिल गणितीय पहेलियाँ हल करने के लिए प्रतिस्पर्धा करते हैं। यह प्रूफ़-ऑफ़-वर्क प्रक्रिया काफ़ी अधिक कंप्यूटिंग शक्ति और ऊर्जा की माँग करती है, जिससे यह लेन-देन को मान्य करने का एक सुरक्षित और विकेंद्रीकृत तरीका बनती है। सफल माइनर्स को नए बनाए गए बिटकॉइन और लेन-देन शुल्क के रूप में इनाम मिलता है, और वे बिटकॉइन नेटवर्क की अखंडता बनाए रखने में महत्वपूर्ण भूमिका निभाते हैं।`,
        difficulty_heading: `कठिनाई`,
        difficulty_paragraph: `खनन की कठिनाई यह सुनिश्चित करती है कि प्रत्येक नए ब्लॉक के बीच औसतन 10 मिनट का समय बना रहे।`,
        spoiler: `यहाँ कुछ भी छिपाने जैसा नहीं है! बस आगे बढ़ें और इस पाठ को पढ़ें। भविष्य के पाठों में आपको अपने खनन ज्ञान को दिखाने के और भी अवसर मिलेंगे!`,
      },
    },
  },
  chapter_three: {
    title: 'अपने पुरस्कारों का दावा करना',
    paragraph_one:
      'हूफ, वह करीब था। आप अभी भी अमेस्ट्रिस के खिलाफ अपनी लड़ाई से काँप रहे हैं, फिर भी राहत मिली है कि एक जीत संभव थी।',
    paragraph_two:
      'जैसे ही आप अपनी डेस्क पर बैठते हैं, आप एक गहरी सांस लेते हैं और दिन की घटनाओं को फिर से चलाने के लिए आगे बढ़ते हैं। आपके हाथ खुद को रहस्यमय लिफाफे के साथ खेलने में व्यस्त रखते हैं, क्योंकि आपको आश्चर्य होता है कि इसे किसने भेजा है। जो अभी भी वैसे भी लिफाफों का उपयोग करता है, यह 2139 है। इससे भी अधिक उत्सुकता यह है कि इस पर 2008 से एक मोहर है... क्या यह एक और संकेत हो सकता है?',
    paragraph_three:
      'अचानक, आपको एहसास होता है कि आपने एमेस्ट्रिस के साथ अपनी प्रतिस्पर्धा से कभी भी ब्लॉक पुरस्कार का दावा नहीं किया। आपका बिटकॉइन वॉलेट कम चल रहा है, इसलिए अब इसे फिर से टॉप अप करने का अच्छा समय है।',
    paragraph_four: `यह महज संयोग नहीं है।`,

    intro_one: {
      title: `परिचय`,
      nav_title: `हैशिंग पर चर्चा`,
      paragraph_one: `—सातोशी नाकामोटो: “अरे, तुम! हाँ, तुम ही! मुझे याद है? इस समय बिटकॉइन पर 51% अटैक हो रहा है! जब तुमने उन माइनिंग डिवाइसेज़ को ऑनलाइन किया, वैंडरपूल ने BitRey के ASICs फिर से चालू कर दिए और खाली ब्लॉक्स माइन कर रहा है। समस्या सिर्फ उसकी मशीनें नहीं हैं। उसने स्टैंडर्ड ASIC फर्मवेयर में एक बैकडोर का इस्तेमाल करके मौजूदा माइनर्स को एक वायरस से संक्रमित कर दिया है, जो उन्हें खाली ब्लॉक्स के अलावा कुछ भी माइन करने से रोकता है। वह बिटकॉइन इकोसिस्टम को बंधक बनाने और लोगों को बिटकॉइन की सप्लाई बढ़ाने के विचार का समर्थन करने के लिए मजबूर करने की कोशिश कर रहा है। कुछ करो, डिंगडोंग!”`,
      paragraph_two: `पुराना कंप्यूटर खाँसते हुए धूल का गुबार छोड़ता है, फिर “स्प्रेडशीट” नाम का डेटा का एक पुलिंदा निकालता है, जिसमें कुछ सबसे बड़े बिटकॉइन माइनर्स की संपर्क जानकारी है, साथ ही वायरस के लिए एक पैच भी है। जितनी जल्दी तुम यह पैच दूसरे माइनर्स तक पहुँचा सकोगे, उतनी जल्दी वे अपनी मशीनों पर फिर से नियंत्रण पा सकेंगे और BitRey के खिलाफ तुम्हारी लड़ाई में शामिल हो सकेंगे।`,
      paragraph_three: `—HOLOCAT: “हमें और काम करना है। खैर, तुम्हें करना है। मैं दीवारों के आर-पार दौड़ने और चूहों को डराने जा रहा हूँ।”`,
    },

    solo_one: {
      title: `तुम बनाम BitRey`,
      nav_title: `अकेले माइनिंग`,
      step_zero_heading: `चलो इसे आज़माते हैं`,
      step_zero_paragraph_one: `जिन माइनर्स से तुमने संपर्क किया है, उनके इंतज़ार के दौरान तुम यह देखने का फैसला करते हो कि क्या BitRey को अकेले रोका जा सकता है। शायद बिना किसी मदद के ही खाली ब्लॉक्स को खत्म किया जा सके। यहाँ यह दिखाया गया है कि तुम्हारी हैशरेट कैसी है। तुम्हें क्या लगता है, यह कैसे जाएगा?`,
      step_one_heading: `दौड़ शुरू`,
      step_one_paragraph_one: `अब हम 100 ब्लॉक्स माइन कर रहे हैं यह देखने के लिए कि BitRey के मुकाबले तुम कितने ब्लॉक्स जमा कर पाते हो।`,
      step_two_heading: `यह अच्छा नहीं रहा!`,
      step_two_paragraph_one: `अरे बाप रे, हमारे पास BitRey और वायरस-नियंत्रित माइनर्स से मुकाबला करने के लिए पर्याप्त हैशपावर नहीं है। चलो देखते हैं कि क्या दूसरे माइनर्स के साथ मिलकर अगले 100 ब्लॉक्स में BitRey को हराया जा सकता है। बिटकॉइन एक सदी से भी ज़्यादा समय से चल रहा है और बिना लड़े हार नहीं मानेगा।`,
    },

    pool_one: {
      title: `पूल बनाम BitRey`,
      nav_title: `दोस्त ढूँढना`,
      waiting_screen_heading: `हमें समर्थन चाहिए!`,
      waiting_screen_paragraph_one: `वेयरहाउस में मौजूद तुम्हारे माइनर्स का कोई मौका नहीं है। अगर तुम अपनी हैश पावर को दूसरे माइनर्स के साथ जोड़ो, तो शायद BitRey के हमले के खिलाफ मोर्चा संभाल सको।`,
      waiting_screen_paragraph_two: `चलो तब तक इंतज़ार करें जब तक बाकी लोग तुम्हारे उद्देश्य में शामिल न हो जाएँ, ताकि हम ताकत जोड़ सकें।`,
      waiting_button: `इंतज़ार...`,
      continue_button: `चलो शुरू करें`,
    },

    pool_two: {
      title: `पूल बनाम BitRey`,
      nav_title: `साथ मिलकर माइनिंग`,
      step_zero_heading: `चलो चलते हैं`,
      step_zero_paragraph_one: `दूसरे माइनर्स के साथ अपनी हैशरेट को मिलाकर, क्या तुम BitRey का सामना कर सकते हो?`,
      step_two_heading: `एक और हार!`,
      step_two_paragraph_one: `कुछ गड़बड़ है। सिर्फ Hashrate Hoppers ने ही ब्लॉक्स पाए। तुम्हें क्या लगता है, ऐसा क्यों हुआ?`,
    },

    coop_one: {
      title: `कोऑप बनाम BitRey`,
      nav_title: `कुछ गलत हो गया`,
      heading: `अभी भी कुछ ठीक नहीं है।`,
      paragraph_one: `Hashrate Hoppers, जिसके पास सबसे ज़्यादा हैश पावर है, सारे ब्लॉक्स पा रहा है लेकिन बाकी किसी को कुछ नहीं मिल रहा।`,
      paragraph_two: `समस्या यह है कि माइनिंग के दौरान सभी एक ही नॉन्स चेक कर रहे हैं। तुम बेहतर तालमेल कैसे बना सकते हो?`,
      paragraph_three: `तुम यह तय करते हो कि हर एक के लिए ब्लॉक डेटा तैयार करते समय “extraNonce” में एक यूनिक आइडेंटिफ़ायर डाला जाए, ताकि दोहराव वाली मेहनत से बचा जा सके।`,
    },

    coop_two: {
      title: `कोऑप बनाम BitRey`,
      nav_title: `extraNonce`,
      heading: `extraNonce क्या है?`,
      paragraph_one: `Stratum माइनिंग पूल प्रोटोकॉल (बिटकॉइन प्रोटोकॉल नहीं) में, कॉइनबेस ट्रांज़ैक्शन में “extra nonce” नाम की एक चीज़ भी होती है। माइनर्स को ब्लॉक डेटा देते समय, माइनिंग पूल extra nonce को दो हिस्सों में बाँट देते हैं: “extranonce1” और “extranonce2”。`,
      paragraph_two: `extra nonce को दो हिस्सों में बाँटने के कई फायदे हैं:`,
      list_one: `यह पूल के प्रतिभागियों को एक ही काम करने से रोकता है।`,
      list_two: `यह पूल को सभी माइनर्स को एक ही ट्रांज़ैक्शन लिस्ट भेजने की अनुमति देता है जो साथ में पूल कर रहे हैं। इसका मतलब है कि माइनर्स को सिर्फ “extranonce2” अपडेट करना होता है और ब्लॉक में शामिल ट्रांज़ैक्शनों को बदलने की ज़रूरत नहीं होती।`,
      list_three: `“extranonce1” पूल को शेयर योगदान की पहचान और निर्धारण करने की अनुमति देता है क्योंकि हर माइनर को उसका अपना “extranonce1” मिलता है।`,
      paragraph_three: `जो माइनर्स पूल में योगदान देते हैं, वे “extranonce2” अपडेट करते हैं और ब्लॉक हेडर में नॉन्स के ज़रिए चक्र करते हैं। अगर उन्हें समाधान नहीं मिलता, तो वे अलग “extranonce2” के साथ प्रक्रिया दोहराते हैं जब तक समाधान न मिल जाए।`,
      paragraph_four: `चलो इस तरीके से काम बाँटकर फिर से कोशिश करते हैं।`,
    },

    coop_three: {
      title: `कोऑप बनाम BitRey`,
      nav_title: `टीमवर्क के साथ माइनिंग`,
      step_zero_heading: `एक बार और...`,
      step_zero_paragraph_one: `चलो देखते हैं कि नॉन्स स्पेस को बाँटने की हमारी बेहतर रणनीति के साथ अब हमारे पास BitRey के खिलाफ कोई मौका है या नहीं।`,
      step_two_heading: `तुमने कर दिखाया!`,
      step_two_paragraph_one: `तुम और बाकी माइनर्स ने मिलकर BitRey की नेटवर्क पर कब्ज़ा करने की कोशिश को रोक दिया।`,
    },

    split_one: {
      title: `रिवॉर्ड बाँटना`,
      nav_title: `न्यायसंगत हिस्से का बँटवारा`,
      heading: `बहुत बढ़िया।`,
      paragraph_one: `तुमने न सिर्फ BitRey के खिलाफ नेटवर्क की रक्षा की, बल्कि इनाम के तौर पर बिटकॉइन भी कमाए!`,
      paragraph_two: `हर माइन किए गए ब्लॉक के लिए माइनर को बिटकॉइन में इनाम मिलता है। अगर एक से ज़्यादा लोगों ने ब्लॉक पर काम किया, तो माइनर्स के समूह (माइनिंग पूल) को साझा करने के लिए इनाम मिलता है।`,
      paragraph_three: `यह इनाम दो चीज़ों से मिलकर बनता है:`,
      list_one: `ब्लॉक में शामिल सभी ट्रांज़ैक्शनों की फीस`,
      list_two: `ब्लॉक सब्सिडी`,
      paragraph_four: `तुम और तुम्हारे माइनर दोस्तों ने कुल 7.41 बिटकॉइन कमाए हैं और इसे बाँटने का अच्छा तरीका ढूँढ रहे हो। इसे इस आधार पर बाँटा जाना चाहिए कि हर किसी ने कितना काम किया।`,
      paragraph_five: `माइनिंग पूल इसे इस तरह हल करते हैं कि वे यह ट्रैक करते हैं कि हर माइनर ने कितने आंशिक समाधान (partial solutions) बनाए हैं। एक पूल हर माइनर को उसकी हैश पावर के आधार पर एक न्यूनतम कठिनाई (ब्लॉक कठिनाई से कम) असाइन करता है। हर कुछ सेकंड में एक माइनर इन आसान समाधानों में से एक ढूँढ लेता है और पूल को सूचित करता है। फिर पूल सभी सबमिट किए गए शेयरों को ट्रैक करता है और उसी के अनुसार ब्लॉक रिवॉर्ड बाँटता है।`,
      paragraph_six: `चलो इसे काम करते हुए देखते हैं।`,
    },

    split_two: {
      title: `रिवॉर्ड बाँटना`,
      nav_title: `रिवॉर्ड की गणना`,
      step_zero_heading: `सबके प्रयासों की समीक्षा करें`,
      step_zero_paragraph: `हम लड़ाई को फिर से चलाएँगे। इस बार हम सिर्फ अपने पूल पर ध्यान देंगे, खासकर इस पर कि हर माइनर ने कितने आंशिक समाधान पाए।`,
      step_two_heading: `चलो गणित करें`,
      step_two_paragraph: `ऊपर दिए गए आँकड़ों को देखो और सोचो कि रिवॉर्ड को बाँटने का एक निष्पक्ष तरीका क्या हो सकता है। समझ गए? चलो इसे चरण दर चरण देखते हैं।`,
      step_three_heading: `हैशरेट प्रतिशत`,
      step_three_paragraph: `जैसा कि तुम जानते हो, यह दर्शाता है कि हर माइनर ने ब्लॉक्स खोजने में कितना काम किया है। लेकिन माइनिंग पूल के पास इस संख्या को जानने या मापने का कोई तरीका नहीं होता, क्योंकि माइनर्स सिर्फ सफल समाधान ही भेजते हैं।`,
      step_four_heading: `ब्लॉक मिलने का प्रतिशत`,
      step_four_paragraph: `ब्लॉक मिलने की संभावना बहुत कम होती है क्योंकि इसमें किस्मत का बड़ा हाथ होता है। खासकर ऐसे परिदृश्यों में जहाँ कुछ बेहद शक्तिशाली माइनर्स हों, बहुत छोटे माइनर्स काम तो कर सकते हैं लेकिन कभी भी कोई ब्लॉक न पाएँ।`,
      step_five_heading: `आंशिक समाधान प्रतिशत`,
      step_five_paragraph: `अब यह संख्या काम आती है। माइनर्स इन आसान समस्याओं के समाधान नियमित रूप से पूल को रिपोर्ट करते हैं। इससे पूल को यह काफ़ी सटीक रूप से मापने में मदद मिलती है कि हर माइनर ने कितना काम किया है।`,
      step_six_heading: `रिवॉर्ड बाँटना`,
      step_six_paragraph: `अब हम 7.41 बिटकॉइन के रिवॉर्ड को हर पूल के आंशिक समाधानों के प्रतिशत के अनुसार बाँट सकते हैं। बधाई हो!`,
    },

    outro_one: {
      title: `आउट्रो`,
      nav_title: `अध्याय पूरा`,
      heading: `ये लो, वैंडरपूल!`,
      paragraph_one: `शानदार काम! तुम और बाकी माइनर्स ने अपने संसाधनों को एकजुट करके वैंडरपूल के 51% अटैक को रोक दिया। अब खाली ब्लॉक्स सबमिट नहीं हो रहे हैं और लगता है उसने हार मान ली है।`,
      paragraph_two: `अब अपने इनाम लेने का समय है! अपने बिटकॉइन निकालने के लिए अगले अध्याय में जाओ।`,
    },
    resources: {
      solo: {
        hashrate_heading: `माइनिंग हैशरेट`,
        hashrate_paragraph: `किसी व्यक्तिगत माइनर की हैशरेट उस कम्प्यूटेशनल शक्ति को दर्शाती है जो वह बिटकॉइन नेटवर्क की माइनिंग प्रक्रिया में योगदान देता है। यह वह दर है जिस पर उसका माइनिंग हार्डवेयर नए ब्लॉक्स माइन करने के लिए ज़रूरी गणितीय गणनाएँ कर सकता है। किसी व्यक्तिगत माइनर की हैशरेट आमतौर पर हैश प्रति सेकंड में मापी जाती है, या बड़े पैमाने पर टेराहैश में, यानी प्रति सेकंड एक ट्रिलियन हैश (TH/s), जो उसके माइनिंग ऑपरेशन के पैमाने और हार्डवेयर की क्षमताओं पर निर्भर करता है।`,
      },
      pool: {
        pool_heading: `माइनिंग पूल`,
        pool_paragraph: `क्रिप्टोकरेंसी माइनिंग में माइनिंग पूल एक महत्वपूर्ण भूमिका निभाता है और व्यक्तिगत माइनर्स को कई प्रमुख लाभ प्रदान करता है। कई प्रतिभागियों की कम्प्यूटेशनल शक्ति और संसाधनों को एक साथ जोड़कर, माइनिंग पूल नए ब्लॉक्स को सफलतापूर्वक माइन करने की संभावना बढ़ाते हैं, जिससे कमाई ज़्यादा अनुमानित और स्थिर होती है। ये माइनर्स को उन्नत माइनिंग उपकरण और विशेषज्ञ सहायता तक पहुँच भी प्रदान करते हैं, जिससे प्रवेश की बाधाएँ कम होती हैं और मैदान बराबर होता है। इसके अलावा, माइनिंग पूल रिवॉर्ड को कुशलता से वितरित करने में मदद करते हैं, यह सुनिश्चित करते हुए कि माइनर्स को उनके योगदान के लिए उनका उचित हिस्सा मिले, जिससे क्रिप्टोकरेंसी माइनिंग एक व्यापक समुदाय के लिए सुलभ, स्थिर और आर्थिक रूप से लाभदायक बनती है।`,
      },
      coop: {
        distribution_heading: `कार्य वितरण`,
        distribution_paragraph: `माइनिंग पूल यह सुनिश्चित करने के लिए सावधानियाँ बरतते हैं कि उनके प्रतिभागी एक ही ब्लॉक के लिए एक ही नॉन्स माइन न करें। यह महत्वपूर्ण है क्योंकि बिटकॉइन माइनिंग प्रक्रिया में, माइनर्स एक वैध ब्लॉक देने वाले नॉन्स को खोजने के लिए प्रतिस्पर्धा करते हैं। अगर एक ही पूल के दो माइनर्स एक ही समय पर एक ही नॉन्स पर काम करें, तो यह अक्षम होगा और केवल एक को ही ब्लॉक रिवॉर्ड मिलेगा। इसे रोकने के लिए, माइनिंग पूल 'वर्क असाइनमेंट' या 'जॉब डिस्ट्रीब्यूशन' नामक प्रक्रिया का उपयोग करते हैं ताकि काम को कुशलता से बाँटा जा सके। माइनिंग पूल व्यक्तिगत माइनर्स या प्रतिभागियों को काम वितरित करते हैं। जब किसी नए ब्लॉक को माइन करने की आवश्यकता होती है, तो पूल का सर्वर (या पूल ऑपरेटर) माइनर्स के लिए एक यूनिक 'जॉब' बनाता है। इस जॉब में ब्लॉक माइन करने के लिए ज़रूरी सारी जानकारी होती है, जैसे अपुष्ट ट्रांज़ैक्शनों की मौजूदा सूची, पिछले ब्लॉक का हेडर, और लक्षित कठिनाई।`,
        shares_heading: `शेयर सबमिट करना`,
        shares_paragraph: `माइनर्स इन असाइन किए गए जॉब्स पर काम करते हैं और लगातार सही नॉन्स खोजने की कोशिश करते हैं। जब किसी माइनर को लगता है कि उसे समाधान मिल गया है, तो वह पूल सर्वर को 'शेयर' नाम की चीज़ सबमिट करता है। यह शेयर यह दर्शाता है कि माइनर सक्रिय रूप से समस्या को हल करने पर काम कर रहा है। शेयर वास्तविक समाधान की तुलना में बहुत आसानी से मिल जाते हैं, लेकिन वे माइनर के प्रयासों के प्रमाण के रूप में काम करते हैं।`,
      },
      split: {
        payout_heading: `पेआउट योजनाएँ`,
        payout_subheading: `एक माइनिंग पूल ब्लॉक रिवॉर्ड को कई तरीकों से वितरित कर सकता है, जिनमें कुछ सूक्ष्म लेकिन महत्वपूर्ण अंतर होते हैं:`,
        pps_heading: `पे-पर-शेयर (PPS)`,
        pps_paragraph: `PPS में, माइनर्स को हर वैध शेयर के लिए एक निश्चित भुगतान मिलता है, भले ही पूल सफलतापूर्वक ब्लॉक माइन करे या नहीं। यह सिस्टम माइनर्स को स्थिर और अनुमानित आय प्रदान करता है, जिससे यह उन लोगों के लिए पसंदीदा विकल्प बन जाता है जो अपनी कमाई में निरंतरता को महत्व देते हैं। PPS रिवॉर्ड में उतार-चढ़ाव को कम करता है, क्योंकि माइनर्स को प्रति-शेयर आधार पर भुगतान किया जाता है, जिससे अस्थिर क्रिप्टोकरेंसी माइनिंग की दुनिया में आय का एक भरोसेमंद स्रोत मिलता है। हालाँकि, अगर पूल सफलतापूर्वक ब्लॉक माइन नहीं करता है, तो PPS माइनर की कमाई से एक शुल्क काट सकता है। यह शुल्क संचालन लागत को कवर करने और उस स्थिति में पूल ऑपरेटर के जोखिम को कम करने के लिए होता है जब एक निश्चित समयावधि में कोई ब्लॉक माइन न हो। पारंपरिक PPS में, जब पूल को कठिनाइयों का सामना करना पड़ता है, तो माइनर्स को कम भुगतान मिलता है।`,
        pplns_heading: `पे-पर-लास्ट-N-शेयर (PPLNS)`,
        pplns_paragraph: `PPLNS पिछले N शेयरों की एक निश्चित विंडो में माइनर के योगदान को ध्यान में रखता है। माइनर्स को उस विंडो के भीतर उनके द्वारा सबमिट किए गए शेयरों की संख्या और कठिनाई के आधार पर भुगतान किया जाता है। PPLNS माइनर्स को पूल में सक्रिय रहने के लिए प्रोत्साहित करता है, क्योंकि यह निरंतर भागीदारी को पुरस्कृत करता है और पूल-हॉपिंग रणनीतियों के जोखिम को कम करने में मदद करता है। जब पूल सफलतापूर्वक ब्लॉक माइन करता है, तो माइनर्स को भुगतान मिलता है, और रिवॉर्ड उनके हालिया योगदान के अनुपात में वितरित किए जाते हैं, जिससे माइनिंग इकोसिस्टम में कमाई का एक निष्पक्ष और प्रदर्शन-आधारित तरीका मिलता है।`,
        pps_plus_heading: `पे-पर-शेयर + (PPS+)`,
        pps_plus_paragraph: `PPS+ माइनर्स को पूल की माइनिंग कोशिशों में उनके द्वारा दिए गए हर शेयर के लिए एक निश्चित भुगतान प्रदान करता है। हालाँकि, PPS+ में आमतौर पर पूल की स्थिरता और विश्वसनीयता में योगदान देने वाले माइनर्स के लिए एक अतिरिक्त बोनस या प्रीमियम शामिल होता है। यह बोनस माइनर्स को पूल में सक्रिय रहने और दीर्घकालिक भागीदारी को बढ़ावा देने के लिए बनाया गया है। PPS+ माइनर्स को स्थिर और अनुमानित आय देता है, जबकि अतिरिक्त बोनस इसे उन लोगों के लिए आकर्षक विकल्प बनाता है जो क्रिप्टोकरेंसी माइनिंग की दुनिया में विश्वसनीयता के साथ-साथ अतिरिक्त रिवॉर्ड भी चाहते हैं।`,
        fpps_heading: `फुल पे-पर-शेयर (FPPS)`,
        fpps_paragraph: `फुल PPS में, माइनर्स को पूल में सबमिट किए गए हर शेयर के लिए एक निश्चित भुगतान मिलता है, चाहे पूल सफलतापूर्वक ब्लॉक माइन करे या नहीं। यह तरीका माइनर्स को स्थिर और अनुमानित आय प्रदान करता है, जिससे यह उन लोगों के लिए आकर्षक बन जाता है जो अपनी कमाई में विश्वसनीयता चाहते हैं। पारंपरिक PPS के विपरीत, फुल PPS यह सुनिश्चित करता है कि माइनर्स को उनके योगदान किए गए काम के लिए पूरा भुगतान मिले, बिना किसी संभावित कटौती के, भले ही पूल को कभी-कभार कठिनाइयों का सामना करना पड़े। यह एक स्थिर और सरल तरीका है जो क्रिप्टोकरेंसी माइनिंग की दुनिया में निरंतर आय चाहने वाले माइनर्स को पसंद आता है।`,
      },
    },
  },
  chapter_four: {
    title: 'अपने 1.61 बिटकॉइन का दावा करना',
    paragraph_one:
      'अरे, वह सटीक था! आप अब भी बिटरे के खिलाफ लड़ाई से कांप रहे हैं, लेकिन आप और आपके दोस्त जीत गए हैं',
    paragraph_two:
      'जैसे ही आप अपने डेस्क पर बैठते हैं, आप गहरी सांस लेते हैं और दिन के घटनाओं का फिर से सोचकर खो जाते हैं। आपके हाथ खुद को रहते हैं, रहस्यमय प्रेषक के साथ खेलते हुए, जैसे ही आप सोचते हैं कि किसने इसे भेजा',

    intro_one: {
      title: 'बैग की सुरक्षा करना',
      paragraph_one:
        'HOLOCAT: "हममें से किसी को बेहतर आराम करना चाहिए। आपको घर जाने की और माइनिंग पूल्स से संपर्क करने की आवश्यकता है। दुनिया से उन्हें इसके बारे में जानने की इच्छा होगी।"',
      paragraph_two:
        'जैसे ही आप अपने TMY92-P होवर डेस्क पर बैठते हैं, आप दिन की घटनाओं को फिर से याद करते हैं। वैंडरपूल, बिटरे। उन्होंने कभी भी प्रदर्शन के लिए बंद होने की सहमति नहीं दी का खुलासा। क्या यह सब सच हो सकता है? क्या यह सब एक षडयंत्र था? और आपको इस बिल्ली का ख्याल कितने समय तक रखना चाहिए?',
      paragraph_three:
        'चाहे आगे कुछ भी हो, आपको शायद कुछ फंड की आवश्यकता होगी। आप समझते हैं कि आपने बिटरे के साथ आपके प्रतिस्पर्धी माइनिंग अवार्ड्स का दावा कभी नहीं किया। आप निकालने का निर्णय लेते हैं ताकि आपकी घर वापसी के लिए मदद कर सकें।',
    },

    public_key_one: {
      title: 'सार्वजनिक कुंजी',
      heading: 'कुंजी जोड़ी के बारे में',
      paragraph_one:
        'माइनिंग पूल के अनुसार, ऐसा दिखता है कि आपके पहले किए गए सभी काम से 1.61 बिटकॉइन का दावा करना होगा।',
      list_one: 'निजी कुंजी',
      list_two: 'सार्वजनिक कुंजी',
      paragraph_two:
        'लेकिन रुकिए, आपके पास तो वॉलेट भी नहीं है! आप यह सोच रहे होंगे कि आप कहाँ से एक वॉलेट खरीद सकते हैं। जबकि आप कुछ प्रकार की वॉलेट बनाने के लिए हार्डवेयर खरीद सकते हैं, आप वास्तव में अपने कंप्यूटर या मोबाइल डिवाइस के साथ एक बना सकते हैं। चलो, करते हैं!',
      paragraph_three:
        'यदि आपने किसी भी समय खाता बनाया है, तो आपको कुछ जिसे व्यक्तिगत कोड कहा जाता है मिलता है। जिसे गुप्तशास्त्र में "निजी कुंजी" कहा जाता है और यह अक्सर जोड़ का हिस्सा होता है',
      paragraph_four:
        'एक ही कुंजी जोड़ी का ही काफी है ताकि एक वॉलेट बनाई जा सके और उसके भीतर के फंड को नियंत्रित किया जा सके। जब आप बिटकॉइन खरीदना चाहते हैं, तो आप निजी कुंजी का उपयोग करते हैं। जब आप बिटकॉइन प्राप्त करना चाहते हैं, तो आप सार्वजनिक कुंजी का उपयोग करते हैं।"',
    },

    public_key_two: {
      title: 'सार्वजनिक कुंजी',
      paragraph_one:
        'इसलिए, हमारे पास निजी कुंजी है, यह व्यक्तिगत कोड है जिसे आपने साइन अप करते समय प्राप्त किया था। इससे हम कैसे एक सार्वजनिक कुंजी उत्पन्न कर सकते हैं?',
      paragraph_two:
        'इसके लिए, हमें एक रोचक क्रिप्टोग्राफी की एक शाखा पर नजर डालने की आवश्यकता है, जिसे अंडाकृति वृत्त क्रिप्टोग्राफी कहा जाता है। इसे लघु रूप में एलिप्टिक कर्व क्रिप्टोग्राफी या ECC कहा जाता है.',
      paragraph_three:
        'ECC में एक अंडाकृति वृत्त पर निश्चित बिंदुओं को लेना और उन बिंदुओं पर जोड़ने और गुणा करने का शामिल होता है।',
      paragraph_four:
        'बिटकॉइन एक विशिष्ट वृत्त का उपयोग करता है, जिसे secp256k1 कहा जाता है। दाईं ओर, आप एक सरल संस्करण देख रहे हैं जो आसानी से प्रतिमानित होता है, लेकिन समान गणित नियमों का पालन करता है।',
      paragraph_five:
        'हम इस वृत्त पर एक विशिष्ट बिंदु के साथ आरंभ करते हैं, जिसे जेनरेटर पॉइंट कहा जाता है।',
    },

    public_key_three: {
      title: 'सार्वजनिक कुंजी',
      paragraph_one:
        'निजी कुंजी से सार्वजनिक कुंजी निकालने के लिए, हम जेनरेटर पॉइंट के साथ एक अंडाकृति कर्व क्रिप्टोग्राफी क्रिया को बार-बार प्रायोग करते हैं (' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=Why%2520is%2520the%2520generator%2520point%2520repeatedly%2520used%2520to%2520derive%2520a%2520public%2520key%2520from%2520a%2520private%2520key%2520in%2520secp256k1%253F" ' +
        'target="_blank" rel="noopener noreferrer" class="underline">' +
        'जानिए क्यों' +
        '</a>' +
        '). जेनरेटर पॉइंट वृत्त पर एक विशिष्ट बिंदु होता है। इसका मूल्य secp256k1 मानक का हिस्सा है और यह हमेशा समान होता है:',
      paragraph_two:
        'अंडाकृति कर्व क्रिप्टोग्राफी क्रिया जोड़ने के तरह होती है और इसलिए इसका दोहराव गुणा करने के तरह होता है। हम एल्गोरिथम को वर्णन करने के लिए * प्रतीक का उपयोग करते हैं (' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=How%2520does%2520elliptic%2520curve%2520scalar%2520multiplication%2520work%253F" ' +
        'target="_blank" rel="noopener noreferrer" class="underline">' +
        'और जानें' +
        '</a>' +
        '), जहाँ k निजी कुंजी है और P संबंधित सार्वजनिक कुंजी है:',
      paragraph_three:
        'फ़ंक्शन privatekey_to_publickey() को पूरा करें ताकि यह एक दिए गए निजी कुंजी से प्राप्त सार्वजनिक कुंजी दे',
    },

    public_key_four: {
      title: `सार्वजनिक कुंजी`,
      nav_title: `सार्वजनिक कुंजी को कंप्रेस करें`,
      paragraph_one: `सार्वजनिक कुंजी में x और y कोऑर्डिनेट होते हैं, कुल 64 बाइट्स। इसे y कोऑर्डिनेट हटाकर और एक सिंगल बाइट मेटाडेटा को आगे जोड़कर 33 बाइट्स में कंप्रेस किया जा सकता है। यह बाइट बताएगी कि Y कोऑर्डिनेट सम (even) है या विषम (odd)। क्योंकि एलिप्टिक कर्व समीकरण में केवल दो वेरिएबल होते हैं, पूरी सार्वजनिक कुंजी बाद में केवल x और मेटाडेटा का उपयोग करके वेरिफ़ायर द्वारा दोबारा कैलकुलेट की जा सकती है:`,
      paragraph_two_javascript: `मेटाडेटा बाइट '2' होनी चाहिए अगर y सम (even) है और '3' अगर y विषम (odd) है। फ़ंक्शन <span className="text-green">compressPublicKey()</span> को पूरा करें ताकि वह एक सार्वजनिक कुंजी स्वीकार करे और कंप्रेस्ड सार्वजनिक कुंजी को दर्शाने वाली 33 बाइट की hex स्ट्रिंग लौटाए।`,
      paragraph_two_python: `मेटाडेटा बाइट '2' होनी चाहिए अगर y सम (even) है और '3' अगर y विषम (odd) है। फ़ंक्शन <span className="text-green">compress_publickey()</span> को पूरा करें ताकि वह एक सार्वजनिक कुंजी स्वीकार करे और कंप्रेस्ड सार्वजनिक कुंजी को दर्शाने वाली 33 बाइट की hex स्ट्रिंग लौटाए।`,
      success: `बहुत बढ़िया। अब हमारे पास कंप्रेस्ड सार्वजनिक कुंजी है। अगला कदम है इसे हैश करना और इसे मानव-अनुकूल फ़ॉर्मैट में एन्कोड करना।`,
    },

    public_key_five: {
      title: 'सार्वजनिक कुंजी',
      heading: 'अच्छा काम!',
      paragraph_one:
        'और यह रहा! आपका संक्षिप्त सार्वजनिक कुंजी! इसके साथ हम कई दिलचस्प चीजें कर सकते हैं, इसमें हमारे वॉलेट के लिए पतों का निर्माण शामिल है। हम अगले चैलेंज में इसके बारे में सीखेंगे।',
      paragraph_two:
        'ध्यान दें कि सार्वजनिक कुंजी उत्पन्न करना एकमार्ग है। आप एक सार्वजनिक कुंजी उत्पन्न करने के लिए उपयोग किए गए निजी कुंजी को समझ नहीं सकते, जब तक आप एक विख्यात कठिन गणित समस्या जिसे विभिन्न लॉग समस्या कहा जाता है, को हल नहीं करते।',
    },

    address_one: {
      title: `पता`,
      nav_title: `एकतरफ़ा रास्ता`,
      heading: `अच्छा काम!`,
      paragraph_one: `और बस यही है! आपकी कंप्रेस्ड सार्वजनिक कुंजी! इसके साथ हम कई दिलचस्प चीज़ें कर सकते हैं, जिनमें हमारे वॉलेट के लिए पते जनरेट करना भी शामिल है। इसके बारे में हम अगले चैलेंज में सीखेंगे।`,
      paragraph_two: `ध्यान दें कि सार्वजनिक कुंजी जनरेट करना एक एकतरफ़ा रास्ता है। आप उस प्राइवेट की का पता नहीं लगा सकते जिसका उपयोग सार्वजनिक कुंजी बनाने में किया गया था, जब तक कि आप एक बेहद कठिन गणितीय समस्या हल न कर लें, जिसे कहा जाता है `,
      tooltip_one: {
        question: `डिस्क्रीट लॉग समस्या बिटकॉइन से कैसे संबंधित है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=how%2520is%2520the%2520discrete%2520log%2520problem%2520relevant%2520to%2520bitcoin%253F`,
        highlighted: `डिस्क्रीट लॉग समस्या `,
      },
    },

    address_two: {
      title: `पता`,
      nav_title: `कंप्रेस्ड सार्वजनिक कुंजी को हैश करें`,
      paragraph_one: `क्या तुम्हें हैशिंग चैलेंज याद है? पता चला कि तुम अपनी कंप्रेस्ड सार्वजनिक कुंजी को हैश करके बिटकॉइन पते का सबसे सरल प्रकार बना सकते हो। इसके लिए बिटकॉइन दो अलग-अलग हैशिंग एल्गोरिदम का उपयोग करता है: SHA-256 और RIPEMD-160।`,
      paragraph_two: `स्टेप्स:`,
      paragraph_three: `<span className="indent-48">1. अपनी कंप्रेस्ड सार्वजनिक कुंजी पर SHA-256 हैश करें।</span>`,
      paragraph_four: `<span className="indent-48">2. उस SHA-256 आउटपुट डाइजेस्ट पर RIPEMD-160 हैश करें। अंतिम परिणाम 20 बाइट्स होगा, जिसे hex स्ट्रिंग के रूप में एन्कोड किया जाएगा।</span>`,
      paragraph_five: `एक ऐसा फ़ंक्शन पूरा करें जो 33-बाइट की कंप्रेस्ड सार्वजनिक कुंजी को hex स्ट्रिंग के रूप में स्वीकार करे और 20-बाइट की सार्वजनिक कुंजी हैश को hex स्ट्रिंग के रूप में लौटाए।`,
      paragraph_six:
        `यहाँ उन हैशिंग लाइब्रेरीज़ का डॉक्यूमेंटेशन है जिन्हें हमने तुम्हारे लिए इम्पोर्ट किया है:\n` +
        '<Link href="https://nodejs.org/api/crypto.html#class-hash" target="_blank" className="underline">JavaScript: crypto</Link>\n' +
        '<Link href="https://docs.python.org/3/library/hashlib.html#usage" target="_blank" className="underline">Python: hashlib</Link>',
      success: `बहुत बढ़िया। बस एक और स्टेप, और तुम्हारे पास तुम्हारा वॉलेट पता होगा।`,
    },
    address_three: {
      title: `पता`,
      nav_title: `P2WPKH पता प्राप्त करें`,
      paragraph_one: `बिटकॉइन पतों के कई प्रकार होते हैं। पिछले अभ्यास में, हमने 20-बाइट की कंप्रेस्ड सार्वजनिक कुंजी हैश बनाई थी। अब, हम उस हैश को टेस्टनेट नेटवर्क पर Pay-to-Witness-Public-Key-Hash (p2wpkh) पते में एन्कोड करना चाहते हैं।`,
      paragraph_two: `सबसे पहले हमें हैश के आगे '0' का एक विटनेस वर्ज़न नंबर जोड़ना होता है। इस तरह बनने वाले 21 बाइट्स को <span className="font-bold">विटनेस प्रोग्राम</span> कहा जाता है।`,
      paragraph_three: `इसके बाद, विटनेस प्रोग्राम को एक मानव-अनुकूल फ़ॉर्मैट में एन्कोड किया जाता है जिसे <Link href="https://github.com/bitcoin/bips/blob/master/bip-0173.mediawiki#user-content-Specification" target="_blank" className="underline">bech32</Link> कहा जाता है। ऐसा करने से डेटा में एक ह्यूमन-रीडेबल प्रीफ़िक्स और एक चेकसम जुड़ जाता है।`,
      paragraph_four: `प्रीफ़िक्स नेटवर्क द्वारा निर्धारित होता है:`,
      table_heading: {
        item_one: `नेटवर्क`,
        item_two: `ह्यूमन-रीडेबल प्रीफ़िक्स`,
      },
      table_rows: {
        key_one: `मेननेट`,
        value_one: `bc`,
        key_two: `टेस्टनेट`,
        value_two: `tb`,
        key_three: `रेगटेस्ट`,
        value_three: `bcrt`,
      },
      paragraph_five: `क्योंकि हम एक टेस्टनेट पता बना रहे हैं, इसलिए हम 'tb' प्रीफ़िक्स का उपयोग करेंगे।`,
      paragraph_six: `डेटा को bech32 में एन्कोड करने के बाद, हमारे पास एक बिटकॉइन पता रह जाता है!`,
      paragraph_seven: `कंप्रेस्ड सार्वजनिक कुंजी हैश से एक bech32 पता बनाने के लिए फ़ंक्शन पूरा करें। पहले विटनेस प्रोग्राम बनाएँ, फिर पहले से इम्पोर्ट की गई bech32 लाइब्रेरी का उपयोग करके उस प्रोग्राम को पते में बदलें।`,
      paragraph_eight: `सही फ़ंक्शन्स ढूँढने के लिए आपको bech32 लाइब्रेरी में जाकर कोड पढ़ना पड़ सकता है:\n`,
      paragraph_eight_javascript: `<Link href="https://github.com/saving-satoshi/bech32js/blob/main/bech32.js" target="_blank" className="underline">JavaScript: @savingsatoshi/bech32js</Link>\n`,
      paragraph_eight_python: `<Link href="https://github.com/saving-satoshi/bech32py/blob/main/bech32py/bech32.py" target="_blank" className="underline">Python: savingsatoshi_bech32py</Link>`,
      success: `अब तुम्हारे पास एक ऐसा पता है जिस पर माइन किया गया बिटकॉइन भेजा जा सकता है।`,
    },
    tabconf_clue_one: {
      title: `वर्ष 2025`,
      nav_title: `Tabconf वर्ष 2025`,
      paragraph_one: `छोड़े गए वेयरहाउस के भीतर गहराई में, तुम्हारा स्कैनर एक अजीब सिग्नल पकड़ता है। यह इस दुनिया का एक टूटा हुआ हिस्सा है, एक खंडित कोड जो एक अजीब क्वांटम सिग्नेचर उत्सर्जित कर रहा है। तुम इसे डिकोड करते हो, और किसी संदेश की बजाय एक बग रिपोर्ट प्राप्त होती है – एक तात्कालिक निमंत्रण।`,
      paragraph_two: `होलोकैट प्रकट होता है, आँखें फैली हुई। "यही है, वह 'ग्लिच'। यह बग… जानबूझकर किया हुआ लगता है। जैसे क्वांटम इंटरफ़ेरेंस।"`,
      paragraph_three: `होलोकैट निर्देश देता है, "टूटी हुई स्क्रिप्ट को ठीक करो। सोच रहा हूँ क्या इसका कोई संबंध <a target="_blank" href="https://7.tabconf.com/">TABConf</a> से है, उस कॉन्फ़्रेंस से जहाँ Capture The Bitcoin खेला जाता है।"`,
      paragraph_four: `"हैश कॉपी करो..." होलोकैट ने ज़ोर देते हुए कहा, "यही हमारी कुंजी है।"`,
    },
    outro_one: {
      title: 'समापन',
      heading: 'सफलता!',
      paragraph_one: 'आपने अपना खुद का बिटकॉइन वॉलेट बनाया है!',
      paragraph_two:
        'आप बिटकॉइन को खुद ही बनाए गए वॉलेट में से निकालते हैं। अब आप पूरी तरह से वित्तपोषित हैं और अगले जो भी वैंडरपूल और बिटरेइ आपके सामने फेंक सकते हैं, उसके लिए तैयार हैं।',
    },
    resources: {
      public_key_three: {
        generator_point_heading: `जनरेटर पॉइंट`,
        generator_point_paragraph: `secp256k1 कर्व पर एक विशिष्ट बिंदु। इसका मान secp256k1 स्टैंडर्ड का हिस्सा है और यह हमेशा एक-सा रहता है। यह बिंदु कर्व के अन्य बिंदुओं से अलग नहीं है, लेकिन गणनाओं के लिए इसे मानक शुरुआती बिंदु के रूप में स्वीकार किया गया है। वास्तव में कोई नहीं जानता कि इसी विशेष बिंदु को क्यों चुना गया।`,
        elliptic_curve_operations_heading: `एलिप्टिक कर्व ऑपरेशन्स`,
        elliptic_curve_operations_paragraph: `एलिप्टिक कर्व के अपने गणितीय नियम होते हैं, इसलिए जोड़ और गुणा जैसे सरल ऑपरेशन्स भी अलग तरीके से काम करते हैं। सरलता और संक्षिप्तता के लिए, पहले से प्रचलित प्रतीकों का पुनः उपयोग किया जाता है, जैसे गुणा से मिलते-जुलते ऑपरेशन के लिए “*” का उपयोग।`,
        discrete_log_heading: `डिस्क्रीट लॉगरिदम`,
        discrete_log_paragraph: `एक गणितीय प्रणाली जहाँ आप, उदाहरण के लिए, गुणा तो कर सकते हैं लेकिन भाग नहीं। इसका एक सरल रूपक घड़ी को देखना है। 11 बजे के 3 घंटे बाद 2 बजते हैं। तो हम कह सकते हैं “11+3=2”。लेकिन अगर हम “2-x=11” करना चाहें और x निकालें, तो अनंत संभावित उत्तर मिलेंगे (3, 15, 27, 39...)। और जानकारी के लिए <Link href="https://en.wikipedia.org/wiki/Discrete_logarithm" className="underline">विकिपीडिया</Link> देखें।`,
        tip_one: `एलिप्टिक कर्व पॉइंट्स के साथ गुणा करना उस तरह का गुणा नहीं है जिसकी आपको सामान्य संख्याओं के साथ आदत है। तो फिर गुणा कैसे किया जाता है? ध्यान दें कि जनरेटर पॉइंट <span className="p-1 font-mono bg-[#0000004D] m-1">G</span> का प्रकार <span className="p-1 font-mono bg-[#0000004D] m-1">secp256k1.GE</span> है। उस क्लास को देखें ताकि यह समझ सकें कि उस पर कौन-कौन से मेथड्स कॉल किए जा सकते हैं।`,
        tip_two: `हालाँकि प्राइवेट की को hex फ़ॉर्मैट में स्वीकार किया जाता है, लेकिन जनरेटर पॉइंट के साथ गुणा करने से पहले इसे एक संख्या (अगर आप JS इस्तेमाल कर रहे हैं तो BigInt) में बदलना आवश्यक है।`,
      },
      public_key_four: {
        y_coordinate_compression_heading: `सार्वजनिक कुंजी संपीड़न`,
        y_coordinate_compression_paragraph: `जब आप एलिप्टिक कर्व पर पॉइंट ऐडिशन की गणना करते हैं, तो दो बिंदुओं के कोऑर्डिनेट्स का उपयोग करके तीसरे बिंदु के कोऑर्डिनेट्स निकाले जाते हैं जो कर्व पर स्थित होता है। हालाँकि, किसी दिए गए x-कोऑर्डिनेट के लिए आम तौर पर दो संभावित y-कोऑर्डिनेट होते हैं (कुछ विशेष मामलों को छोड़कर)। सार्वजनिक कुंजी को कंप्रेस करते समय, आप इन y-कोऑर्डिनेट्स में से एक चुनते हैं और केवल x-कोऑर्डिनेट के साथ यह संकेत शामिल करते हैं कि कौन-सा y-कोऑर्डिनेट उपयोग करना है। इस स्थिति में हम जो मेटाडेटा जोड़ते हैं, वही y-कोऑर्डिनेट को इंगित करता है।`,
        tip: `यह चैलेंज वास्तव में काफ़ी सरल है। हमें केवल यह निर्धारित करना होता है कि y-कोऑर्डिनेट सम (even) है या विषम (odd), ताकि उसी के अनुसार मेटाडेटा को हमारी सार्वजनिक कुंजी के आगे जोड़ा जा सके।`,
      },
      address_two: {
        hash_algo_heading: `SHA-256, RIPEMD-160`,
        hash_algo_paragraph: `हैश फ़ंक्शन्स किसी भी मात्रा और किसी भी प्रकार के डेटा को इनपुट के रूप में लेते हैं और हमेशा एक निश्चित आकार का आउटपुट देते हैं। SHA-256 के लिए यह 32 बाइट्स होता है। RIPEMD-160 के लिए यह 20 बाइट्स होता है। आउटपुट डिटरमिनिस्टिक होता है (एक ही इनपुट के लिए हमेशा वही आउटपुट), लेकिन इसके अलावा यह रैंडम से अलग पहचान में नहीं आता। हैश फ़ंक्शन्स डेटा को प्रभावी रूप से एक छोटे और सुसंगत फ़िंगरप्रिंट में बदल देते हैं।`,
        tip_one: `SHA-256 हैश की गणना करते समय यह सुनिश्चित करें कि आप अपनी कंप्रेस्ड कुंजी को bytes के रूप में हैश कर रहे हैं, न कि hex के रूप में। अगर आप JavaScript का उपयोग कर रहे हैं, तो इसके लिए hex स्ट्रिंग को buffer में बदलना होगा।`,
        tip_two: `सुनिश्चित करें कि आप हैशिंग एल्गोरिदम सही क्रम में लागू कर रहे हैं।`,
      },
      address_three: {
        wpkh_heading: `विटनेस पब्लिक की हैश (wpkh) पता`,
        wpkh_paragraph: `बिटकॉइन पता अक्षरों की एक स्ट्रिंग होता है जिसे उपयोगकर्ताओं के लिए संभालना आसान बनाया गया है। यह छोटा होता है, कॉपी-पेस्ट करना आसान होता है, और इसमें किसी न किसी प्रकार का बिल्ट-इन चेकसम होता है ताकि यह सुनिश्चित किया जा सके कि इसे हमेशा सही तरीके से कॉपी किया गया है। यह सुरक्षित रूप से एक बिटकॉइन आउटपुट स्क्रिप्ट को एन्कोड करता है, जिससे प्राप्तकर्ता खर्च कर सकता है। आउटपुट स्क्रिप्ट्स के कई प्रकार और एन्कोडिंग के कई तरीके होते हैं। इस चैलेंज में हम एक कंप्रेस्ड सार्वजनिक कुंजी को bech32 से एन्कोड करके जिसे विटनेस पब्लिक की हैश पता कहा जाता है, वह बनाते हैं।`,
        network_heading: `मेननेट, टेस्टनेट, सिगनेट और रेगटेस्ट`,
        network_paragraph: `बिटकॉइन सॉफ़्टवेयर विकसित करते समय, असली पैसे पर भरोसा करने से पहले अपने कोड का परीक्षण करना बहुत महत्वपूर्ण होता है। बिटकॉइन सॉफ़्टवेयर को टेस्ट करने का एक सरल तरीका है एक अलग ब्लॉकचेन का उपयोग करना, जिसमें नया जेनिसिस ब्लॉक हो, जहाँ कॉइन्स का कोई वास्तविक मूल्य न हो, माइनिंग मुफ़्त और आसान हो, और किसी भी समय सब कुछ रीसेट किया जा सके। ये चेन नोड्स के एक अलग नेटवर्क द्वारा सपोर्ट की जाती हैं, जो मेननेट पर मौजूद असली कॉइन्स और नोड्स में कोई हस्तक्षेप नहीं करता। टेस्टनेट और सिगनेट ऐसी ही दो वैकल्पिक बिटकॉइन ब्लॉकचेन के नाम हैं, जिन्हें वैश्विक स्तर पर मेननेट के साथ समानांतर रूप से बनाए रखा जाता है। रेगटेस्ट एक डेवलपर मोड है जिसे लोकली चलाने के लिए डिज़ाइन किया गया है और इसमें किसी भी नेटवर्क कनेक्शन की आवश्यकता नहीं होती।`,
        tip: `सुनिश्चित करें कि आप bech32 लाइब्रेरी को ध्यान से देखें ताकि यह पता चल सके कि आप कौन-से सटीक मेथड्स का उपयोग कर सकते हैं।`,
      },
    },
  },

  chapter_five: {
    title: `क्या असली सातोशी सामने आएंगे`,
    paragraph_one: `रात हो चुकी है, और तुम थके हुए हो, लेकिन जैसे ही तुम पल भर के लिए आँखें बंद करते हो, बुरी खबरों की दोहरी खुराक आ जाती है।`,
    paragraph_two: `1) वैंडरपूल फिर से टीवी पर है।`,
    paragraph_three: `2) वह दावा कर रहा है कि वह सातोशी नाकामोटो का परपोता है।`,
    paragraph_four: `वह नींद से वंचित दिख रहा है।`,
    intro_one: {
      title: `परिचय`,
      nav_title: `भरोसा मत करो, सत्यापित करो`,
      paragraph_one: `—डेबोरा चंक: “श्री वैंडरपूल। आपने हाल ही में एंटी-सोशल मीडिया पर यह चौंकाने वाला दावा किया है कि आप सातोशी नाकामोटो के परपोता हैं। क्या यह सही है? क्या यह सच है?”`,
      paragraph_two: `—वैंडरपूल: “बिल्कुल सही है, डेबोरा। मैंने यह रहस्य बहुत, बहुत लंबे समय तक छुपाकर रखा है। देखिए, मेरे परिवार ने पीढ़ियों से एक साधारण-सा दिखने वाला CD-ROM आगे बढ़ाया है। इसे गुप्त रखने के लिए हमने इसे <span className="italic">Creed – My Own Prison</span> नाम दिया। इसमें मेरे परदादा सातोशी नाकामोटो के विशाल बिटकॉइन भंडार की प्राइवेट कीज़ हैं। इसलिए जब मैं माइनर्स की ओर से बोलता हूँ, तो समझिए कि मैं सातोशी नाकामोटो की ओर से भी बोलता हूँ।”`,
      paragraph_three: `—डेबोरा चंक: “क्या कोई तरीका है जिससे हम यह सत्यापित कर सकें कि आप वास्तव में सातोशी नाकामोटो के बिटकॉइन की प्राइवेट कीज़ के मालिक हैं?”`,
      paragraph_four: `—वैंडरपूल: “बिल्कुल है। यह पब्लिक की क्रिप्टोग्राफी का एक सरल मामला है।”`,
      paragraph_five: `—डेबोरा चंक: “लेकिन इतनी देर तक इस धरती-हिला देने वाले खुलासे को करने का इंतज़ार क्यों किया?”`,
    },
    intro_two: {
      nav_title: `वैंडरपूल का साहसिक दावा`,
      paragraph_one: `—वैंडरपूल: “मुझमें हिम्मत नहीं थी। मेरे परिवार के इतिहास को लेकर हमेशा अफ़वाहें रही हैं, जिन्हें मैं आसानी से पुष्टि कर सकता था। लेकिन मैं इतनी ज़्यादा पब्लिसिटी के लिए तैयार नहीं था। आखिरकार, मैं अपने सभी निजी द्वीपों में से अपने पसंदीदा पर, एक 14वीं सदी के किले में, एक ड्यूड रैंच पर, एक सादा और एकांत जीवन जीता हूँ, और हर हफ्ते अपने हॉट टब से इस तरह के 5–6 इंटरव्यू देता हूँ।”`,
      paragraph_two: `—वैंडरपूल: “लेकिन अब जब बिटकॉइन का भविष्य दाँव पर है, तो मुझे लगा कि सच का सामना करने का समय आ गया है—खासतौर पर Creed के डेब्यू एल्बम, My Own Prison, के संगीत का।” *वैंडरपूल 20वीं सदी के उस एल्बम के नाम वाले गीत की धुन गुनगुनाता है*`,
      paragraph_three: `—वैंडरपूल: “मैं बस इतना ही कह सकता हूँ कि मुझे पहले सामने न आने का अफ़सोस है, क्योंकि उस CD-ROM में सातोशी नाकामोटो की बिटकॉइन के लिए संशोधित योजनाएँ भी हैं। देखिए, मेरे परदादा को हमेशा यह पछतावा रहा कि उन्होंने बिटकॉइन की आपूर्ति को 21 मिलियन कॉइनों तक सीमित कर दिया। इसी वजह से मैं अपने परदादा के सपने को पूरा करने के लिए स्थायी बिटकॉइन इश्यूअन्स के पक्ष में बिटकॉइन को हार्ड फोर्क करने की योजना बना रहा हूँ।”`,
    },
    intro_three: {
      nav_title: `सातोशी का संदेश`,
      paragraph_one: `तुम्हारी TXM4H-A होवर स्क्रीन जीवंत हो उठती है। तुम्हारे लिए एक नया संदेश है।`,
      paragraph_two: `—HOLOCAT: मेरी नाक को बोप करना मत भूलना।`,
      paragraph_three: `तुम उसकी नाक को बोप करते हो।`,
      paragraph_four: `—सातोशी नाकामोटो: “वैंडरपूल वह नहीं है जो वह होने का दावा करता है। तुम उसे बेनकाब कर सकते हो। उससे कहो कि वह उस वॉलेट की प्राइवेट कीज़ का उपयोग करके एक संदेश साइन करके सातोशी के बिटकॉइन के स्वामित्व का प्रमाण दे।”`,
    },
    derive_message_one: {
      title: `संदेश निकालें`,
      nav_title: `विवादित संदेश`,
      heading: `वैंडरपूल कहता है कि उसने सातोशी की कीज़ से एक संदेश साइन किया है:`,
      code_one: `-----BEGIN BITCOIN SIGNED MESSAGE----- \n \n मैं वैंडरपूल हूँ और मेरे पास उस प्राइवेट की का नियंत्रण है जिसका उपयोग सातोशी ने ब्लॉक #170 में पुष्टि हुई पहली बिटकॉइन ट्रांज़ैक्शन को साइन करने के लिए किया था। यह संदेश उसी प्राइवेट की से साइन किया गया है। \n \n -----BEGIN BITCOIN SIGNATURE----- \n \n`,
      code_two: `<span className="break-all"> H4vQbVD0pLK7pkzPto8BHourzsBrHMB3Qf5oYVmr741pPwdU2m6FaZZmxh4ScHxFoDelFC9qG0PnAUl5qMFth8k= </span>`,
      code_three: `\n \n-----END BITCOIN SIGNATURE-----`,
      paragraph_two: `इसका मतलब आखिर है क्या?`,
    },
    derive_message_two: {
      nav_title: `पब्लिक की ढूँढना`,
      paragraph_one: `अध्याय 4 में हमने सीखा था कि प्राइवेट कीज़ विशाल रैंडम संख्याएँ होती हैं जिन्हें उन्हें बनाने वाला गुप्त रखता है। हम एलिप्टिक कर्व गणित का उपयोग करके उस प्राइवेट की से एक पब्लिक की निकाल सकते हैं।`,
      paragraph_two: `पब्लिक की को एक यूनिक पहचानकर्ता के रूप में साझा किया जा सकता है और प्राइवेट की का उपयोग यह साबित करने के लिए किया जाता है कि किसी व्यक्ति का उस पहचानकर्ता पर नियंत्रण है। उस प्रमाण को सिग्नेचर कहा जाता है। सिग्नेचर बनाने के लिए एक संदेश और एक प्राइवेट की चाहिए। कोई भी व्यक्ति संदेश की एक कॉपी और संबंधित पब्लिक की के साथ सिग्नेचर को सत्यापित कर सकता है।`,
      paragraph_three: `वैंडरपूल ने एक सिग्नेचर और एक संदेश दिया है। पब्लिक की कहाँ है?`,
    },
    derive_message_three: {
      nav_title: `सातोशी का सिग्नेचर ढूँढें`,
      heading: `आइए सातोशी का सिग्नेचर ढूँढने से शुरू करें`,
      paragraph_one: `ब्लॉक #170 में सातोशी से हाल फ़िन्नी को किया गया <link href="https://bitcointalk.org/index.php?topic=155054.0" target="_blank" className="underline">पहला बिटकॉइन ट्रांज़ैक्शन</link> शामिल है। उस ट्रांज़ैक्शन में केवल <Link href="https://blockstream.info/tx/f4184fc596403b9d638783cf57adfe4c75c605f6356fbc91338530e9831e9e16?expand" target="_blank" className="underline">एक इनपुट</Link> है। उस इनपुट से scriptSig प्राप्त करें। उसमें सातोशी का सिग्नेचर है!`,
      placeholder: `यहाँ डेटा पेस्ट करें`,
      success: `अच्छा किया! यह वास्तव में सातोशी का सिग्नेचर है, जो उसके बिटकॉइन को हाल फ़िन्नी को ट्रांसफ़र करने की अनुमति देता है।`,
    },
    derive_message_four: {
      nav_title: `सातोशी की पब्लिक की ढूँढें`,
      heading: `तो उसकी पब्लिक की कहाँ है?`,
      paragraph_one: `वह वास्तव में उस बिटकॉइन के साथ संग्रहीत है जिसे सातोशी ने ब्लॉक #9 को माइन करके बनाया था।`,
      paragraph_two: `<Link href="https://blockstream.info/tx/0437cd7f8525ceed2324359c2d0ba26006d92d856a9c20fa0241106ee5a597c9?output:0&expand" target="_blank" className="underline">लिंक का अनुसरण करें</Link> और इनपुट #0 सेक्शन के शीर्ष पर स्रोत ट्रांज़ैक्शन देखें। यह वही ट्रांज़ैक्शन है जिसे सातोशी ने ब्लॉक #9 को माइन करके बनाया था। इस ट्रांज़ैक्शन में 50 BTC बनते हैं और उन्हें नियंत्रित किया जाता है… एक पब्लिक की द्वारा! scriptPubKey में 0411… से शुरू होने वाला डेटा ढूँढें।`,
      paragraph_three: `पब्लिक की, OP_PUSHBYTES और OP_CHECKSIG स्क्रिप्ट कमांड्स के बीच रहती है। इसे नीचे पेस्ट करें:`,
      placeholder: `यहाँ डेटा पेस्ट करें`,
      success: `बस यही है!`,
    },
    derive_message_five: {
      nav_title: `अब सिग्नेचर सत्यापित करें`,
      paragraph_one: `पिछले अभ्यास में हमने देखा कि सातोशी को ब्लॉक #9 माइन करने के लिए 50 BTC मिले। उसने इन्हें हाल फ़िन्नी को भेजे गए अपने ट्रांज़ैक्शन (ब्लॉक #170) के इनपुट के रूप में इस्तेमाल किया—10 BTC हाल फ़िन्नी की पब्लिक की को भेजे और 40 BTC बदलाव के रूप में अपने पास वापस लिए। सातोशी की प्राइवेट की का उपयोग उन फ़ंड्स के ट्रांसफ़र को अधिकृत करने के लिए सिग्नेचर बनाने में किया गया था।`,
      paragraph_two: `अब हमें यह सीखना है कि सिग्नेचर को कैसे सत्यापित किया जाए। लेकिन अभी भी कुछ गायब है… वह संदेश क्या है जिसे सातोशी ने हाल के लिए ट्रांज़ैक्शन को अधिकृत करने के लिए साइन किया था?`,
    },
    derive_message_six: {
      nav_title: `संदेश निकालें`,
      heading: `ट्रांज़ैक्शन से संदेश निकालें`,
      paragraph_one: `सिर्फ ब्लॉक एक्सप्लोरर वेब पेज देखकर ही यह स्पष्ट हो जाता है कि एक बिटकॉइन ट्रांज़ैक्शन में कई अलग-अलग हिस्से होते हैं। कुछ हिस्से छोटे नंबर होते हैं और कुछ बड़े डेटा ब्लॉक्स। बिटकॉइन प्रोटोकॉल में ट्रांज़ैक्शनों से संदेश बनाने के लिए एक बहुत विशिष्ट एल्गोरिदम होता है, ताकि उन संदेशों को प्राइवेट कीज़ से साइन किया जा सके।`,
      paragraph_two: `हम <Link href="https://en.bitcoin.it/wiki/OP_CHECKSIG" target="_blank" className="underline">यहाँ</Link> बताई गई प्रक्रिया का सार प्रस्तुत करेंगे। यह सुविधा से <Link href="https://en.bitcoin.it/wiki/OP_CHECKSIG#Code_samples_and_raw_dumps" target="_blank" className="underline">ब्लॉक #170 के इसी ट्रांज़ैक्शन</Link> को उदाहरण के रूप में उपयोग करता है।`,
      paragraph_three: `शुरू करने के लिए, हमें पूरे ट्रांज़ैक्शन को बनाने वाले रॉ बाइट्स चाहिए। <Link href="https://blockstream.info/api/tx/f4184fc596403b9d638783cf57adfe4c75c605f6356fbc91338530e9831e9e16/hex" target="_blank" className="underline">हमारा ब्लॉक एक्सप्लोरर</Link> इसमें मदद कर सकता है। "hex" API एंडपॉइंट का उपयोग करें और पूरे डेटा ब्लॉब को पेस्ट करें।`,
      input_challenge_label: `ट्रांज़ैक्शन ब्लॉब पेस्ट करें`,
      success_message_line_one: `यह प्रत्येक घटक के साथ लेबल किया गया रॉ ट्रांज़ैक्शन है:`,
      success_message_line_two: `वर्ज़न:`,
      success_message_line_three: `इनपुट्स की संख्या:`,
      success_message_line_four: `वह tx का हैश जिससे इनपुट #0 आया है:`,
      success_message_line_five: `फ़ंडिंग ट्रांज़ैक्शन में इनपुट #0 का इंडेक्स:`,
      success_message_line_six: `इनपुट #0 खर्च करने को अधिकृत करने वाला scriptSig:`,
      success_message_line_seven: `इनपुट #0 सीक्वेंस:`,
      success_message_line_eight: `आउटपुट्स की संख्या:`,
      success_message_line_nine: `आउटपुट #0 का मान (10 BTC या 1,000,000,000 सतोशी):`,
      success_message_line_ten: `आउटपुट #0 का scriptPubKey (हाल फ़िन्नी की पब्लिक की + OP_CHECKSIG):`,
      success_message_line_eleven: `आउटपुट #1 का मान (40 BTC या 4,000,000,000 सतोशी):`,
      success_message_line_twelve: `आउटपुट #1 का scriptPubKey (परिवर्तन के लिए फिर से सातोशी की अपनी पब्लिक की):`,
      success_message_line_thirteen: `लॉकटाइम:`,
    },
    derive_message_seven: {
      nav_title: `साइन करने के लिए संदेश बनाएँ`,
      paragraph_one: `ऐसे संदेश को साइन करना असंभव है जिसमें उसका अपना सिग्नेचर शामिल हो, इसलिए scriptSig को हटाना पड़ता है। बिटकॉइन प्रोटोकॉल में इसे वास्तव में उस ट्रांज़ैक्शन आउटपुट के scriptPubKey से बदल दिया जाता है जिसे हम खर्च कर रहे हैं।`,
      paragraph_two: `हम पहले ही पिछले चरण में scriptPubKey ढूँढ चुके हैं, आप उसे पहले खाली स्थान में पेस्ट कर सकते हैं।`,
      paragraph_three: {
        a: `हमारे ट्रांज़ैक्शन संदेश के लिए आख़िरी चीज़ जो चाहिए वह है एक`,
        b: `। अगले अध्याय में हम इसे और कवर करेंगे, लेकिन फिलहाल हम संदेश के अंत में <span className="font-bold">01000000</span> मान जोड़ देंगे।`,
      },
      tooltip_one: {
        question: `sighash फ़्लैग्स क्या हैं?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=what%2520are%2520sighash%2520flags%253F`,
        highlighted: `sighash प्रकार फ़्लैग`,
      },
      success: `अच्छा! तुमने साइन करने के लिए संदेश बना लिया है।`,
    },
    verify_signature_one: {
      title: `सिग्नेचर सत्यापित करें`,
      nav_title: `सिग्नेचर का सत्यापन`,
      heading: `आख़िरकार हमारे पास एक संदेश है!`,
      paragraph_one: `हमारे पास वह सिग्नेचर भी है जिसे हम जानते हैं कि सातोशी ने अपनी प्राइवेट कीज़ से बनाया था, और हमारे पास उसकी पब्लिक की भी है। आइए सीखें कि सिग्नेचर को कैसे सत्यापित किया जाए और फिर वैंडरपूल के सिग्नेचर को सत्यापित करने की कोशिश करें।`,
    },
    verify_signature_two: {
      title: `सिग्नेचर सत्यापित करें`,
      nav_title: `संदेश को हैश करें`,
      heading: `ट्रांज़ैक्शन डाइजेस्ट को हैश करें`,
      paragraph_one: `पिछले चरण में हमने जो सीरियलाइज़्ड ट्रांज़ैक्शन डेटा तैयार किया था, वह ECDSA से साइन या सत्यापित करने के लिए वास्तव में बहुत लंबा है।`,
      paragraph_two: `क्या हमें बड़े डेटा को अधिक सुसंगत, प्रबंधनीय टुकड़ों में संपीड़ित करने का कोई तरीका पता है? बिल्कुल: हैशिंग।`,
      paragraph_three: {
        a: `बिटकॉइन प्रोटोकॉल एक `,
        b: ` का उपयोग ट्रांज़ैक्शन को साइन करने योग्य संदेश में संपीड़ित करने के लिए करता है।`,
      },
      paragraph_four: `जब हमारे पास 32-बाइट का हैश आ जाता है, तो उस डेटा को एक पूर्णांक के रूप में पुनः व्याख्यायित किया जाता है। हाँ, एक 32-बाइट का पूर्णांक (जो वास्तव में एक बहुत ही विशाल संख्या है)!`,
      tooltip_one: {
        question: `बिटकॉइन में हर चीज़ डबल हैश (HASH256) का उपयोग क्यों करती है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=Why%2520does%2520everything%2520in%2520bitcoin%2520use%2520double%2520hash%2520%28HASH256%29%253F`,
        highlighted: `डबल SHA256 डाइजेस्ट`,
      },
      success: `अच्छा किया!`,
    },
    verify_signature_three: {
      nav_title: `सिग्नेचर डिकोड करें`,
      heading: `सिग्नेचर डिकोड करें`,
      label_one: `R मान पेस्ट करें`,
      label_two: `S मान पेस्ट करें`,
      paragraph_one: `सातोशी का सिग्नेचर DER नामक सिस्टम में एन्कोड किया गया है, जो ASN.1 का एक उपसमुच्चय है।`,
      paragraph_two: `हमें दो 32-बाइट संख्याएँ निकालनी हैं। इन्हें क्रमशः R और S कहा जाता है और DER सीक्वेंस में प्रत्येक के आगे 0220 बाइट्स जुड़े होते हैं। DER ब्लॉब को पूरी तरह डिकोड करने के बजाय, बस इन प्रीफ़िक्स को ढूँढें और R तथा S मान पेस्ट करें।`,
      paragraph_three: `# सातोशी का सिग्नेचर, हाल फ़िन्नी को किए गए tx (ब्लॉक 170) के इनपुट scriptSig से`,
    },
    verify_signature_four: {
      nav_title: `पब्लिक की डिकोड करें`,
      heading: `पब्लिक की डिकोड करें`,
      label_one: `x कोऑर्डिनेट पेस्ट करें`,
      label_two: `y कोऑर्डिनेट पेस्ट करें`,
      paragraph_one: `अध्याय 4 में हमने सीखा था कि पब्लिक की वास्तव में ECDSA कर्व पर बिंदु होती हैं, यानी उनमें x और y मान होते हैं। पहला बाइट 04 का मतलब “अनकंप्रेस्ड” होता है (02 और 03 के विपरीत, जैसा कि हमने अध्याय 4 में सीखा था)। उस पहले बाइट को हटा दें और शेष डेटा 32-बाइट के x और y कोऑर्डिनेट्स होंगे। फिर से कॉपी और पेस्ट करें।`,
      paragraph_two: `# सातोशी की पब्लिक की, ब्लॉक 9 के कॉइनबेस आउटपुट scriptPubKey से`,
    },
    verify_signature_five: {
      title: `सिग्नेचर सत्यापित करें`,
      nav_title: `सिग्नेचर का परीक्षण करें`,
      heading: `सिग्नेचर सत्यापित करें!`,
      success: `तुमने कर दिखाया! तुमने सातोशी का सिग्नेचर सत्यापित कर लिया है!`,
      paragraph_one: `इस बिंदु पर हमारे पास ECDSA गणित करने के लिए ज़रूरी सब कुछ है।`,
      paragraph_two: `ECDSA सिग्नेचर सत्यापन एल्गोरिदम <Link className="underline" href="https://en.wikipedia.org/wiki/Elliptic_Curve_Digital_Signature_Algorithm#Signature_verification_algorithm" target="_blank">यहाँ</Link> और <Link className="underline" href="https://www.secg.org/sec1-v2.pdf#page=52" target="_blank">यहाँ</Link> समझाया गया है।`,
      paragraph_three: `हमने आपके लिए पब्लिक की के X और Y तत्वों से एक ग्रुप एलिमेंट ऑब्जेक्ट बना दिया है। आपको ECDSA सिग्नेचर सत्यापन फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">verify()</span> को पूरा करना है, जो केवल तभी True लौटाए जब सब कुछ वैध हो!`,
      paragraph_four: `हम जानते हैं कि सातोशी का सिग्नेचर वैध है—इसे 2010 से हर बिटकॉइन फुल नोड द्वारा जाँचा गया है! अगर आपका प्रोग्राम True नहीं लौटाता, तो कुछ गलत है।`,
      python: {
        paragraph_five_part_one: `संकेत: <span className="text-green">pow()</span>`,
        paragraph_five_part_two: `मेथड नकारात्मक एक्सपोनेंट्स और एक मॉड्यूलस को आर्ग्युमेंट्स के रूप में स्वीकार कर सकता है। अधिक जानकारी <Link className="underline" href="https://docs.python.org/3/library/functions.html#pow" target="_blank">डॉक्यूमेंटेशन</Link> में।`,
      },
      javascript: {
        paragraph_five_part_one: `हमने एक हेल्पर फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">invert()</span>`,
        paragraph_five_part_two: `प्रदान किया है, जिसकी आपको JavaScript के नेटिव मॉड्यूलर एक्सपोनेंशिएशन फ़ंक्शन के स्थान पर आवश्यकता होगी।`,
      },
    },
    validate_signature_one: {
      title: `सिग्नेचर मान्य करें`,
      nav_title: `संदेश तैयार करें`,
      heading: `वैंडरपूल के संदेश को सत्यापन के लिए तैयार करें`,
      paragraph_one: `वैंडरपूल ने अपने स्टंट के लिए <Link href="https://github.com/bitcoin/bips/blob/master/bip-0137.mediawiki" target="_blank" className="underline">बिटकॉइन मैसेज साइनिंग प्रोटोकॉल</Link> का उपयोग किया। गणना वही एल्गोरिदम उपयोग करती है जिसे हमने पहले ही परिभाषित किया है, लेकिन डेटा की तैयारी थोड़ी अलग होती है।`,
      paragraph_two: `सबसे पहले, हमें उसके संदेश को बाइट्स की एक ऐरे में एन्कोड करना होगा, जो निम्न टेम्पलेट के अनुरूप हो:`,
      paragraph_three: {
        pre_link: `फिर हम उस डेटा ब्लॉब को `,
        highlighted: `डबल SHA-256 हैश`,
        question: `हम बिटकॉइन में डबल हैश क्यों करते हैं?`,
        post_link: ` करेंगे, और उस हैश को एक पूर्णांक में बदल देंगे। फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">encode_message()</span> को पूरा करें। इसे 32-बाइट का hex मान लौटाना चाहिए।`,
      },
      success: `अच्छा किया`,
    },
    validate_signature_two: {
      nav_title: `सिग्नेचर तैयार करें`,
      heading: `वैंडरपूल के सिग्नेचर को सत्यापन के लिए तैयार करें`,
      paragraph_one: `वैंडरपूल द्वारा उपयोग किया गया बिटकॉइन मैसेज साइनिंग प्रोटोकॉल सिग्नेचर के लिए base64 निर्दिष्ट करता है। हमें उस base64 स्ट्रिंग को 65-बाइट के अनुक्रम में डिकोड करना होगा। फिलहाल, हम पहले मेटाडेटा बाइट को नज़रअंदाज़ कर सकते हैं। शेष डेटा वही 32-बाइट r और s मान हैं जिनके बारे में हमने चरण 6 में सीखा था।`,
      javascript: {
        paragraph_two: {
          post_link: `फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">decode_sig()</span> को पूरा करें।`,
          return: `इसे [r, s] मानों के साथ BigInts की एक ऐरे लौटानी चाहिए।`,
        },
      },
      python: {
        paragraph_two: {
          post_link: `फ़ंक्शन <span className=" text-green">decode_sig()</span> को पूरा करें।`,
          return: `इसे (r, s) मानों के साथ एक टपल लौटानी चाहिए।`,
        },
      },
      success: `अच्छा किया`,
    },
    validate_signature_three: {
      title: `सिग्नेचर मान्य करें`,
      nav_title: `देखें क्या वैंडरपूल झूठ बोल रहा था`,
      heading: `तो क्या वैंडरपूल झूठा है?!`,
      paragraph_one: `आइए प्रोग्राम के लिए सभी आवश्यक घटक इकट्ठा करें और सत्यापित करें कि वैंडरपूल का सिग्नेचर वास्तव में सातोशी की पब्लिक की से जुड़ी प्राइवेट की से उत्पन्न हुआ था या नहीं! कृपया दिए गए कोड का उपयोग करके <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">verify()</span> फ़ंक्शन को चलाने के लिए आवश्यक गायब पैरामीटर्स भरें।`,
      paragraph_two: `फिर हम प्रोग्राम चलाकर देख सकते हैं कि वैंडरपूल झूठ बोल रहा था या नहीं। ढोल की थाप, कृपया...`,
      success: `यह संदेश दर्शाता है कि सिग्नेचर सातोशी की पब्लिक की से उत्पन्न नहीं हुआ, क्योंकि सत्यापन विफल रहा।`,
    },
    validate_signature_four: {
      title: `सिग्नेचर मान्य करें`,
      nav_title: `सही की ढूँढें`,
      heading: `वैंडरपूल ने वह सिग्नेचर आखिर बनाया कैसे?`,
      paragraph_one: `होलोकैट बीच में बोलती है और कहती है कि BitRey में एक भगोड़े ने हमें उन पब्लिक कीज़ की एक सूची भेजी है जिनका वैंडरपूल आमतौर पर उपयोग करता है—शायद उसने संदेश साइन करने के लिए इन्हीं में से किसी एक की का उपयोग किया हो।`,
      paragraph_two: `कृपया वह की प्रदान करें जो सत्यापन प्रक्रिया को सफलतापूर्वक पूरा करती है, ताकि हम पहचान सकें कि वैंडरपूल ने इस संदेश को साइन करने के लिए कौन-सी पब्लिक की इस्तेमाल की।`,
      paragraph_three: `आइए देखें कि क्या तुम इनमें से किसी एक की का उपयोग करके वैंडरपूल के संदेश और सिग्नेचर को सत्यापित कर सकते हो?`,
      success: `इस पब्लिक की के लिए सिग्नेचर वैध है—यह सातोशी नहीं था!`,
    },
    outro_one: {
      title: `आउट्रो`,
      nav_title: `अध्याय पूरा`,
      heading: `वैंडरपूल ने झूठ बोला!`,
      paragraph_one: `तुमने बिटकॉइन का एक सबसे महत्वपूर्ण सबक सीखा। तुमने भरोसा नहीं किया—तुमने सत्यापित किया।<br><br>ऐसा करके, तुमने पाया कि वैंडरपूल ने संदेश साइन करने के लिए सातोशी की कीज़ का उपयोग नहीं किया, जिससे उसकी पारिवारिक कहानी, उसकी विश्वसनीयता और BitRey की विश्वसनीयता पर बड़ा सवाल खड़ा हो गया।<br><br>अब बस काश तुम उस गाने को अपने दिमाग़ से निकाल पाते।`,
    },
    resources: {
      derive_message_three: {
        op_pushdata_heading: `OP_PUSHDATA`,
        op_pushdata_paragraph_one: `बिटकॉइन स्क्रिप्ट में OP_PUSHDATA ब्लॉकचेन में मनचाहे डेटा के टुकड़ों को सम्मिलित करने में एक महत्वपूर्ण भूमिका निभाता है। यह वास्तव में opcodes की एक पूरी श्रेणी है जो विभिन्न आकारों के डेटा एलिमेंट्स को शामिल करने की अनुमति देती है, जिससे बिटकॉइन की स्क्रिप्टिंग भाषा अधिक लचीली बनती है। यह opcode विशेष रूप से विभिन्न स्मार्ट कॉन्ट्रैक्ट फ़ंक्शनैलिटीज़ और कस्टम ट्रांज़ैक्शन प्रकारों के कार्यान्वयन में महत्वपूर्ण है। चूँकि हमें पता है कि यहाँ 71 बाइट्स का डेटा स्टैक पर पुश किया जाना है, क्या तुम यह निकाल सकते हो कि यह opcode hex में कैसे दर्शाया जाएगा? इन OP_CODES के बारे में और पढ़ने के लिए <Link href="https://en.bitcoin.it/wiki/Script#Constants" target="_blank" className="underline">यहाँ</Link> देखें।`,
      },
      derive_message_four: {
        op_checksig_heading: `OP_CHECKSIG`,
        op_checksig_paragraph_one: `बिटकॉइन स्क्रिप्ट में OP_CHECKSIG यह सुनिश्चित करने के लिए अत्यंत महत्वपूर्ण है कि सही प्राइवेट की ही किसी दिए गए ट्रांज़ैक्शन को खर्च कर सके। लगभग हर बिटकॉइन स्क्रिप्ट में एक OP_CHECKSIG होता है ताकि यह सुनिश्चित किया जा सके कि बिटकॉइन खर्च करने की कोशिश करने वाला व्यक्ति दी गई की के साथ ऐसा कर सकता है। इन OP_CODES के बारे में और पढ़ने के लिए <Link href="https://en.bitcoin.it/wiki/Script#Constants" target="_blank" className="underline">यहाँ</Link> देखें।`,
      },
      derive_message_six: {
        transaction_parts_heading: `ट्रांज़ैक्शन के हिस्से`,
        transaction_parts_one: `वर्ज़न: यह संस्करण बताता है कि ट्रांज़ैक्शन कैसे संगठित होगा।`,
        transaction_parts_two: `इनपुट्स की संख्या: इस ट्रांज़ैक्शन में इनपुट्स की संख्या।`,
        transaction_parts_three: `इनपुट #0 TXID: यह उस ट्रांज़ैक्शन का हैश है जिससे इनपुट #0 खर्च करता है।`,
        transaction_parts_four: `इनपुट #0 इंडेक्स: यह ऊपर दिए गए TXID द्वारा पहचाने गए ट्रांज़ैक्शन का आउटपुट इंडेक्स है जो फ़ंड्स का स्रोत प्रदान करता है।`,
        transaction_parts_five: `Scriptsig: यह वह डेटा है जो ऊपर निर्दिष्ट आउटपुट को खर्च करने को अधिकृत करता है। आमतौर पर इसमें सिग्नेचर्स होते हैं।`,
        transaction_parts_six: `इनपुट #0 सीक्वेंस: यह खर्च किए जा रहे इनपुट का सीक्वेंस नंबर है।`,
        transaction_parts_seven: `आउटपुट्स की संख्या: यह दर्शाता है कि tx में कितने आउटपुट हैं।`,
        transaction_parts_eight: `आउटपुट #0 का मान: यह वह राशि है जो पहले आउटपुट द्वारा खर्च की जाती है, जिसे लिटिल-एंडियन पूर्णांक के रूप में व्यक्त किया जाता है।`,
        transaction_parts_nine: `आउटपुट #0 का scriptPubKey: यह वह स्क्रिप्ट है जो निर्धारित करती है कि फ़ंड्स को खर्च करने के लिए क्या आवश्यक है। आमतौर पर इसमें एक पब्लिक की और अन्य opcodes होते हैं जो एक चुनौती बनाते हैं।`,
        transaction_parts_ten: `आउटपुट #1 का मान: यह वह राशि है जो दूसरे आउटपुट द्वारा खर्च की जाती है, जिसे लिटिल-एंडियन पूर्णांक के रूप में व्यक्त किया जाता है।`,
        transaction_parts_eleven: `आउटपुट #1 का scriptPubKey: यह वह स्क्रिप्ट है जो निर्धारित करती है कि फ़ंड्स को खर्च करने के लिए क्या आवश्यक है। आमतौर पर इसमें एक पब्लिक की और अन्य opcodes होते हैं जो एक चुनौती बनाते हैं।`,
        transaction_parts_twelve: `लॉकटाइम: वह ब्लॉक ऊँचाई जिसके पहले यह ट्रांज़ैक्शन पुष्टि के लिए वैध नहीं होता।`,
      },
      derive_message_seven: {
        sighash_type_flag_heading: `SigHash प्रकार फ़्लैग`,
        sighash_type_flag_paragraph_one: `SigHash फ़्लैग्स बिटकॉइन में एक तंत्र हैं जो यह परिभाषित करते हैं कि ट्रांज़ैक्शन के कौन-से हिस्से उस हैश में शामिल होंगे जिसे प्राइवेट की द्वारा साइन किया जाता है। मूल रूप से, ये साइन करने वाले की प्रतिबद्धता की सीमा को ट्रांज़ैक्शन डेटा के विशिष्ट हिस्सों तक निर्धारित करते हैं। SigHash फ़्लैग एक सिंगल बाइट होता है जो प्रत्येक सिग्नेचर के साथ जोड़ा जाता है और एक ही ट्रांज़ैक्शन के भीतर इनपुट्स के बीच अलग-अलग हो सकता है। SigHash फ़्लैग्स के कई प्रकार होते हैं, जिनके बारे में आप <Link href="https://river.com/learn/terms/s/sighash-flag" target="_blank" className="underline">यहाँ</Link> सीख सकते हैं।`,
      },
      verify_signature_two: {
        tip_one: `JavaScript संकेत: आप <span className="p-1 font-mono bg-[#0000004D] m-1">Buffer.from(someString, 'hex');</span> का उपयोग करके एक hex स्ट्रिंग को बाइट्स के बफ़र में बदल सकते हैं।`,
        signature_verification_heading: `सिग्नेचर सत्यापन`,
        signature_verification_paragraph_one: `सिग्नेचर सत्यापन एक गणितीय एल्गोरिदम है जिसमें एक पक्ष ऐसा डेटा (सिग्नेचर) प्रदान करता है जिसे केवल वही उत्पन्न कर सकता है यदि वह एक गुप्त संख्या (प्राइवेट की) जानता हो। सत्यापन में सिग्नेचर, पब्लिक की और दिए गए संदेश की तुलना शामिल होती है। यदि एल्गोरिदम TRUE बूलियन आउटपुट देता है, तो सिग्नेचर को प्रामाणिक माना जाता है।`,
      },
      verify_signature_three: {
        signature_encoding_heading: `सिग्नेचर एन्कोडिंग`,
        signature_encoding_paragraph_one: `(DER) सिग्नेचर या Distinguished Encoding Rules, बिटकॉइन में ECDSA सिग्नेचर को एन्कोड करने के लिए उपयोग किया जाने वाला एक फ़ॉर्मैट है। ECDSA सिग्नेचर एक प्राइवेट की और साइन किए गए संदेश के हैश का उपयोग करके बनाया जाता है। इसमें दो 32-बाइट संख्याएँ (r, s) होती हैं। इसके कई घटक होते हैं, जिनके बारे में आप <Link href="https://technicaldifficulties.io/2020/07/22/bip-66-unpacking-der-signatures/" target="_blank" className="underline">यहाँ</Link> और जान सकते हैं।`,
      },
      verify_signature_four: {
        eliptic_curve_heading: `एलिप्टिक कर्व डिजिटल सिग्नेचर एल्गोरिदम (ECDSA)`,
        eliptic_curve_paragraph_one: `ECDSA एक क्रिप्टोग्राफ़िक एल्गोरिदम है जिसका उपयोग बिटकॉइन यह सुनिश्चित करने के लिए करता है कि फ़ंड्स केवल उनके वैध मालिकों द्वारा ही खर्च किए जा सकें। पब्लिक की को एलिप्टिक कर्व गुणा के माध्यम से प्राइवेट की से निकाला जाता है, जो गणनात्मक रूप से सरल है। हालाँकि, इस प्रक्रिया को उलटकर पब्लिक की से प्राइवेट की निकालना गणनात्मक रूप से असंभव है। यह एक-तरफ़ा फ़ंक्शन बिटकॉइन की सुरक्षा की आधारशिला है।`,
        public_private_key_heading: `पब्लिक और प्राइवेट कीज़`,
        public_private_key_paragraph_one: `बिटकॉइन में सुरक्षित ट्रांज़ैक्शनों को सुनिश्चित करने के लिए कीज़ की एक जोड़ी का उपयोग किया जाता है। प्राइवेट की, जिसे गुप्त रखा जाता है, ट्रांज़ैक्शनों को साइन करने और बिटकॉइन पते के स्वामित्व को साबित करने के लिए उपयोग होती है। पब्लिक की, जो प्राइवेट की से निकाली जाती है, साझा की जा सकती है और यह सत्यापित करने के लिए उपयोग होती है कि सिग्नेचर प्राइवेट की धारक द्वारा बनाया गया है, बिना प्राइवेट की को उजागर किए।`,
      },
      verify_signature_five: {
        finite_field_arithmetic_heading: `सीमित क्षेत्र अंकगणित`,
        finite_field_arithmetic_paragraph_one: `इस प्रकार का अंकगणित, जिसका उपयोग ECDSA में होता है, एक निश्चित सीमा या क्षेत्र के भीतर संख्याओं से संबंधित होता है। जोड़, घटाव, गुणा और मॉड्यूलर इनवर्स निकालने जैसे ऑपरेशन्स इस क्षेत्र के आकार के सापेक्ष किए जाते हैं। यह बिटकॉइन की क्रिप्टोग्राफी में एलिप्टिक कर्व गणनाओं के लिए आवश्यक है।`,
        ge_and_fe_heading: `ग्रुप एलिमेंट्स (GE) और फ़ील्ड एलिमेंट्स (FE)`,
        ge_and_fe_paragraph_one: `एलिप्टिक कर्व क्रिप्टोग्राफी के संदर्भ में, एक ग्रुप एलिमेंट आम तौर पर एलिप्टिक कर्व पर एक बिंदु को दर्शाता है। इस चैलेंज में, GE ऐसे ही एक बिंदु को संदर्भित करता है जिसके विशिष्ट x और y कोऑर्डिनेट्स होते हैं। FE सीमित क्षेत्र का एक एलिमेंट दर्शाता है, जिसका उपयोग क्षेत्र की सीमाओं के भीतर गणनाओं के लिए किया जाता है।`,
        modular_inverse_heading: `मॉड्यूलर इनवर्स`,
        modular_inverse_paragraph_one: `किसी संख्या a का m मॉड्यूलो में मॉड्यूलर इनवर्स वह संख्या b होती है जिसके लिए (a * b) % m = 1 हो। मॉड्यूलर इनवर्स निकालना ECDSA सिग्नेचर सत्यापन में एक महत्वपूर्ण चरण है। इसका उपयोग सत्यापन प्रक्रिया के दौरान u1 और u2 की गणना में किया जाता है।`,
      },
      validate_signature_one: {
        message_verification_heading: `संदेश सत्यापन का महत्व`,
        message_verification_paragraph_one: `संदेश सत्यापन बिटकॉइन इकोसिस्टम के भीतर संचार की सुरक्षा को बढ़ाता है। यह पक्षों को संदेशों की प्रामाणिकता और अखंडता सत्यापित करने की अनुमति देता है, जो उन स्थितियों में मूल्यवान होता है जहाँ भरोसा और सत्यापन आवश्यक होते हैं, जैसे पीयर-टू-पीयर ट्रांज़ैक्शनों या स्मार्ट कॉन्ट्रैक्ट में पक्षों के बीच संचार में। इसके अलावा, संदेश सत्यापन विभिन्न अनुप्रयोगों के लिए एक आधार के रूप में काम करता है, जिनमें पहचान सत्यापन और किसी विशेष बिटकॉइन पते के स्वामित्व का प्रमाण शामिल है। यह क्रिप्टोग्राफ़िक आश्वासन की एक परत जोड़ता है, जो बिटकॉइन नेटवर्क की ट्रस्टलेस और विकेंद्रीकृत प्रकृति को मज़बूत करता है।`,
      },
      validate_signature_two: {
        base64_encoding_heading: `Base64 एन्कोडिंग`,
        base64_encoding_paragraph_one: `Base64 एक बुनियादी बाइट-से-टेक्स्ट एन्कोडिंग स्कीम है जो डेटा को बाइट्स में बदलने की अनुमति देती है ताकि उन्हें बफ़र्स में उपयोग किया जा सके, या बाइट्स से टेक्स्ट में इस तरह बदला जा सके कि URL पाथ्स और क्वेरी पैरामीटर्स के साथ कोई समस्या न हो। यह base58 एन्कोडिंग स्कीम से अलग है क्योंकि इसमें वे मिलते-जुलते कैरेक्टर्स (शून्य, बड़ा 'O', बड़ा 'I', और छोटा 'l') शामिल रहते हैं, जो अन्यथा किसी उपयोगकर्ता को एन्कोडेड संदेश कॉपी या डिक्टेट करते समय भ्रमित कर सकते हैं।`,
      },
      validate_signature_three: {
        signing_and_ownership_heading: `संदेश साइनिंग और स्वामित्व`,
        signing_and_ownership_paragraph_one: `बिटकॉइन की छद्म-गुमनामी के कारण, हम निश्चित रूप से बहुत सीमित चीज़ें ही साबित कर सकते हैं, क्योंकि किसी की का मालिक संदेश साइन करने से मना कर सकता है या जानबूझकर गलत की से संदेश साइन कर सकता है। हम केवल यह साबित कर सकते हैं कि जो की एक अवैध सिग्नेचर बनाती है, वह उस की से मेल नहीं खाती जो किसी संदेश को साइन कर सकती है।`,
      },
      validate_signature_four: {
        one_for_one_heading: `एक के लिए एक`,
        one_for_one_paragraph_one: `ECDSA की विश्वसनीयता और सुरक्षा सुनिश्चित करने के लिए, एक प्राइवेट की द्वारा बनाया गया सिग्नेचर केवल उसी से संबंधित पब्लिक की द्वारा सत्यापित किया जा सकता है। यदि अलग-अलग प्राइवेट कीज़ एक ही पब्लिक की या सिग्नेचर बना सकतीं, तो यह ECDSA की सुरक्षा और विश्वसनीयता को कमजोर कर देता। इसके माध्यम से हम जान सकते हैं कि जिस पब्लिक की ने इस संदेश को साइन किया है, उसी के पास इस बिटकॉइन का स्वामित्व है।`,
      },
    },
  },
  chapter_six: {
    title: 'अपराध सबसे अच्छा बचाव है',
  },
  chapter_seven: {
    title: 'इक्कीस',
  },
  chapter_eight: {
    title: 'स्थिरता का मामला',
  },
  chapter_nine: {
    title: 'गणना मत करो, सत्यापित करो।',
  },
  chapter_ten: {
    title: '10 बिलियन कनेक्शन',
  },
  challenge_list: {
    coming_soon: 'जल्द आ रहा है। उत्साह से प्रतीक्षा करें।',
  },
  chapter: {
    chapter_locked_one: 'पूरा अध्याय',
    chapter_locked_two: 'खोलने के लिये।',
  },
  hero: {
    title: 'सेविंग सातोशी',
    description: 'बिटकॉइन के रहस्यों के माध्यम से अपना रास्ता कोड करें।',
    start_journey: 'डेमो शुरू करें',
    tell_more: 'मुझे और बताएँ',
  },
  footer: {
    paragraph_one: 'बिटकॉइन समुदाय द्वारा एक ओपन-सोर्स उत्पादन।',
    link: 'कोड की जाँच करें',
  },
  navbar: {
    intro: 'पहचान',
    chapter: 'अध्याय',
    chapter_complete: 'अध्याय पूरा',
    challenge: 'चुनौती',
  },
  modal_login: {
    heading: 'अपनी प्रगति लोड करें',
    paragraph_one:
      'अपने अध्याय और चुनौती की प्रगति, साथ ही साथ अपने अवतार को पुनर्स्थापित करने के लिए नीचे अपना व्यक्तिगत कोड दर्ज करें।',
    clear: 'अभी तक कोई कोड नहीं है?',
    prompt: 'अपने कोड दर्ज करें',
    confirm: 'मेरी प्रगति लोड करें',
    paragraph_two:
      'क्षमा करें, यह इस ब्राउज़र में संग्रहीत प्रगति के लिए सही कोड नहीं है।',
    paragraph_three: 'अभी तक कोई कोड नहीं है या फिर से शुरू करना चाहते हैं?',
    quit: 'सहेजें प्रगति साफ़ करें।',
    success: 'प्रगति भार हुई',
    success_message: 'आप अध्याय के साथ जारी रखने के लिए पूरी तरह तैयार हैं',
  },
  modal_logout: {
    heading: 'आप लोग्ड इन हो चुके हैं',
    paragraph_one:
      'आपकी प्रगति इस ब्राउज़र में संग्रहीत है। आप 30 दिनों के बाद स्वचालित रूप से लॉग आउट हो जाएंगे। ब्रेक लेने के बाद इसे पुनर्स्थापित करने के लिए नीचे दिए गए कोड का प्रयोग करें।',
    signout: 'साइन आउट',
  },
  modal_signup: {
    heading: 'अपनी प्रगति को सहेजना चाहते हैं?',
    paragraph_one:
      'किसी भी डिवाइस और ब्राउज़र पर अपनी प्रगति को सहेजने और लोड करने के लिए सरल कोड को कॉपी और स्टोर करें। यदि आपके पास पहले से कोड है, तो अपनी प्रगति यहां लोड करें।',
    subheading_one: 'एक अवतार चुनें',
    subheading_two: 'अपने व्यक्तिगत कोड का बैकअप लें',
    paragraph_two:
      'सब तैयार? कोड कॉपी किया गया और बैक-अप किया गया? सुनिश्चित करें कि आप ऐसा करते हैं, क्योंकि यदि आप इसे खो देते हैं तो इसे पुनर्प्राप्त नहीं किया जा सकता है।',
    confirm: 'मैंने अपना कोड कॉपी और बैक अप लिया है',
  },
  demo_disclaimer: {
    title: 'यह एक डेमो है',
    description:
      'हम अभी भी इस परियोजना के प्रारंभिक चरण में हैं। अध्याय 1 कार्यात्मक है, शेष विकास के अधीन है। इसे आज़माएं और हमें बताएं कि आप क्या सोचते हैं, हमें <Link href="https://docs.google.com/forms/d/e/1FAIpQLSf1xpNqUYJyvYL5IZDnxy78273pkqzfYW2Hf91H4Do4KHgy9g/viewform?usp=sf_link" className="underline">आपकी प्रतिक्रिया</Link> अच्छी लगेगी।"',
  },
  runner: {
    run: 'स्क्रिप्ट चलाएँ',
    running: 'कार्यरत',
    pause: 'विराम',
    result: 'परिणाम',
    evaluation: 'मूल्यांकन',
    script_output: 'स्क्रिप्ट आउटपुट',
    waiting: 'उपरोक्त आपके इनपुट की प्रतीक्षा कर रहा है...',
  },
}

export default translations
