const translations = {
  shared: {
    next: 'जारी रखे',
    start: 'करे',
    info: 'जानकारी',
    copy: 'प्रतिलिपि',
    about: 'अबाउट',
    chapter: 'अध्याय',
    chapters: 'अध्याय',
    challenge: 'चुनौती',
    challenges: 'चुनौतियाँ',
    coming_soon: 'जल्द आ रहा है',
    start_chapter: 'अध्याय प्रारंभ करें',
    back: 'जाए',
  },
  status_bar: {
    begin_message: 'जारी रखने के लिए ऊपर दी गई चुनौती को पूरा करें...',
    error_message: 'हम्म... यह अभी पूरी तरह ठीक नहीं है...',
    in_progress_message: 'अब तक अच्छा लग रहा है ...',
    success_message: 'अच्छी तरह से किया!',
    next: 'अगला',
    next_step_message: 'अब ठीक लग रहा है, चलिए अगले चरण पर चलते हैं।',
    im_stuck: 'मैं अटक गया हूँ',
    try_again: 'दोबारा कोशिश करें',
    skip_challenge_first: 'चलिए पहली चुनौती पर चलते हैं!',
    skip_challenge_last: 'चलिए आखिरी चुनौती पर चलते हैं!',
  },
  ///ABOUT PAGE
  about: {
    title: 'अबाउट',
    mobile_title: 'यह किसके बारे में है',
    subtitle:
      'वर्ष 2139 है। अंतिम बिटकॉइन खनन होने से दो सप्ताह बाद है। सतोशी स्क्वायर में महीनों से एक घड़ी टिक-टिक कर रही है।',
    intro:
      'दुनिया आखिरी ब्लॉक का इंतजार कर रही है। फिर, अचानक, नेटवर्क ठप हो जाता है।<br><br>आपको सतोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति से एक होलोकैट प्राप्त होता है। (यह किसी भी अन्य ई-होलोग्राम की तरह है, लेकिन यह एक बिल्ली के आकार का है)। आप इसकी नाक को उछाल कर प्रलय खोलते हैं, यह सुनने के लिए उत्सुक हैं कि इसे क्या कहना है ...',
    project: {
      title: 'मजे से बनाया है',
      paragraph_one:
        'सातोशी को सहेजना डेवलपर्स के लिए संपर्क का एक हल्का-फुल्का पहला बिंदु है जो बिटकॉइन के विकास के बारे में उत्सुक हैं। सेविंग सातोशी में तकनीकी पाठ और कोड-आधारित चुनौतियों का मिश्रण है, लेकिन बुनियादी कोडिंग कौशल वाले किसी भी व्यक्ति के लिए चुनौतियाँ साध्य होनी चाहिए। यह परियोजना स्वतंत्र और खुला स्रोत है और सभी कलाओं को मिडजर्नी जैसे टेक्स्ट-टू-इमेज (उर्फ एआई) टूल का उपयोग करके उत्पन्न किया गया है।',
      paragraph_two:
        'परियोजना का यह संस्करण वर्तमान में समग्र अनुभव पर प्रतिक्रिया प्राप्त करने और शुरुआती उपयोगकर्ताओं के लिए अवधारणा का प्रमाण प्रदान करने के लक्ष्य के साथ एक डेमो स्थिति में है। इसके आलोक में, उपयोगकर्ता की प्रगति ब्राउज़र में स्थानीय रूप से संग्रहीत की जाती है और छवियों के साथ कहानी को अंतिम रूप नहीं दिया जाता है।',
      paragraph_three:
        'हमें प्राप्त फीडबैक के आधार पर, हम फिर एक आधिकारिक रिलीज़ (हम इसे V1 कहते हैं) की दिशा में काम करेंगे जिसमें 2-3 पूर्ण पाठ अध्याय, खाते और बहुत कुछ शामिल हैं। 10 अध्यायों की योजना बनाई गई है और समय के साथ उन्हें पूरा कर लिया जाएगा। अतिरिक्त सुविधाओं में सहयोगी शिक्षा, बैज, अतिरिक्त-चुनौतीपूर्ण पक्ष खोज, और बहुत कुछ शामिल हो सकते हैं।',
    },
    contributing: {
      title: 'योगदान कैसे करें',
      paragraph_one:
        'हम एक ओपन-सोर्स प्रोजेक्ट हैं, इसलिए इसे आकार देने में आपकी मदद के लिए सभी दरवाजे खुले हैं।',
      feedback: {
        title: 'प्रतिक्रिया',
        paragraph_one:
          'योगदान करने का वास्तव में एक बढ़िया तरीका है अध्याय 1 को पढ़ना और हमें इस फ़ॉर्म का उपयोग करने के आपके समग्र अनुभव पर कोई फ़ीडबैक देना।',
      },
      contribute: {
        title: 'योगदान देना',
        paragraph_one:
          'सभी सुझावों का स्वागत है, सामग्री परिवर्तन, खेल यांत्रिकी सहित - वास्तव में कुछ भी। हम हमेशा समीक्षा और <a href="https://leaf-singer-0fc.notion.site/How-to-QA-5177e63f65a4406da01bc57d886b5ac2" target="_blank" rel="noreferrer">क्यूए-इंग कोड परिवर्तन</a>। कोड सुधार के लिए, आप सीधे किसी समस्या को खोल सकते हैं या GitHub पर पुल अनुरोध सबमिट कर सकते हैं।',
        paragraph_two:
          'यदि आप डिज़ाइन, कहानी, या किसी अन्य चीज़ में शामिल होना चाहते हैं, तो <a href="https://discord.gg/DC8Dys4G3h" target="_blank" rel="noreferrer">Bitcoin Design Discord</a> में #Saving-satoshi चैनल में हमसे जुड़ें। उल्लेख करें कि आप कैसे योगदान देना चाहते हैं और हम आपको सही दिशा में इंगित करने में मदद करेंगे।',
      },
    },
    contributors: {
      title: 'आनंद लीजिये!',
      contributions_by: 'द्वारा योगदान',
      many_more:
        'और <a href="https://github.com/Saving-satoshi/Saving-satoshi/graphs/contributors" target="_blank" rel="noreferrer">और भी बहुत से लोगो द्वारा</a>।',
    },
    satoshi_needs_you: 'अब जल्दी करो, सातोशी को तुम्हारी जरूरत है।',
  },

  ///CHAPTERS TITLE PAGE
  chapter_one: {
    title: 'स्पष्ट दृष्टि में राज़ ',
    paragraph_one:
      'वर्ष 2139 है। अंतिम बिटकॉइन खनन होने से दो सप्ताह बाद है। सतोशी स्क्वायर में महीनों से एक घड़ी टिक-टिक कर रही है। दुनिया आखिरी ब्लॉक का इंतजार कर रही है।',
    paragraph_two: 'तभी अचानक नेटवर्क ठप हो गया।',
    intro_one: {
      title: 'उत्पत्ति',
      paragraph_one: 'क्षण भर बाद, आपकी होवर स्क्रीन सक्रिय हो जाती है।',
      paragraph_two:
        '-Deborah Chunk: "Thomas Vanderpoole। BitRey के CEO के रूप में, आप दुनिया के सबसे बड़े बिटकॉइन माइनिंग पूल में से एक चलाते हैं। आप बिटकॉइन माइनिंग मशीन भी बनाते हैं। क्या हो रहा हिया? क्या बिटकॉइन मर रहा है?"',
      paragraph_three:
        '-Vanderpoole: "हाँ, मैं करता हूँ, Deborah। उससे पहले मेरे डैडी और उनके डैडी की तरह। Vanderpoole 21,000 ब्लॉक के बाद से खनन कर रहे हैं। इसलिए मैं विश्वास के साथ कह सकता हूं कि दुनिया भर के खनिक अपनी मशीनों को बंद करके इस देरी का कारण बन रहे हैं। यह एक विरोध है। कोई नहीं चाहता कि बिटकॉइन 21 मिलियन पर जारी होना बंद हो। हम केवल फीस पर जीवित नहीं रह सकते हैं।',
      start: 'जारी रखना',
    },
    intro_two: {
      title: 'उत्पत्ति',
      paragraph_one:
        'सतोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति से आपको एक होलोकैट प्राप्त होता है। (यह किसी भी अन्य ई-होलोग्राम की तरह है, लेकिन यह एक बिल्ली के आकार का है।) आप इसकी नाक को उछाल कर होलोकेट को खोलते हैं।',
      paragraph_two:
        '—“बिटकॉइन मर नहीं रहा है, लेकिन इसे आपकी मदद की जरूरत है। बिल्ली को मत भूलना। – सातोशी नाकामोतो',
      paragraph_three:
        '—सातोशी? सातोशी? नहीं, यह नहीं हो सकता। उन्हें एक सदी से अधिक समय से मृत मान लिया गया है। क्या वे नहीं हैं?',
      paragraph_four: 'क्या वे नहीं हैं?',
      paragraph_five:
        'होलोकैट: "बेहतर होगा कि आप काम पर लग जाएं। मैं मदद कर सकता हूं, लेकिन आपको म्याऊ शुरू करना होगा।',
    },
    genesis_one: {
      title: 'उत्पत्ति',
      heading: 'आपकी पहली चुनौती',
      paragraph_one:
        'बिटकॉइन सेंसरशिप प्रतिरोधी पैसा है। कोई भी व्यक्ति नेटवर्क पर लेन-देन प्रसारित करके पैसा भेज सकता है। प्रसारण के बाद, खनिकों द्वारा लेन-देन को ब्लॉक में पैक किया जाता है। श्रृंखला पर निर्माण के विशेषाधिकार के लिए खनिक अन्य खनिकों के खिलाफ प्रतिस्पर्धा करते हैं। यही बिटकॉइन को विकेंद्रीकृत रखता है।',
      paragraph_two:
        'बिटकॉइन के छद्म नाम के आविष्कारक सतोशी नाकामोटो ने भी पहले बिटकॉइन ब्लॉक का खनन किया। उसने दुनिया को पहले बिटकॉइन लेनदेन में एक गुप्त संदेश छोड़ा था जो कभी भी किया गया था। आपकी पहली चुनौती इसे ढूंढना और डिकोड करना है।',
    },
    genesis_two: {
      title: 'उत्पत्ति',
      heading: 'छिपे हुए संदेश को खोजें',
      paragraph_one:
        'आइए बिटकॉइन ब्लॉकचेन में सबसे पहले ब्लॉक को खोजें। नीचे दिए गए बटन पर क्लिक करके एक ' +
        '<Tooltip id="genesis_two_paragraph_one" content={chapter_one.genesis_two.tooltip_block_explorer} theme="bg-[#30435b]">' +
        'ब्लॉक एक्सप्लोरर' +
        '</Tooltip>' +
        ' को ठीक ब्लॉक 0 पर खोलें, जिसे उत्पत्ति ब्लॉक कहा जाता है।',
      paragraph_two: `नीचे स्क्रॉल करें और इस ब्लॉक में संग्रहीत एकमात्र लेन-देन के विवरण को खोलें। “कॉइनबेस” नामक इनपुट खोजें। अब “SCRIPTSIG (<Tooltip id="genesis_two_paragraph_two" content={chapter_one.genesis_two.tooltip_hex} theme="bg-[#30435b]">HEX</Tooltip>)” लेबल देखें। इसके आगे दिया गया मान एक एन्कोडेड संदेश है।`,
      paragraph_three: 'उस मान को कॉपी करें और नीचे पेस्ट करें।',
      tooltip_block_explorer:
        'एक <a href="https://bitcoinops.org/en/topics/block-explorers/" target="_blank" rel="noreferrer">' +
        'ब्लॉक एक्सप्लोरर</a> एक उपयोगी टूल है, जिसकी मदद से बिटकॉइन लेन-देन से संबंधित जानकारी को जल्दी खोजा जा सकता है।',

      tooltip_hex:
        'हेक्साडेसिमल एक संख्या प्रणाली है जो आधार 16 का उपयोग करती है और बिटकॉइन में डेटा को ' +
        'संक्षिप्त रूप से दर्शाने के लिए उपयोग की जाती है। ' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520hexadecimal%2520encoding%2520and%2520why%2520is%2520it%2520used%2520in%2520Bitcoin%253F" ' +
        'target="_blank" rel="noreferrer">' +
        'और जानें' +
        '</a>',
      view_block_0: 'ब्लॉक 0 देखें',
      placeholder: 'आपको जो वैल्यू मिली है उसे यहां पेस्ट करें',
    },
    genesis_three: {
      title: 'उत्पत्ति',
      heading: 'आइए संदेश को डिकोड करें',
      paragraph_one:
        'आपको जो संदेश मिला वह हेक्स नामक प्रारूप में एन्कोड किया गया था। अब हम इसे ' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520ASCII%2520encoding%2520and%2520why%2520is%2520it%2520used%253F" target="_blank" rel="noreferrer" className="underline">' +
        'ASCII' +
        '</a>' +
        ' में बदलने के लिए एक कमांड चलाएंगे, जिसे हम पढ़ सकेंगे।',

      paragraph_two:
        'नीचे दिए गए आदेश को टर्मिनल में दाईं ओर कॉपी और पेस्ट करें और "एंटर" दबाएं।',
      terminal_challenge_lines: `यहां अपने आदेश दर्ज करें और एंटर दबाएं...\n चर $scriptSigHex आपके लिए पहले से परिभाषित है।\n\n var $scriptSigHex = '04fff...e6b73'`,
      waiting_for_input:
        'स्क्रिप्ट लिखने और चलाने के लिए आपका इंतज़ार किया जा रहा है...',
      success:
        'बहुत बढ़िया! डिकोड किया गया संदेश जनवरी 3,2009 से <Link href="https://en.bitcoin.it/wiki/Genesis_block" className="underline">The Times</Link> के पहले पन्ने का संदर्भ देता है, उसी दिन सातोशी ने खनन किया था उत्पत्ति ब्लॉक। कितना मजेदार है!?! यह संदेश हमें बिटकॉइन बनाने के लिए उनकी प्रेरणा के बारे में भी कुछ जानकारी देता है।\n\n चलो ऐसे ही चलते रहें।',
    },
    genesis_four: {
      title: 'उत्पत्ति',
      subtitle: 'बधाई! आपने पहली चुनौती पूरी की!',
      paragraph_one:
        'आपको जेनेसिस ब्लॉक में सन्निहित गुप्त संदेश सातोशी नाकामोटो मिला। आपने अभी जो सीखा है, उस पर विस्तार करने का समय आ गया है। अगली चुनौती में कहानी के बारे में एक महत्वपूर्ण सुराग को डिकोड करें।',
    },
    transacting_one: {
      title: 'लेनदेन',
      heading: 'लेन-देन में क्या है?',
      paragraph_one:
        'लेन-देन के दो भाग होते हैं: इनपुट और आउटपुट। पिछले अभ्यास में हमने लेन-देन इनपुट के अंदर पाए गए एक गुप्त संदेश को डिकोड किया था। इस बार हम एक संदेश को डिकोड करेंगे जो आउटपुट भाग से संबंधित है।',
      paragraph_two:
        'निम्नलिखित लेन-देन के लिए, हम OP_RETURN प्रकार के आउटपुट की पहचान करने जा रहे हैं।',
    },
    transacting_two: {
      title: 'लेनदेन',
      heading: 'OP_RETURN',
      paragraph_one:
        'लेन-देन में गुप्त संदेशों को छिपाने का एक और तरीका है। बिटकॉइन में एक विशेष प्रकार का कोड है जिसे OP_RETURN कहा जाता है जो उपयोगकर्ताओं को लेनदेन आउटपुट में संदेश संलग्न करने की अनुमति देता है। आइए देखें कि क्या हम एक खोज सकते हैं।',
      paragraph_two:
        '1. विशिष्ट लेन-देन देखने के लिए <Link href="https://blockstream.info/tx/ff9148605a772a51cba39004df5fb042d40515967a3e38ff5294cfd017c452a9" className="underline">यहां</Link> क्लिक करें।',
      paragraph_three:
        '2. विवरण खोलें और वह भाग ढूंढें जो "OP_RETURN" प्रकार का है।',
      paragraph_four:
        '3. अब "SCRIPTPUBKEY (ASM)" फ़ील्ड खोजें। "OP_RETURN OP_PUSH_BYTES_28" भाग देखें? इन्हें ओपकोड कहा जाता है। हम वास्तव में इसमें रुचि रखते हैं कि उनके बाद क्या आता है।',
      paragraph_five:
        '4. "OP_RETURN OP_PUSHBYTES_28" के बाद संख्याओं की लंबी स्ट्रिंग को कॉपी करें और नीचे पेस्ट करें।',
      input_challenge_label: 'OP_RETURN प्रकार दर्ज करें',
    },
    transacting_three: {
      title: 'लेनदेन',
      heading: 'एक और गुप्त संदेश',
      paragraph_one:
        'हमने लेन-देन आउटपुट के उस हिस्से की पहचान की है जो संदेश को धारण करता है।',
      paragraph_two:
        'अब जो कुछ बचा है, उसे डिकोड करना है, ठीक वैसे ही जैसे हमने पिछले अभ्यास में किया था।',
      paragraph_three:
        '$scriptPubKey बाइट्स फिर से देखने की आवश्यकता है? यह लो।',
      link: 'लेन-देन देखें',
      terminal_challenge_success:
        'यह सही है! अच्छा काम।\n\n जैसा कि आप देख सकते हैं, सुराग एक पता है। यह करने के लिए जाना है।\n\n आपकी अगली चुनौती आपका इंतजार कर रही है।',
      terminal_challenge_lines:
        'यहां अपने आदेश दर्ज करें और एंटर दबाएं...\n\n Command: \n echo $scriptPubKeyBytes | xxd -r -p \n\n ध्यान दें कि इस बार आपके लिए $scriptPubKeyBytes परिभाषित नहीं है। आपको इस चर को कोड में उस मान से बदलना होगा जो आपने पिछली चुनौती में पाया था',
      terminal_challenge_error:
        'लगभग! याद रखें कि इस बार आपके लिए वेरिएबल $scriptPubKeyBytes सेट नहीं है।',
    },
    outro_one: {
      title: 'आउट्रो',
      paragraph_one:
        'आप अपने गैरेज में भागते हैं, अपने पिता के पुराने सोलोकॉप्टर में कदम रखते हैं, निर्देशांक में पंच करते हैं, और पते पर अपना रास्ता बनाते हैं।',
      paragraph_two:
        'बिल्ली की एलर्जी इतनी तीव्र होने के बावजूद कि वे होलोग्राम पर भी लागू होती हैं, होलोकैट साथ आता है। आप आपत्ति करते हैं, लेकिन बिल्लियाँ तो बिल्लियाँ रहेंगी।',
      button_text: 'अध्याय 1 समाप्त',
    },
    outro_two: {
      title: 'तुमने कर दिखाया!!!',
      description:
        'अद्भुत। आपने पहला अध्याय पूरा किया और बिटकॉइन के बारे में बहुत कुछ सीखा। जब हम नए अध्याय और चुनौतियाँ लॉन्च करते हैं, यह जानने के लिए हमें <Link href="https://twitter.com/Savingsatoshi" className="underline">@Savingsatoshi</Link> पर फ़ॉलो करें।',
    },
    end: {
      save: 'मेरी प्रगति को सहेंजो',
      next: 'बिना सहेजे जारी रखें',
      feedback: 'अपनी प्रतिक्रिया साझा करें',
    },
  },
  chapter_two: {
    title: '51% हमला',
    paragraph_one:
      'नेटवर्क आउटेज को ब्लॉक सब्सिडी से संबंधित होना चाहिए। यह कोई संयोग नहीं है।',
    paragraph_two:
      'जब आप खनन किए जा रहे कुछ ब्लॉकों के बारे में कुछ असामान्य देखते हैं तो आप अपने कंप्यूटर पर खनन पर कुछ शोध करने की उम्मीद करते हैं। ऐसा लगता है कि वे सभी एक ही जगह से आ रहे हैं, संभवतः एक ही खनन पूल से भी। बाकी खनिकों का क्या हुआ?',
    intro_one: {
      title: 'एक योजना तैयार करना',
      paragraph_one:
        'HOLOCAT: “हैए, ये कैसी जगह है। इस जगह पर कुछ सार्डिन या सूखी मछलियों को रखना बेहतर होगा। मैं कुछ ई-निप के लिए भी समझौता करूँगा।',
      paragraph_two:
        'आप उतरते हैं, अपने आप को स्थिर करते हैं, और प्रवेश के बिंदु की तलाश करते हैं। वहां, उस टूटी हुई खिड़की से बात बन सकती है। आप एक ईंट के साथ खिड़की से जो बचा है उसे बाहर निकालते हैं, और अंदर कूदते हैं। इमारत हजारों धूल भरी, अच्छी तरह से संरक्षित बिटकॉइन खनिकों से भरी हुई है।',
      paragraph_three: {
        a: '—HOLOCAT: “यह कोई गोदाम नहीं है; यह एक संग्रहालय है। मुझे लगता है कि ये Vanderpoole परिवार के पुराने बिटकॉइन माइनिंग उपकरण हैं। बिटकॉइन के शुरुआती दिनों में, माइनर्स सामान्य प्रयोजन वाले कंप्यूटरों का उपयोग करके बिटकॉइन का खनन करते थे। लेकिन कुछ वर्षों बाद, माइनर्स को एहसास हुआ कि वे एक विशेष चिप वाली मशीनों का उपयोग कर सकते हैं, जिन्हें एप्लिकेशन-विशिष्ट इंटीग्रेटेड सर्किट, या ',
        b: ' संक्षेप में कहा जाता है। ये चिप्स केवल एक ही काम करती हैं: बिटकॉइन का खनन। उनका सीमित उद्देश्य उनकी दक्षता बढ़ाता है और माइनर्स को कम ऊर्जा खर्च करने में मदद करता है, जिससे उन्हें बढ़त मिलती है। क्या आप विश्वास कर सकते हैं कि कभी लोग अपने लैपटॉप से बिटकॉइन का खनन करते थे?”',
      },
      paragraph_four: `यह Vanderpoole परिवार के संग्रह में मौजूद सभी मशीनों की व्याख्या करता है।`,
      tooltip_one: {
        question: `ASIC माइनर क्या है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520an%2520ASIC%2520miner%253F`,
        highlighted: `ASIC`,
      },
    },
    intro_two: {
      title: 'एक योजना तैयार करना',
      paragraph_one:
        'कोने में, एक मंद, बमुश्किल काम करने वाला कंप्यूटर मॉनिटर, जिस पर एक नोट चिपका हुआ है, पलक झपकते बैठा है। नोट कहता है "उन्हें चालू करें, बेवकूफ।"',
      paragraph_two: 'होलोकैट: "कितना अशिष्ट है।"',
      paragraph_three:
        'वाह, एक यांत्रिक कीबोर्ड। होलोकैट कीबोर्ड पर कूदता है और उस पर चलता है, आपको दिखाता है कि किस कुंजी को हिट करना है।',
    },
    hashing_one: {
      title: `शून्य`,
      nav_title: `कंप्यूटर चालू होता है`,
      paragraph_one: `या तो संयोग से, या क्योंकि होलोकैट को सच में पता था कि वह क्या कर रही है, जिन बेतरतीब अक्षरों और अंकों पर उसने कदम रखा, वे बदलकर बन जाते हैं... और भी बेतरतीब अक्षर और अंक?`,
      list_one: `> QX23Y6VGECTUKSNIEUTUB[P[pihof`,
      list_two: `> 1c31d1d9fb848a505fc0cdbea848ff1bdd46a9ed4d639d413d3a93035194eedf`,
      paragraph_two: `मॉनिटर पर लिखा आता है: "गलत हैश। फिर से प्रयास करें।"`,
      paragraph_three: `बेशक होलोकैट ने जो भी बकवास टाइप की थी, वह गलत ही थी। आखिर वह सिर्फ़ एक अकड़ू होलोग्राफिक बिल्ली है!`,
      paragraph_four: `अगर आप कुछ अलग टाइप करें तो क्या होगा?`,
    },

    hashing_two: {
      title: `शून्य`,
      nav_title: `कुछ हैश करने की कोशिश करें`,
      heading: `कुछ भी लिखें`,
      return_hash: `नीचे आप देखेंगे कि आपका इनपुट एक हैश में बदल गया है`,
      progress_message: `जारी रखें...`,
      success_message: `ठीक है, अच्छा काम। अब आगे बढ़ते हैं।`,
    },

    hashing_three: {
      title: `शून्य`,
      nav_title: `SHA256 की शक्ति`,
      heading: `क्या आपने हैश के बारे में कुछ खास देखा?`,
      list_one: `उँगलियों के निशान की तरह, हैश भी अद्वितीय होते हैं। कुछ असाधारण परिस्थितियों को छोड़कर, दो अलग-अलग चीज़ों के हैश कभी एक जैसे नहीं होने चाहिए।`,
      list_two: `हैश फ़ंक्शन एकतरफ़ा रास्ते होते हैं। आप किसी हैश को उलटकर यह पता नहीं लगा सकते कि उससे कौन सा डेटा बना था।`,
      list_three: `हैश बेहद भरोसेमंद होते हैं क्योंकि वे निर्धारक होते हैं। इसका मतलब है कि आप एक ही डेटा को बार-बार हैश करेंगे और हर बार वही परिणाम मिलेगा।`,
      paragraph_one: {
        a: `यहाँ उपयोग किया गया फ़ंक्शन कहलाता है `,
        b: `, जो एक बहुत लोकप्रिय विकल्प है।`,
      },
      paragraph_two: `अब देखते हैं कि क्या आप एक विशेष हैश खोज सकते हैं।`,
      paragraph_three: `ऐसा हैश खोजें जो शून्य (“0”) से शुरू होता हो। नीचे अलग-अलग चीज़ें टाइप करते रहें जब तक कि मनचाहा हैश न मिल जाए।`,
      tooltip_one: {
        question: `बिटकॉइन में SHA-256 का उपयोग कैसे किया जाता है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=how%2520is%2520SHA-256%2520used%2520in%2520bitcoin%253F`,
        highlighted: `SHA-256`,
      },
    },

    hashing_four: {
      title: `शून्य`,
      nav_title: `एक शून्य वाला हैश खोजें`,
      heading: `कुछ भी लिखें जब तक कि आपको ऐसा हैश न मिल जाए जो शून्य (“0”) से शुरू होता हो`,
      hint_prompt: `क्या आपको एक <Tooltip id="hint_prompt" position="bottom" theme="bg-[#5e212a]" offset="-1" content="chapter_two.hashing_four.hint_tooltip">संकेत</Tooltip> चाहिए?`,
      hint_tooltip: `<span className="text-m whitespace-nowrap leading-none text-white/50">टाइप करके देखें:</span> <span className="whitespace-nowrap text-white">popcorn</span>`,
    },

    hashing_five: {
      title: `शून्य`,
      nav_title: `थोड़ा और कठिन बनाते हैं`,
      heading: `यह बहुत मुश्किल नहीं था!`,
      paragraph_one: `अब इसे थोड़ा और चुनौतीपूर्ण बनाते हैं। ऐसा हैश खोजने की कोशिश करें जो दो शून्य ("00") से शुरू होता हो।`,
    },

    hashing_six: {
      title: `शून्य`,
      nav_title: `दो शून्य वाला हैश खोजें`,
      heading: `कुछ भी लिखें जब तक कि आपको ऐसा हैश न मिल जाए जो दो शून्य (“00”) से शुरू होता हो`,
      hint_prompt: `क्या आपको एक <Tooltip id="hint_prompt" position="bottom" theme="bg-[#5e212a]" offset="-1" content="chapter_two.hashing_six.hint_tooltip">संकेत</Tooltip> चाहिए?`,
      hint_tooltip: `<span className="text-m whitespace-nowrap leading-none text-white/50">टाइप करके देखें:</span> <span className="whitespace-nowrap text-white">trigonometry</span>`,
    },

    scripting_one: {
      title: 'स्वचालन',
      heading: 'आइए कंप्यूटर को हमारे लिए ऐसा करने दें।',
      paragraph_one:
        'ठीक है, इसमें शायद आपको काफ़ी समय लग गया। अब एक हैश खोजने की कल्पना करें जो पाँच या दस शून्य से शुरू हो। यह वह चुनौती है जो बिटकॉइन नेटवर्क खनिकों के सामने रखता है जब वे लेन-देन के साथ नए ब्लॉक जमा करना चाहते हैं।',
      paragraph_two:
        'खनिक वे सभी सामान लेते हैं जो वे एक ब्लॉक, लेन-देन और संबंधित मेटाडेटा के एक समूह में रखना चाहते हैं, और इसे एक यादृच्छिक संख्या के साथ जोड़ते हैं जिसे नोन्स कहा जाता है। वे ब्लॉक हैश नामक कुछ बनाने के लिए यह सब हैश फ़ंक्शन में भेजते हैं।',
      paragraph_three:
        'बिटकॉइन नेटवर्क को सेट करने में कठिनाई होती है और केवल ब्लॉक हैश स्वीकार करता है जो एक निश्चित संख्या में शून्य से शुरू होता है। हम इसे "डिफीकल्टी" कहते हैं और 2016 के प्रत्येक ब्लॉक में इसका पुनरीक्षण किया जाता है।',
      paragraph_four:
        'अगली चुनौती के लिए, एक स्क्रिप्ट लिखें जो एक हैश ढूंढती है जो पाँच शून्य ("00000") से शुरू होती है।',
    },
    scripting_two: {
      title: `ऑटोमेशन`,
      nav_title: `एक हैश फ़ंक्शन बनाएँ`,
      paragraph_one: `ठीक है, अब अपना खुद का कोड लिखने और चलाने का समय है। एक ऐसा स्क्रिप्ट लिखें जो एक sha256 हैश बनाए जो पाँच शून्य ("00000...") से शुरू होता हो। आपका कोड sha256 फ़ंक्शन को अलग-अलग इनपुट के साथ बार-बार कॉल करता रहे जब तक कि आउटपुट इस शर्त को पूरा न कर ले। अलग-अलग इनपुट पाने के लिए आप एक लूप के अंदर किसी पूर्णांक को बढ़ाते हुए कोशिश कर सकते हैं। क्रिप्टोग्राफी में इस संख्या को अक्सर "नॉन्स" या "number used once" कहा जाता है।`,
      python: {
        paragraph_two: `जब आपको ऐसा नॉन्स मिल जाए जिसका हैश पाँच शून्य से शुरू होता हो, तो उस नॉन्स को फ़ंक्शन से रिटर्न करें। इस फ़ंक्शन को बनाने में आपकी मदद के लिए हम Python की hashlib लाइब्रेरी का उपयोग कर रहे हैं। आवश्यकता होने पर आप नीचे दिए गए बाहरी संसाधनों की मदद ले सकते हैं:`,
        list_one: `<Link href="https://docs.python.org/3/library/hashlib.html" target="_blank" className="underline">hashlib दस्तावेज़ीकरण</Link>`,
        list_two: `<Link href="https://datagy.io/python-sha256/" target="_blank" className="underline">Python फ़ंक्शन ट्यूटोरियल</Link>`,
      },
      javascript: {
        paragraph_two: `जब आपको ऐसा नॉन्स मिल जाए जिसका हैश पाँच शून्य से शुरू होता हो, तो उस नॉन्स को फ़ंक्शन से रिटर्न करें। इस फ़ंक्शन को बनाने में आपकी मदद के लिए हम JavaScript की crypto लाइब्रेरी का उपयोग कर रहे हैं। आवश्यकता होने पर आप नीचे दिए गए बाहरी संसाधनों की मदद ले सकते हैं:`,
        list_one: `<Link href="https://www.geeksforgeeks.org/node-js-crypto-createhash-method/" target="_blank" className="underline">crypto दस्तावेज़ीकरण</Link>`,
        list_two: `<Link href="https://www.educative.io/answers/what-is-node-cryptocreatehashalgorithm-options" target="_blank" className="underline">JavaScript फ़ंक्शन ट्यूटोरियल</Link>`,
      },
    },

    mining_one: {
      title: `खदान में प्रवेश`,
      nav_title: `ब्लॉकों का खनन`,
      heading_one: `अब जब हमें पता है कि खनन कैसे काम करता है, तो चलिए इसे व्यवहार में देखते हैं`,
      heading_two: `अब आप खनन कर रहे हैं`,
      heading_three: `अच्छा काम!`,
      heading_four: `चलो 100 ब्लॉकों तक पहुँचते हैं`,
      heading_five: `आपने कर दिखाया!`,
      paragraph_one: `इस समय, बिटकॉइन नेटवर्क के लिए आवश्यक है कि ब्लॉकों का हैश दस शुरुआती शून्य से शुरू हो। चलिए शुरू करते हैं!`,
      paragraph_two: `इस सरल सिमुलेशन के लिए, हम यह मान लेते हैं कि प्रत्येक ब्लॉक में 3,500 लेन-देन और 0.061 BTC का इनाम और शुल्क शामिल है।`,
      paragraph_two_one: `देखिए क्या आप माइनर्स को चालू कर सकते हैं।`,
      paragraph_three: `पिछले पाठ में आपने जो कोड लिखा था, जो बार-बार हैश की गणना करता है, वह अब चल रहा है।`,
      paragraph_four: `यह तब रुक जाएगा जब इसे दस शुरुआती शून्य वाला हैश मिल जाएगा।`,
      paragraph_five: `क्या आप नॉन्स फ़ील्ड को बढ़ते हुए देख रहे हैं? यह बताता है कि अब तक आपने कितने हैश आज़माए हैं!`,
      paragraph_six: `निम्नलिखित नॉन्स के साथ:`,
      paragraph_seven: `परिणामी हैश है:`,
      paragraph_eight: `इसमें वे दस शुरुआती शून्य हैं जिनकी सभी नए ब्लॉकों को आवश्यकता होती है। चलिए कुछ और ब्लॉकों का खनन करते हैं।`,
      paragraph_eight_one: `माइनर्स को फिर से चालू करें।`,
      paragraph_nine: `इसमें कुछ समय लग सकता है। लेकिन यह आपको दिखाता है कि ब्लॉकों का खनन करना और लेन-देन की पुष्टि करना कितना कठिन है।`,
      paragraph_ten: `वाह! इतनी सारी हैश गणनाएँ करने में काफ़ी कंप्यूटिंग शक्ति लगी। ज़रा देखिए कितने नॉन्स आज़माए गए! इसमें हैश पावर में बढ़ोतरी बहुत मददगार रही, यानी आपके कंप्यूटर द्वारा प्रति सेकंड आज़माए जा सकने वाले हैश की संख्या।`,
      paragraph_eleven: `जैसा कि अपेक्षित था, चूँकि प्रत्येक ब्लॉक में 3,500 लेन-देन होते हैं, इसलिए खनन किए गए 100 ब्लॉकों द्वारा कुल 350,000 लेन-देन की पुष्टि की गई है।`,
      paragraph_twelve: `और लगता है कि इस सारे खनन के लिए आपको एक अच्छा इनाम भी मिला है! ब्लॉक सब्सिडी के अलावा—जो नेटवर्क प्रत्येक ब्लॉक के लिए देता है—आपने लेन-देन शुल्क के रूप में अतिरिक्त आय भी अर्जित की है।`,
      paragraph_thirteen: `याद रखें, यह सिर्फ़ एक सिमुलेशन था। वास्तविकता में प्रत्येक ब्लॉक को औसतन 10 मिनट लगते हैं।`,
      paragraph_fourteen: `साथ ही, यदि हम वास्तव में वर्तमान मेननेट पर खनन कर रहे होते, तो इन ब्लॉकों को खनन करने के लिए कहीं अधिक कंप्यूटिंग शक्ति की आवश्यकता होती।`,
      progress_bar_title: `मिले हुए ब्लॉक`,
      progress_bar_one: `नॉन्स`,
      progress_bar_two: `प्रति सेकंड हैश`,
      progress_bar_three: `पुष्ट किए गए लेन-देन`,
      progress_bar_four: `कमाया गया बिटकॉइन`,
      button_hash: `10x हैश पावर, कृपया`,
      ten_x_hint: `हैशिंग तेज़ करने के लिए 100x बटन दबाएँ!`,
    },

    outro_one: {
      title: `समापन`,
      nav_title: `अध्याय पूर्ण`,
      heading: `शानदार काम!`,
      paragraph_one: `मशीनें गड़गड़ाकर चालू हो जाती हैं। सब कुछ सही तरह से काम करता हुआ लगता है। पुराने मॉनिटर पर एक नक्शा दिखाई देता है, जो दुनिया भर में फैले उन अन्य गोदामों के स्थान दिखाता है जहाँ Vanderpoole परिवार के पुराने माइनिंग उपकरण मौजूद हैं और अब सक्रिय हो चुके हैं। लगता है कि खनन चुनौती पूरी करने पर वे सक्रिय हो गए!`,
      paragraph_two: `—HOLOCAT: “देखो, वहाँ एक संदेश है।”`,
      paragraph_three: `“अच्छा काम। इससे बिटकॉइन को हर दस मिनट में एक ब्लॉक पर वापस लाने में मदद मिलेगी।” – सातोशी नाकामोटो`,
      paragraph_four: `फिर वही?`,
      button_text: 'अध्याय 2 समाप्त',
    },

    resources: {
      hashing_two: {
        hash_functions_heading: `हैश फ़ंक्शन`,
        hash_functions_paragraph: `हैश फ़ंक्शन कोई भी ऐसा फ़ंक्शन होता है जो किसी भी आकार के डेटा को एक निश्चित आकार के मान में बदल सकता है। हैश फ़ंक्शन द्वारा लौटाए गए मानों को हैश मान, हैश कोड, डाइजेस्ट या सरल रूप में हैश कहा जाता है। इन मानों का उपयोग आमतौर पर एक निश्चित आकार की तालिका, जिसे हैश टेबल कहते हैं, को इंडेक्स करने के लिए किया जाता है। हैश फ़ंक्शन का उपयोग करके हैश टेबल को इंडेक्स करने की प्रक्रिया को हैशिंग या स्कैटर स्टोरेज एड्रेसिंग कहा जाता है।`,
        tip: `बस टाइप करते रहें! SHA-256 एल्गोरिदम के कारण हर नया इनपुट एक पूरी तरह से यादृच्छिक हैश उत्पन्न करेगा, भले ही इनपुट बहुत समान हों।`,
        spoiler: `8 अक्षरों वाली कोई चीज़ आज़माएँ।`,
      },

      hashing_four: {
        power_of_random_heading: `यादृच्छिकता की शक्ति`,
        power_of_random_paragraph: `पूरी तरह यादृच्छिक स्थिति की तरह, संभावना के लिहाज़ से SHA-256 हैश फ़ंक्शन हर नए डेटा जोड़ने पर पूरी तरह यादृच्छिक होता है। यदि आप उपन्यास 'War and Peace' को हैश करें और फिर उसमें केवल एक अतिरिक्त अक्षर जोड़ दें, तो परिणामस्वरूप हैश पूरी तरह बदल जाएगा। प्रत्येक नया अक्षर हैश को पूरी तरह यादृच्छिक तरीके से बदल देता है। यह देखते हुए कि हेक्साडेसिमल प्रणाली में 16 संभावित अक्षर होते हैं (0-9 और a-f), '0' से शुरू होने वाला हैश मिलने की संभावना कितनी है?`,
        tip: `क्या आप गणना कर सकते हैं? प्रति अंक 16 संभावित अक्षरों के आधार पर, आपके अनुसार '00' से शुरू होने वाला हैश मिलने की कितनी संभावना है? और '000' का क्या?`,
        spoiler: `अक्षर 's' से शुरू होने वाली कोई चीज़ आज़माएँ।`,
      },

      hashing_six: {
        collision_resistance_heading: `SHA256 और टकराव प्रतिरोध`,
        collision_resistance_paragraph: `SHA-256 एक 256-बिट (64-अक्षर) का हैश मान लौटाता है, जो इनपुट डेटा का एक अद्वितीय प्रतिनिधित्व होता है। यह Merkle–Damgård संरचना पर आधारित हैश फ़ंक्शनों के परिवार से संबंधित है, जो सरल संपीड़न फ़ंक्शनों से हैश फ़ंक्शन बनाने की एक विधि है। इस संरचना में, इनपुट संदेश को निश्चित आकार के ब्लॉकों में विभाजित किया जाता है और एक चेनिंग तंत्र के माध्यम से इन ब्लॉकों को क्रमिक रूप से संसाधित किया जाता है। यह प्रक्रिया तब तक चलती है जब तक पूरा संदेश संसाधित न हो जाए और अंतिम हैश मान प्राप्त न हो जाए। SHA-256 की मज़बूत सुरक्षा विशेषताएँ और टकराव प्रतिरोध इसे आधुनिक क्रिप्टोग्राफी में डेटा अखंडता और प्रमाणीकरण का एक महत्वपूर्ण आधार बनाते हैं।`,
        tip: `इस पाठ में कोई विशेष सुझाव नहीं है। जैसे-जैसे आप Saving Satoshi में आगे बढ़ेंगे, आप पाएँगे कि हम आपकी मदद कम करते जाते हैं और आपको स्वयं समाधान खोजने देते हैं।`,
        spoiler: `यह जानते हुए कि हर नया अक्षर एक पूरी तरह यादृच्छिक हैश की पुनर्गणना करता है, आप नए अक्षर जोड़ते रह सकते हैं जब तक कि हैश '00' या उससे अधिक से शुरू न हो जाए… या फिर 'trigonometry' शब्द आज़मा सकते हैं।`,
      },

      scripting_one: {
        hash_libraries_heading: `हैश फ़ंक्शन`,
        hash_libraries_paragraph: `Node.js की crypto लाइब्रेरी और Python की hashlib लाइब्रेरी वे कोड लाइब्रेरीज़ हैं जो उन एल्गोरिदम को लागू करती हैं जिन्हें हम डेवलपर्स के लिए उपयोगी टूल के रूप में इस्तेमाल करते हैं। इन लाइब्रेरीज़ की गहन जाँच की जाती है ताकि उनकी शुद्धता और सुरक्षा सुनिश्चित की जा सके, क्योंकि कई लोग इन पर मूल्यवान और महत्वपूर्ण प्रणालियों को सुरक्षित रखने के लिए निर्भर करते हैं।`,
        nonce_heading: `नॉन्स`,
        nonce_paragraph: `नॉन्स, जिसका पूरा नाम “number used once” है, एक यादृच्छिक या अर्ध-यादृच्छिक संख्या होती है जिसका उपयोग विभिन्न क्रिप्टोग्राफ़िक और संगणनात्मक प्रक्रियाओं में किया जाता है। इसका मुख्य उद्देश्य अप्रत्याशितता जोड़ना और यह सुनिश्चित करना है कि किसी विशेष प्रक्रिया या गणना को आसानी से दोहराया या अनुमानित न किया जा सके। बिटकॉइन खनन की सुरक्षा में नॉन्स की भूमिका बेहद महत्वपूर्ण है, लेकिन इसके बारे में हम आगे और जानेंगे...`,
        tip_one: `सुनिश्चित करें कि आप इनपुट को सही तरीके से डिकोड कर रहे हैं। हैशिंग एल्गोरिदम अक्सर बाइट्स में डिकोड किए गए ऑब्जेक्ट लौटाते हैं, लेकिन हमें उन्हें हेक्स प्रारूप में पढ़ने योग्य बनाना होता है!`,
        tip_two: `सोचिए कि आप ऐसा फ़ंक्शन कैसे बनाएँगे जो तब तक चलता रहे जब तक उत्तर किसी निश्चित मान के बराबर न हो जाए।`,
        tip_three: `याद रखें कि अपने उत्तर को <span className="p-1 font-mono bg-[#0000004D] m-1">console.log()</span> या <span className="p-1 font-mono bg-[#0000004D] m-1">print()</span> के साथ लॉग करें। यही एक तरीका है जिससे हमारा IDE आपके उत्तर को मान्य करने की कोशिश करेगा।`,
      },

      mining_one: {
        mining_heading: `खनन`,
        mining_paragraph: `खनन वह प्रक्रिया है जहाँ ये सभी अवधारणाएँ एक साथ आती हैं। बिटकॉइन खनन वह प्रक्रिया है जिसके द्वारा नए बिटकॉइन बनाए जाते हैं और लेन-देन को ब्लॉकचेन में जोड़ा जाता है। माइनर्स प्रत्येक ब्लॉक के लेन-देन में एक अद्वितीय और मान्य ‘नॉन्स’ खोजकर जटिल गणितीय पहेलियाँ हल करने के लिए प्रतिस्पर्धा करते हैं। यह प्रूफ़-ऑफ़-वर्क प्रक्रिया काफ़ी अधिक कंप्यूटिंग शक्ति और ऊर्जा की माँग करती है, जिससे यह लेन-देन को मान्य करने का एक सुरक्षित और विकेंद्रीकृत तरीका बनती है। सफल माइनर्स को नए बनाए गए बिटकॉइन और लेन-देन शुल्क के रूप में इनाम मिलता है, और वे बिटकॉइन नेटवर्क की अखंडता बनाए रखने में महत्वपूर्ण भूमिका निभाते हैं।`,
        difficulty_heading: `कठिनाई`,
        difficulty_paragraph: `खनन की कठिनाई यह सुनिश्चित करती है कि प्रत्येक नए ब्लॉक के बीच औसतन 10 मिनट का समय बना रहे।`,
        spoiler: `यहाँ कुछ भी छिपाने जैसा नहीं है! बस आगे बढ़ें और इस पाठ को पढ़ें। भविष्य के पाठों में आपको अपने खनन ज्ञान को दिखाने के और भी अवसर मिलेंगे!`,
      },
    },
  },
  chapter_three: {
    title: 'अपने पुरस्कारों का दावा करना',
    paragraph_one:
      'हूफ, वह करीब था। आप अभी भी अमेस्ट्रिस के खिलाफ अपनी लड़ाई से काँप रहे हैं, फिर भी राहत मिली है कि एक जीत संभव थी।',
    paragraph_two:
      'जैसे ही आप अपनी डेस्क पर बैठते हैं, आप एक गहरी सांस लेते हैं और दिन की घटनाओं को फिर से चलाने के लिए आगे बढ़ते हैं। आपके हाथ खुद को रहस्यमय लिफाफे के साथ खेलने में व्यस्त रखते हैं, क्योंकि आपको आश्चर्य होता है कि इसे किसने भेजा है। जो अभी भी वैसे भी लिफाफों का उपयोग करता है, यह 2139 है। इससे भी अधिक उत्सुकता यह है कि इस पर 2008 से एक मोहर है... क्या यह एक और संकेत हो सकता है?',
    paragraph_three:
      'अचानक, आपको एहसास होता है कि आपने एमेस्ट्रिस के साथ अपनी प्रतिस्पर्धा से कभी भी ब्लॉक पुरस्कार का दावा नहीं किया। आपका बिटकॉइन वॉलेट कम चल रहा है, इसलिए अब इसे फिर से टॉप अप करने का अच्छा समय है।',
    paragraph_four: `यह महज संयोग नहीं है।`,

    intro_one: {
      title: `परिचय`,
      nav_title: `हैशिंग पर चर्चा`,
      paragraph_one: `—सातोशी नाकामोटो: “अरे, तुम! हाँ, तुम ही! मुझे याद है? इस समय बिटकॉइन पर 51% अटैक हो रहा है! जब तुमने उन माइनिंग डिवाइसेज़ को ऑनलाइन किया, वैंडरपूल ने BitRey के ASICs फिर से चालू कर दिए और खाली ब्लॉक्स माइन कर रहा है। समस्या सिर्फ उसकी मशीनें नहीं हैं। उसने स्टैंडर्ड ASIC फर्मवेयर में एक बैकडोर का इस्तेमाल करके मौजूदा माइनर्स को एक वायरस से संक्रमित कर दिया है, जो उन्हें खाली ब्लॉक्स के अलावा कुछ भी माइन करने से रोकता है। वह बिटकॉइन इकोसिस्टम को बंधक बनाने और लोगों को बिटकॉइन की सप्लाई बढ़ाने के विचार का समर्थन करने के लिए मजबूर करने की कोशिश कर रहा है। कुछ करो, डिंगडोंग!”`,
      paragraph_two: `पुराना कंप्यूटर खाँसते हुए धूल का गुबार छोड़ता है, फिर “स्प्रेडशीट” नाम का डेटा का एक पुलिंदा निकालता है, जिसमें कुछ सबसे बड़े बिटकॉइन माइनर्स की संपर्क जानकारी है, साथ ही वायरस के लिए एक पैच भी है। जितनी जल्दी तुम यह पैच दूसरे माइनर्स तक पहुँचा सकोगे, उतनी जल्दी वे अपनी मशीनों पर फिर से नियंत्रण पा सकेंगे और BitRey के खिलाफ तुम्हारी लड़ाई में शामिल हो सकेंगे।`,
      paragraph_three: `—HOLOCAT: “हमें और काम करना है। खैर, तुम्हें करना है। मैं दीवारों के आर-पार दौड़ने और चूहों को डराने जा रहा हूँ।”`,
    },

    solo_one: {
      title: `तुम बनाम BitRey`,
      nav_title: `अकेले माइनिंग`,
      step_zero_heading: `चलो इसे आज़माते हैं`,
      step_zero_paragraph_one: `जिन माइनर्स से तुमने संपर्क किया है, उनके इंतज़ार के दौरान तुम यह देखने का फैसला करते हो कि क्या BitRey को अकेले रोका जा सकता है। शायद बिना किसी मदद के ही खाली ब्लॉक्स को खत्म किया जा सके। यहाँ यह दिखाया गया है कि तुम्हारी हैशरेट कैसी है। तुम्हें क्या लगता है, यह कैसे जाएगा?`,
      step_one_heading: `दौड़ शुरू`,
      step_one_paragraph_one: `अब हम 100 ब्लॉक्स माइन कर रहे हैं यह देखने के लिए कि BitRey के मुकाबले तुम कितने ब्लॉक्स जमा कर पाते हो।`,
      step_two_heading: `यह अच्छा नहीं रहा!`,
      step_two_paragraph_one: `अरे बाप रे, हमारे पास BitRey और वायरस-नियंत्रित माइनर्स से मुकाबला करने के लिए पर्याप्त हैशपावर नहीं है। चलो देखते हैं कि क्या दूसरे माइनर्स के साथ मिलकर अगले 100 ब्लॉक्स में BitRey को हराया जा सकता है। बिटकॉइन एक सदी से भी ज़्यादा समय से चल रहा है और बिना लड़े हार नहीं मानेगा।`,
    },

    pool_one: {
      title: `पूल बनाम BitRey`,
      nav_title: `दोस्त ढूँढना`,
      waiting_screen_heading: `हमें समर्थन चाहिए!`,
      waiting_screen_paragraph_one: `वेयरहाउस में मौजूद तुम्हारे माइनर्स का कोई मौका नहीं है। अगर तुम अपनी हैश पावर को दूसरे माइनर्स के साथ जोड़ो, तो शायद BitRey के हमले के खिलाफ मोर्चा संभाल सको।`,
      waiting_screen_paragraph_two: `चलो तब तक इंतज़ार करें जब तक बाकी लोग तुम्हारे उद्देश्य में शामिल न हो जाएँ, ताकि हम ताकत जोड़ सकें।`,
      waiting_button: `इंतज़ार...`,
      continue_button: `चलो शुरू करें`,
    },

    pool_two: {
      title: `पूल बनाम BitRey`,
      nav_title: `साथ मिलकर माइनिंग`,
      step_zero_heading: `चलो चलते हैं`,
      step_zero_paragraph_one: `दूसरे माइनर्स के साथ अपनी हैशरेट को मिलाकर, क्या तुम BitRey का सामना कर सकते हो?`,
      step_two_heading: `एक और हार!`,
      step_two_paragraph_one: `कुछ गड़बड़ है। सिर्फ Hashrate Hoppers ने ही ब्लॉक्स पाए। तुम्हें क्या लगता है, ऐसा क्यों हुआ?`,
    },

    coop_one: {
      title: `कोऑप बनाम BitRey`,
      nav_title: `कुछ गलत हो गया`,
      heading: `अभी भी कुछ ठीक नहीं है।`,
      paragraph_one: `Hashrate Hoppers, जिसके पास सबसे ज़्यादा हैश पावर है, सारे ब्लॉक्स पा रहा है लेकिन बाकी किसी को कुछ नहीं मिल रहा।`,
      paragraph_two: `समस्या यह है कि माइनिंग के दौरान सभी एक ही नॉन्स चेक कर रहे हैं। तुम बेहतर तालमेल कैसे बना सकते हो?`,
      paragraph_three: `तुम यह तय करते हो कि हर एक के लिए ब्लॉक डेटा तैयार करते समय “extraNonce” में एक यूनिक आइडेंटिफ़ायर डाला जाए, ताकि दोहराव वाली मेहनत से बचा जा सके।`,
    },

    coop_two: {
      title: `कोऑप बनाम BitRey`,
      nav_title: `extraNonce`,
      heading: `extraNonce क्या है?`,
      paragraph_one: `Stratum माइनिंग पूल प्रोटोकॉल (बिटकॉइन प्रोटोकॉल नहीं) में, कॉइनबेस ट्रांज़ैक्शन में “extra nonce” नाम की एक चीज़ भी होती है। माइनर्स को ब्लॉक डेटा देते समय, माइनिंग पूल extra nonce को दो हिस्सों में बाँट देते हैं: “extranonce1” और “extranonce2”。`,
      paragraph_two: `extra nonce को दो हिस्सों में बाँटने के कई फायदे हैं:`,
      list_one: `यह पूल के प्रतिभागियों को एक ही काम करने से रोकता है।`,
      list_two: `यह पूल को सभी माइनर्स को एक ही ट्रांज़ैक्शन लिस्ट भेजने की अनुमति देता है जो साथ में पूल कर रहे हैं। इसका मतलब है कि माइनर्स को सिर्फ “extranonce2” अपडेट करना होता है और ब्लॉक में शामिल ट्रांज़ैक्शनों को बदलने की ज़रूरत नहीं होती।`,
      list_three: `“extranonce1” पूल को शेयर योगदान की पहचान और निर्धारण करने की अनुमति देता है क्योंकि हर माइनर को उसका अपना “extranonce1” मिलता है।`,
      paragraph_three: `जो माइनर्स पूल में योगदान देते हैं, वे “extranonce2” अपडेट करते हैं और ब्लॉक हेडर में नॉन्स के ज़रिए चक्र करते हैं। अगर उन्हें समाधान नहीं मिलता, तो वे अलग “extranonce2” के साथ प्रक्रिया दोहराते हैं जब तक समाधान न मिल जाए।`,
      paragraph_four: `चलो इस तरीके से काम बाँटकर फिर से कोशिश करते हैं।`,
    },

    coop_three: {
      title: `कोऑप बनाम BitRey`,
      nav_title: `टीमवर्क के साथ माइनिंग`,
      step_zero_heading: `एक बार और...`,
      step_zero_paragraph_one: `चलो देखते हैं कि नॉन्स स्पेस को बाँटने की हमारी बेहतर रणनीति के साथ अब हमारे पास BitRey के खिलाफ कोई मौका है या नहीं।`,
      step_two_heading: `तुमने कर दिखाया!`,
      step_two_paragraph_one: `तुम और बाकी माइनर्स ने मिलकर BitRey की नेटवर्क पर कब्ज़ा करने की कोशिश को रोक दिया।`,
    },

    split_one: {
      title: `रिवॉर्ड बाँटना`,
      nav_title: `न्यायसंगत हिस्से का बँटवारा`,
      heading: `बहुत बढ़िया।`,
      paragraph_one: `तुमने न सिर्फ BitRey के खिलाफ नेटवर्क की रक्षा की, बल्कि इनाम के तौर पर बिटकॉइन भी कमाए!`,
      paragraph_two: `हर माइन किए गए ब्लॉक के लिए माइनर को बिटकॉइन में इनाम मिलता है। अगर एक से ज़्यादा लोगों ने ब्लॉक पर काम किया, तो माइनर्स के समूह (माइनिंग पूल) को साझा करने के लिए इनाम मिलता है।`,
      paragraph_three: `यह इनाम दो चीज़ों से मिलकर बनता है:`,
      list_one: `ब्लॉक में शामिल सभी ट्रांज़ैक्शनों की फीस`,
      list_two: `ब्लॉक सब्सिडी`,
      paragraph_four: `तुम और तुम्हारे माइनर दोस्तों ने कुल 7.41 बिटकॉइन कमाए हैं और इसे बाँटने का अच्छा तरीका ढूँढ रहे हो। इसे इस आधार पर बाँटा जाना चाहिए कि हर किसी ने कितना काम किया।`,
      paragraph_five: `माइनिंग पूल इसे इस तरह हल करते हैं कि वे यह ट्रैक करते हैं कि हर माइनर ने कितने आंशिक समाधान (partial solutions) बनाए हैं। एक पूल हर माइनर को उसकी हैश पावर के आधार पर एक न्यूनतम कठिनाई (ब्लॉक कठिनाई से कम) असाइन करता है। हर कुछ सेकंड में एक माइनर इन आसान समाधानों में से एक ढूँढ लेता है और पूल को सूचित करता है। फिर पूल सभी सबमिट किए गए शेयरों को ट्रैक करता है और उसी के अनुसार ब्लॉक रिवॉर्ड बाँटता है।`,
      paragraph_six: `चलो इसे काम करते हुए देखते हैं।`,
    },

    split_two: {
      title: `रिवॉर्ड बाँटना`,
      nav_title: `रिवॉर्ड की गणना`,
      step_zero_heading: `सबके प्रयासों की समीक्षा करें`,
      step_zero_paragraph: `हम लड़ाई को फिर से चलाएँगे। इस बार हम सिर्फ अपने पूल पर ध्यान देंगे, खासकर इस पर कि हर माइनर ने कितने आंशिक समाधान पाए।`,
      step_two_heading: `चलो गणित करें`,
      step_two_paragraph: `ऊपर दिए गए आँकड़ों को देखो और सोचो कि रिवॉर्ड को बाँटने का एक निष्पक्ष तरीका क्या हो सकता है। समझ गए? चलो इसे चरण दर चरण देखते हैं।`,
      step_three_heading: `हैशरेट प्रतिशत`,
      step_three_paragraph: `जैसा कि तुम जानते हो, यह दर्शाता है कि हर माइनर ने ब्लॉक्स खोजने में कितना काम किया है। लेकिन माइनिंग पूल के पास इस संख्या को जानने या मापने का कोई तरीका नहीं होता, क्योंकि माइनर्स सिर्फ सफल समाधान ही भेजते हैं।`,
      step_four_heading: `ब्लॉक मिलने का प्रतिशत`,
      step_four_paragraph: `ब्लॉक मिलने की संभावना बहुत कम होती है क्योंकि इसमें किस्मत का बड़ा हाथ होता है। खासकर ऐसे परिदृश्यों में जहाँ कुछ बेहद शक्तिशाली माइनर्स हों, बहुत छोटे माइनर्स काम तो कर सकते हैं लेकिन कभी भी कोई ब्लॉक न पाएँ।`,
      step_five_heading: `आंशिक समाधान प्रतिशत`,
      step_five_paragraph: `अब यह संख्या काम आती है। माइनर्स इन आसान समस्याओं के समाधान नियमित रूप से पूल को रिपोर्ट करते हैं। इससे पूल को यह काफ़ी सटीक रूप से मापने में मदद मिलती है कि हर माइनर ने कितना काम किया है।`,
      step_six_heading: `रिवॉर्ड बाँटना`,
      step_six_paragraph: `अब हम 7.41 बिटकॉइन के रिवॉर्ड को हर पूल के आंशिक समाधानों के प्रतिशत के अनुसार बाँट सकते हैं। बधाई हो!`,
    },

    outro_one: {
      title: `आउट्रो`,
      nav_title: `अध्याय पूरा`,
      heading: `ये लो, वैंडरपूल!`,
      paragraph_one: `शानदार काम! तुम और बाकी माइनर्स ने अपने संसाधनों को एकजुट करके वैंडरपूल के 51% अटैक को रोक दिया। अब खाली ब्लॉक्स सबमिट नहीं हो रहे हैं और लगता है उसने हार मान ली है।`,
      paragraph_two: `अब अपने इनाम लेने का समय है! अपने बिटकॉइन निकालने के लिए अगले अध्याय में जाओ।`,
    },
    resources: {
      solo: {
        hashrate_heading: `माइनिंग हैशरेट`,
        hashrate_paragraph: `किसी व्यक्तिगत माइनर की हैशरेट उस कम्प्यूटेशनल शक्ति को दर्शाती है जो वह बिटकॉइन नेटवर्क की माइनिंग प्रक्रिया में योगदान देता है। यह वह दर है जिस पर उसका माइनिंग हार्डवेयर नए ब्लॉक्स माइन करने के लिए ज़रूरी गणितीय गणनाएँ कर सकता है। किसी व्यक्तिगत माइनर की हैशरेट आमतौर पर हैश प्रति सेकंड में मापी जाती है, या बड़े पैमाने पर टेराहैश में, यानी प्रति सेकंड एक ट्रिलियन हैश (TH/s), जो उसके माइनिंग ऑपरेशन के पैमाने और हार्डवेयर की क्षमताओं पर निर्भर करता है।`,
      },
      pool: {
        pool_heading: `माइनिंग पूल`,
        pool_paragraph: `क्रिप्टोकरेंसी माइनिंग में माइनिंग पूल एक महत्वपूर्ण भूमिका निभाता है और व्यक्तिगत माइनर्स को कई प्रमुख लाभ प्रदान करता है। कई प्रतिभागियों की कम्प्यूटेशनल शक्ति और संसाधनों को एक साथ जोड़कर, माइनिंग पूल नए ब्लॉक्स को सफलतापूर्वक माइन करने की संभावना बढ़ाते हैं, जिससे कमाई ज़्यादा अनुमानित और स्थिर होती है। ये माइनर्स को उन्नत माइनिंग उपकरण और विशेषज्ञ सहायता तक पहुँच भी प्रदान करते हैं, जिससे प्रवेश की बाधाएँ कम होती हैं और मैदान बराबर होता है। इसके अलावा, माइनिंग पूल रिवॉर्ड को कुशलता से वितरित करने में मदद करते हैं, यह सुनिश्चित करते हुए कि माइनर्स को उनके योगदान के लिए उनका उचित हिस्सा मिले, जिससे क्रिप्टोकरेंसी माइनिंग एक व्यापक समुदाय के लिए सुलभ, स्थिर और आर्थिक रूप से लाभदायक बनती है।`,
      },
      coop: {
        distribution_heading: `कार्य वितरण`,
        distribution_paragraph: `माइनिंग पूल यह सुनिश्चित करने के लिए सावधानियाँ बरतते हैं कि उनके प्रतिभागी एक ही ब्लॉक के लिए एक ही नॉन्स माइन न करें। यह महत्वपूर्ण है क्योंकि बिटकॉइन माइनिंग प्रक्रिया में, माइनर्स एक वैध ब्लॉक देने वाले नॉन्स को खोजने के लिए प्रतिस्पर्धा करते हैं। अगर एक ही पूल के दो माइनर्स एक ही समय पर एक ही नॉन्स पर काम करें, तो यह अक्षम होगा और केवल एक को ही ब्लॉक रिवॉर्ड मिलेगा। इसे रोकने के लिए, माइनिंग पूल 'वर्क असाइनमेंट' या 'जॉब डिस्ट्रीब्यूशन' नामक प्रक्रिया का उपयोग करते हैं ताकि काम को कुशलता से बाँटा जा सके। माइनिंग पूल व्यक्तिगत माइनर्स या प्रतिभागियों को काम वितरित करते हैं। जब किसी नए ब्लॉक को माइन करने की आवश्यकता होती है, तो पूल का सर्वर (या पूल ऑपरेटर) माइनर्स के लिए एक यूनिक 'जॉब' बनाता है। इस जॉब में ब्लॉक माइन करने के लिए ज़रूरी सारी जानकारी होती है, जैसे अपुष्ट ट्रांज़ैक्शनों की मौजूदा सूची, पिछले ब्लॉक का हेडर, और लक्षित कठिनाई।`,
        shares_heading: `शेयर सबमिट करना`,
        shares_paragraph: `माइनर्स इन असाइन किए गए जॉब्स पर काम करते हैं और लगातार सही नॉन्स खोजने की कोशिश करते हैं। जब किसी माइनर को लगता है कि उसे समाधान मिल गया है, तो वह पूल सर्वर को 'शेयर' नाम की चीज़ सबमिट करता है। यह शेयर यह दर्शाता है कि माइनर सक्रिय रूप से समस्या को हल करने पर काम कर रहा है। शेयर वास्तविक समाधान की तुलना में बहुत आसानी से मिल जाते हैं, लेकिन वे माइनर के प्रयासों के प्रमाण के रूप में काम करते हैं।`,
      },
      split: {
        payout_heading: `पेआउट योजनाएँ`,
        payout_subheading: `एक माइनिंग पूल ब्लॉक रिवॉर्ड को कई तरीकों से वितरित कर सकता है, जिनमें कुछ सूक्ष्म लेकिन महत्वपूर्ण अंतर होते हैं:`,
        pps_heading: `पे-पर-शेयर (PPS)`,
        pps_paragraph: `PPS में, माइनर्स को हर वैध शेयर के लिए एक निश्चित भुगतान मिलता है, भले ही पूल सफलतापूर्वक ब्लॉक माइन करे या नहीं। यह सिस्टम माइनर्स को स्थिर और अनुमानित आय प्रदान करता है, जिससे यह उन लोगों के लिए पसंदीदा विकल्प बन जाता है जो अपनी कमाई में निरंतरता को महत्व देते हैं। PPS रिवॉर्ड में उतार-चढ़ाव को कम करता है, क्योंकि माइनर्स को प्रति-शेयर आधार पर भुगतान किया जाता है, जिससे अस्थिर क्रिप्टोकरेंसी माइनिंग की दुनिया में आय का एक भरोसेमंद स्रोत मिलता है। हालाँकि, अगर पूल सफलतापूर्वक ब्लॉक माइन नहीं करता है, तो PPS माइनर की कमाई से एक शुल्क काट सकता है। यह शुल्क संचालन लागत को कवर करने और उस स्थिति में पूल ऑपरेटर के जोखिम को कम करने के लिए होता है जब एक निश्चित समयावधि में कोई ब्लॉक माइन न हो। पारंपरिक PPS में, जब पूल को कठिनाइयों का सामना करना पड़ता है, तो माइनर्स को कम भुगतान मिलता है।`,
        pplns_heading: `पे-पर-लास्ट-N-शेयर (PPLNS)`,
        pplns_paragraph: `PPLNS पिछले N शेयरों की एक निश्चित विंडो में माइनर के योगदान को ध्यान में रखता है। माइनर्स को उस विंडो के भीतर उनके द्वारा सबमिट किए गए शेयरों की संख्या और कठिनाई के आधार पर भुगतान किया जाता है। PPLNS माइनर्स को पूल में सक्रिय रहने के लिए प्रोत्साहित करता है, क्योंकि यह निरंतर भागीदारी को पुरस्कृत करता है और पूल-हॉपिंग रणनीतियों के जोखिम को कम करने में मदद करता है। जब पूल सफलतापूर्वक ब्लॉक माइन करता है, तो माइनर्स को भुगतान मिलता है, और रिवॉर्ड उनके हालिया योगदान के अनुपात में वितरित किए जाते हैं, जिससे माइनिंग इकोसिस्टम में कमाई का एक निष्पक्ष और प्रदर्शन-आधारित तरीका मिलता है।`,
        pps_plus_heading: `पे-पर-शेयर + (PPS+)`,
        pps_plus_paragraph: `PPS+ माइनर्स को पूल की माइनिंग कोशिशों में उनके द्वारा दिए गए हर शेयर के लिए एक निश्चित भुगतान प्रदान करता है। हालाँकि, PPS+ में आमतौर पर पूल की स्थिरता और विश्वसनीयता में योगदान देने वाले माइनर्स के लिए एक अतिरिक्त बोनस या प्रीमियम शामिल होता है। यह बोनस माइनर्स को पूल में सक्रिय रहने और दीर्घकालिक भागीदारी को बढ़ावा देने के लिए बनाया गया है। PPS+ माइनर्स को स्थिर और अनुमानित आय देता है, जबकि अतिरिक्त बोनस इसे उन लोगों के लिए आकर्षक विकल्प बनाता है जो क्रिप्टोकरेंसी माइनिंग की दुनिया में विश्वसनीयता के साथ-साथ अतिरिक्त रिवॉर्ड भी चाहते हैं।`,
        fpps_heading: `फुल पे-पर-शेयर (FPPS)`,
        fpps_paragraph: `फुल PPS में, माइनर्स को पूल में सबमिट किए गए हर शेयर के लिए एक निश्चित भुगतान मिलता है, चाहे पूल सफलतापूर्वक ब्लॉक माइन करे या नहीं। यह तरीका माइनर्स को स्थिर और अनुमानित आय प्रदान करता है, जिससे यह उन लोगों के लिए आकर्षक बन जाता है जो अपनी कमाई में विश्वसनीयता चाहते हैं। पारंपरिक PPS के विपरीत, फुल PPS यह सुनिश्चित करता है कि माइनर्स को उनके योगदान किए गए काम के लिए पूरा भुगतान मिले, बिना किसी संभावित कटौती के, भले ही पूल को कभी-कभार कठिनाइयों का सामना करना पड़े। यह एक स्थिर और सरल तरीका है जो क्रिप्टोकरेंसी माइनिंग की दुनिया में निरंतर आय चाहने वाले माइनर्स को पसंद आता है।`,
      },
    },
  },
  chapter_four: {
    title: 'अपने 1.61 बिटकॉइन का दावा करना',
    paragraph_one:
      'अरे, वह सटीक था! आप अब भी बिटरे के खिलाफ लड़ाई से कांप रहे हैं, लेकिन आप और आपके दोस्त जीत गए हैं',
    paragraph_two:
      'जैसे ही आप अपने डेस्क पर बैठते हैं, आप गहरी सांस लेते हैं और दिन के घटनाओं का फिर से सोचकर खो जाते हैं। आपके हाथ खुद को रहते हैं, रहस्यमय प्रेषक के साथ खेलते हुए, जैसे ही आप सोचते हैं कि किसने इसे भेजा',

    intro_one: {
      title: 'बैग की सुरक्षा करना',
      paragraph_one:
        'HOLOCAT: "हममें से किसी को बेहतर आराम करना चाहिए। आपको घर जाने की और माइनिंग पूल्स से संपर्क करने की आवश्यकता है। दुनिया से उन्हें इसके बारे में जानने की इच्छा होगी।"',
      paragraph_two:
        'जैसे ही आप अपने TMY92-P होवर डेस्क पर बैठते हैं, आप दिन की घटनाओं को फिर से याद करते हैं। वैंडरपूल, बिटरे। उन्होंने कभी भी प्रदर्शन के लिए बंद होने की सहमति नहीं दी का खुलासा। क्या यह सब सच हो सकता है? क्या यह सब एक षडयंत्र था? और आपको इस बिल्ली का ख्याल कितने समय तक रखना चाहिए?',
      paragraph_three:
        'चाहे आगे कुछ भी हो, आपको शायद कुछ फंड की आवश्यकता होगी। आप समझते हैं कि आपने बिटरे के साथ आपके प्रतिस्पर्धी माइनिंग अवार्ड्स का दावा कभी नहीं किया। आप निकालने का निर्णय लेते हैं ताकि आपकी घर वापसी के लिए मदद कर सकें।',
    },

    public_key_one: {
      title: 'सार्वजनिक कुंजी',
      heading: 'कुंजी जोड़ी के बारे में',
      paragraph_one:
        'माइनिंग पूल के अनुसार, ऐसा दिखता है कि आपके पहले किए गए सभी काम से 1.61 बिटकॉइन का दावा करना होगा।',
      list_one: 'निजी कुंजी',
      list_two: 'सार्वजनिक कुंजी',
      paragraph_two:
        'लेकिन रुकिए, आपके पास तो वॉलेट भी नहीं है! आप यह सोच रहे होंगे कि आप कहाँ से एक वॉलेट खरीद सकते हैं। जबकि आप कुछ प्रकार की वॉलेट बनाने के लिए हार्डवेयर खरीद सकते हैं, आप वास्तव में अपने कंप्यूटर या मोबाइल डिवाइस के साथ एक बना सकते हैं। चलो, करते हैं!',
      paragraph_three:
        'यदि आपने किसी भी समय खाता बनाया है, तो आपको कुछ जिसे व्यक्तिगत कोड कहा जाता है मिलता है। जिसे गुप्तशास्त्र में "निजी कुंजी" कहा जाता है और यह अक्सर जोड़ का हिस्सा होता है',
      paragraph_four:
        'एक ही कुंजी जोड़ी का ही काफी है ताकि एक वॉलेट बनाई जा सके और उसके भीतर के फंड को नियंत्रित किया जा सके। जब आप बिटकॉइन खरीदना चाहते हैं, तो आप निजी कुंजी का उपयोग करते हैं। जब आप बिटकॉइन प्राप्त करना चाहते हैं, तो आप सार्वजनिक कुंजी का उपयोग करते हैं।"',
    },

    public_key_two: {
      title: 'सार्वजनिक कुंजी',
      paragraph_one:
        'इसलिए, हमारे पास निजी कुंजी है, यह व्यक्तिगत कोड है जिसे आपने साइन अप करते समय प्राप्त किया था। इससे हम कैसे एक सार्वजनिक कुंजी उत्पन्न कर सकते हैं?',
      paragraph_two:
        'इसके लिए, हमें एक रोचक क्रिप्टोग्राफी की एक शाखा पर नजर डालने की आवश्यकता है, जिसे अंडाकृति वृत्त क्रिप्टोग्राफी कहा जाता है। इसे लघु रूप में एलिप्टिक कर्व क्रिप्टोग्राफी या ECC कहा जाता है.',
      paragraph_three:
        'ECC में एक अंडाकृति वृत्त पर निश्चित बिंदुओं को लेना और उन बिंदुओं पर जोड़ने और गुणा करने का शामिल होता है।',
      paragraph_four:
        'बिटकॉइन एक विशिष्ट वृत्त का उपयोग करता है, जिसे secp256k1 कहा जाता है। दाईं ओर, आप एक सरल संस्करण देख रहे हैं जो आसानी से प्रतिमानित होता है, लेकिन समान गणित नियमों का पालन करता है।',
      paragraph_five:
        'हम इस वृत्त पर एक विशिष्ट बिंदु के साथ आरंभ करते हैं, जिसे जेनरेटर पॉइंट कहा जाता है।',
    },

    public_key_three: {
      title: 'सार्वजनिक कुंजी',
      paragraph_one:
        'निजी कुंजी से सार्वजनिक कुंजी निकालने के लिए, हम जेनरेटर पॉइंट के साथ एक अंडाकृति कर्व क्रिप्टोग्राफी क्रिया को बार-बार प्रायोग करते हैं (' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=Why%2520is%2520the%2520generator%2520point%2520repeatedly%2520used%2520to%2520derive%2520a%2520public%2520key%2520from%2520a%2520private%2520key%2520in%2520secp256k1%253F" ' +
        'target="_blank" rel="noopener noreferrer" class="underline">' +
        'जानिए क्यों' +
        '</a>' +
        '). जेनरेटर पॉइंट वृत्त पर एक विशिष्ट बिंदु होता है। इसका मूल्य secp256k1 मानक का हिस्सा है और यह हमेशा समान होता है:',
      paragraph_two:
        'अंडाकृति कर्व क्रिप्टोग्राफी क्रिया जोड़ने के तरह होती है और इसलिए इसका दोहराव गुणा करने के तरह होता है। हम एल्गोरिथम को वर्णन करने के लिए * प्रतीक का उपयोग करते हैं (' +
        '<a href="https://chat.bitcoinsearch.xyz/?author=holocat&question=How%2520does%2520elliptic%2520curve%2520scalar%2520multiplication%2520work%253F" ' +
        'target="_blank" rel="noopener noreferrer" class="underline">' +
        'और जानें' +
        '</a>' +
        '), जहाँ k निजी कुंजी है और P संबंधित सार्वजनिक कुंजी है:',
      paragraph_three:
        'फ़ंक्शन privatekey_to_publickey() को पूरा करें ताकि यह एक दिए गए निजी कुंजी से प्राप्त सार्वजनिक कुंजी दे',
    },

    public_key_four: {
      title: `सार्वजनिक कुंजी`,
      nav_title: `सार्वजनिक कुंजी को कंप्रेस करें`,
      paragraph_one: `सार्वजनिक कुंजी में x और y कोऑर्डिनेट होते हैं, कुल 64 बाइट्स। इसे y कोऑर्डिनेट हटाकर और एक सिंगल बाइट मेटाडेटा को आगे जोड़कर 33 बाइट्स में कंप्रेस किया जा सकता है। यह बाइट बताएगी कि Y कोऑर्डिनेट सम (even) है या विषम (odd)। क्योंकि एलिप्टिक कर्व समीकरण में केवल दो वेरिएबल होते हैं, पूरी सार्वजनिक कुंजी बाद में केवल x और मेटाडेटा का उपयोग करके वेरिफ़ायर द्वारा दोबारा कैलकुलेट की जा सकती है:`,
      paragraph_two_javascript: `मेटाडेटा बाइट '2' होनी चाहिए अगर y सम (even) है और '3' अगर y विषम (odd) है। फ़ंक्शन <span className="text-green">compressPublicKey()</span> को पूरा करें ताकि वह एक सार्वजनिक कुंजी स्वीकार करे और कंप्रेस्ड सार्वजनिक कुंजी को दर्शाने वाली 33 बाइट की hex स्ट्रिंग लौटाए।`,
      paragraph_two_python: `मेटाडेटा बाइट '2' होनी चाहिए अगर y सम (even) है और '3' अगर y विषम (odd) है। फ़ंक्शन <span className="text-green">compress_publickey()</span> को पूरा करें ताकि वह एक सार्वजनिक कुंजी स्वीकार करे और कंप्रेस्ड सार्वजनिक कुंजी को दर्शाने वाली 33 बाइट की hex स्ट्रिंग लौटाए।`,
      success: `बहुत बढ़िया। अब हमारे पास कंप्रेस्ड सार्वजनिक कुंजी है। अगला कदम है इसे हैश करना और इसे मानव-अनुकूल फ़ॉर्मैट में एन्कोड करना।`,
    },

    public_key_five: {
      title: 'सार्वजनिक कुंजी',
      heading: 'अच्छा काम!',
      paragraph_one:
        'और यह रहा! आपका संक्षिप्त सार्वजनिक कुंजी! इसके साथ हम कई दिलचस्प चीजें कर सकते हैं, इसमें हमारे वॉलेट के लिए पतों का निर्माण शामिल है। हम अगले चैलेंज में इसके बारे में सीखेंगे।',
      paragraph_two:
        'ध्यान दें कि सार्वजनिक कुंजी उत्पन्न करना एकमार्ग है। आप एक सार्वजनिक कुंजी उत्पन्न करने के लिए उपयोग किए गए निजी कुंजी को समझ नहीं सकते, जब तक आप एक विख्यात कठिन गणित समस्या जिसे विभिन्न लॉग समस्या कहा जाता है, को हल नहीं करते।',
    },

    address_one: {
      title: `पता`,
      nav_title: `एकतरफ़ा रास्ता`,
      heading: `अच्छा काम!`,
      paragraph_one: `और बस यही है! आपकी कंप्रेस्ड सार्वजनिक कुंजी! इसके साथ हम कई दिलचस्प चीज़ें कर सकते हैं, जिनमें हमारे वॉलेट के लिए पते जनरेट करना भी शामिल है। इसके बारे में हम अगले चैलेंज में सीखेंगे।`,
      paragraph_two: `ध्यान दें कि सार्वजनिक कुंजी जनरेट करना एक एकतरफ़ा रास्ता है। आप उस प्राइवेट की का पता नहीं लगा सकते जिसका उपयोग सार्वजनिक कुंजी बनाने में किया गया था, जब तक कि आप एक बेहद कठिन गणितीय समस्या हल न कर लें, जिसे कहा जाता है `,
      tooltip_one: {
        question: `डिस्क्रीट लॉग समस्या बिटकॉइन से कैसे संबंधित है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=how%2520is%2520the%2520discrete%2520log%2520problem%2520relevant%2520to%2520bitcoin%253F`,
        highlighted: `डिस्क्रीट लॉग समस्या `,
      },
    },

    address_two: {
      title: `पता`,
      nav_title: `कंप्रेस्ड सार्वजनिक कुंजी को हैश करें`,
      paragraph_one: `क्या तुम्हें हैशिंग चैलेंज याद है? पता चला कि तुम अपनी कंप्रेस्ड सार्वजनिक कुंजी को हैश करके बिटकॉइन पते का सबसे सरल प्रकार बना सकते हो। इसके लिए बिटकॉइन दो अलग-अलग हैशिंग एल्गोरिदम का उपयोग करता है: SHA-256 और RIPEMD-160।`,
      paragraph_two: `स्टेप्स:`,
      paragraph_three: `<span className="indent-48">1. अपनी कंप्रेस्ड सार्वजनिक कुंजी पर SHA-256 हैश करें।</span>`,
      paragraph_four: `<span className="indent-48">2. उस SHA-256 आउटपुट डाइजेस्ट पर RIPEMD-160 हैश करें। अंतिम परिणाम 20 बाइट्स होगा, जिसे hex स्ट्रिंग के रूप में एन्कोड किया जाएगा।</span>`,
      paragraph_five: `एक ऐसा फ़ंक्शन पूरा करें जो 33-बाइट की कंप्रेस्ड सार्वजनिक कुंजी को hex स्ट्रिंग के रूप में स्वीकार करे और 20-बाइट की सार्वजनिक कुंजी हैश को hex स्ट्रिंग के रूप में लौटाए।`,
      paragraph_six:
        `यहाँ उन हैशिंग लाइब्रेरीज़ का डॉक्यूमेंटेशन है जिन्हें हमने तुम्हारे लिए इम्पोर्ट किया है:\n` +
        '<Link href="https://nodejs.org/api/crypto.html#class-hash" target="_blank" className="underline">JavaScript: crypto</Link>\n' +
        '<Link href="https://docs.python.org/3/library/hashlib.html#usage" target="_blank" className="underline">Python: hashlib</Link>',
      success: `बहुत बढ़िया। बस एक और स्टेप, और तुम्हारे पास तुम्हारा वॉलेट पता होगा।`,
    },
    address_three: {
      title: `पता`,
      nav_title: `P2WPKH पता प्राप्त करें`,
      paragraph_one: `बिटकॉइन पतों के कई प्रकार होते हैं। पिछले अभ्यास में, हमने 20-बाइट की कंप्रेस्ड सार्वजनिक कुंजी हैश बनाई थी। अब, हम उस हैश को टेस्टनेट नेटवर्क पर Pay-to-Witness-Public-Key-Hash (p2wpkh) पते में एन्कोड करना चाहते हैं।`,
      paragraph_two: `सबसे पहले हमें हैश के आगे '0' का एक विटनेस वर्ज़न नंबर जोड़ना होता है। इस तरह बनने वाले 21 बाइट्स को <span className="font-bold">विटनेस प्रोग्राम</span> कहा जाता है।`,
      paragraph_three: `इसके बाद, विटनेस प्रोग्राम को एक मानव-अनुकूल फ़ॉर्मैट में एन्कोड किया जाता है जिसे <Link href="https://github.com/bitcoin/bips/blob/master/bip-0173.mediawiki#user-content-Specification" target="_blank" className="underline">bech32</Link> कहा जाता है। ऐसा करने से डेटा में एक ह्यूमन-रीडेबल प्रीफ़िक्स और एक चेकसम जुड़ जाता है।`,
      paragraph_four: `प्रीफ़िक्स नेटवर्क द्वारा निर्धारित होता है:`,
      table_heading: {
        item_one: `नेटवर्क`,
        item_two: `ह्यूमन-रीडेबल प्रीफ़िक्स`,
      },
      table_rows: {
        key_one: `मेननेट`,
        value_one: `bc`,
        key_two: `टेस्टनेट`,
        value_two: `tb`,
        key_three: `रेगटेस्ट`,
        value_three: `bcrt`,
      },
      paragraph_five: `क्योंकि हम एक टेस्टनेट पता बना रहे हैं, इसलिए हम 'tb' प्रीफ़िक्स का उपयोग करेंगे।`,
      paragraph_six: `डेटा को bech32 में एन्कोड करने के बाद, हमारे पास एक बिटकॉइन पता रह जाता है!`,
      paragraph_seven: `कंप्रेस्ड सार्वजनिक कुंजी हैश से एक bech32 पता बनाने के लिए फ़ंक्शन पूरा करें। पहले विटनेस प्रोग्राम बनाएँ, फिर पहले से इम्पोर्ट की गई bech32 लाइब्रेरी का उपयोग करके उस प्रोग्राम को पते में बदलें।`,
      paragraph_eight: `सही फ़ंक्शन्स ढूँढने के लिए आपको bech32 लाइब्रेरी में जाकर कोड पढ़ना पड़ सकता है:\n`,
      paragraph_eight_javascript: `<Link href="https://github.com/saving-satoshi/bech32js/blob/main/bech32.js" target="_blank" className="underline">JavaScript: @savingsatoshi/bech32js</Link>\n`,
      paragraph_eight_python: `<Link href="https://github.com/saving-satoshi/bech32py/blob/main/bech32py/bech32.py" target="_blank" className="underline">Python: savingsatoshi_bech32py</Link>`,
      success: `अब तुम्हारे पास एक ऐसा पता है जिस पर माइन किया गया बिटकॉइन भेजा जा सकता है।`,
    },
    tabconf_clue_one: {
      title: `वर्ष 2025`,
      nav_title: `Tabconf वर्ष 2025`,
      paragraph_one: `छोड़े गए वेयरहाउस के भीतर गहराई में, तुम्हारा स्कैनर एक अजीब सिग्नल पकड़ता है। यह इस दुनिया का एक टूटा हुआ हिस्सा है, एक खंडित कोड जो एक अजीब क्वांटम सिग्नेचर उत्सर्जित कर रहा है। तुम इसे डिकोड करते हो, और किसी संदेश की बजाय एक बग रिपोर्ट प्राप्त होती है – एक तात्कालिक निमंत्रण।`,
      paragraph_two: `होलोकैट प्रकट होता है, आँखें फैली हुई। "यही है, वह 'ग्लिच'। यह बग… जानबूझकर किया हुआ लगता है। जैसे क्वांटम इंटरफ़ेरेंस।"`,
      paragraph_three: `होलोकैट निर्देश देता है, "टूटी हुई स्क्रिप्ट को ठीक करो। सोच रहा हूँ क्या इसका कोई संबंध <a target="_blank" href="https://7.tabconf.com/">TABConf</a> से है, उस कॉन्फ़्रेंस से जहाँ Capture The Bitcoin खेला जाता है।"`,
      paragraph_four: `"हैश कॉपी करो..." होलोकैट ने ज़ोर देते हुए कहा, "यही हमारी कुंजी है।"`,
    },
    outro_one: {
      title: 'समापन',
      heading: 'सफलता!',
      paragraph_one: 'आपने अपना खुद का बिटकॉइन वॉलेट बनाया है!',
      paragraph_two:
        'आप बिटकॉइन को खुद ही बनाए गए वॉलेट में से निकालते हैं। अब आप पूरी तरह से वित्तपोषित हैं और अगले जो भी वैंडरपूल और बिटरेइ आपके सामने फेंक सकते हैं, उसके लिए तैयार हैं।',
    },
    resources: {
      public_key_three: {
        generator_point_heading: `जनरेटर पॉइंट`,
        generator_point_paragraph: `secp256k1 कर्व पर एक विशिष्ट बिंदु। इसका मान secp256k1 स्टैंडर्ड का हिस्सा है और यह हमेशा एक-सा रहता है। यह बिंदु कर्व के अन्य बिंदुओं से अलग नहीं है, लेकिन गणनाओं के लिए इसे मानक शुरुआती बिंदु के रूप में स्वीकार किया गया है। वास्तव में कोई नहीं जानता कि इसी विशेष बिंदु को क्यों चुना गया।`,
        elliptic_curve_operations_heading: `एलिप्टिक कर्व ऑपरेशन्स`,
        elliptic_curve_operations_paragraph: `एलिप्टिक कर्व के अपने गणितीय नियम होते हैं, इसलिए जोड़ और गुणा जैसे सरल ऑपरेशन्स भी अलग तरीके से काम करते हैं। सरलता और संक्षिप्तता के लिए, पहले से प्रचलित प्रतीकों का पुनः उपयोग किया जाता है, जैसे गुणा से मिलते-जुलते ऑपरेशन के लिए “*” का उपयोग।`,
        discrete_log_heading: `डिस्क्रीट लॉगरिदम`,
        discrete_log_paragraph: `एक गणितीय प्रणाली जहाँ आप, उदाहरण के लिए, गुणा तो कर सकते हैं लेकिन भाग नहीं। इसका एक सरल रूपक घड़ी को देखना है। 11 बजे के 3 घंटे बाद 2 बजते हैं। तो हम कह सकते हैं “11+3=2”。लेकिन अगर हम “2-x=11” करना चाहें और x निकालें, तो अनंत संभावित उत्तर मिलेंगे (3, 15, 27, 39...)। और जानकारी के लिए <Link href="https://en.wikipedia.org/wiki/Discrete_logarithm" className="underline">विकिपीडिया</Link> देखें।`,
        tip_one: `एलिप्टिक कर्व पॉइंट्स के साथ गुणा करना उस तरह का गुणा नहीं है जिसकी आपको सामान्य संख्याओं के साथ आदत है। तो फिर गुणा कैसे किया जाता है? ध्यान दें कि जनरेटर पॉइंट <span className="p-1 font-mono bg-[#0000004D] m-1">G</span> का प्रकार <span className="p-1 font-mono bg-[#0000004D] m-1">secp256k1.GE</span> है। उस क्लास को देखें ताकि यह समझ सकें कि उस पर कौन-कौन से मेथड्स कॉल किए जा सकते हैं।`,
        tip_two: `हालाँकि प्राइवेट की को hex फ़ॉर्मैट में स्वीकार किया जाता है, लेकिन जनरेटर पॉइंट के साथ गुणा करने से पहले इसे एक संख्या (अगर आप JS इस्तेमाल कर रहे हैं तो BigInt) में बदलना आवश्यक है।`,
      },
      public_key_four: {
        y_coordinate_compression_heading: `सार्वजनिक कुंजी संपीड़न`,
        y_coordinate_compression_paragraph: `जब आप एलिप्टिक कर्व पर पॉइंट ऐडिशन की गणना करते हैं, तो दो बिंदुओं के कोऑर्डिनेट्स का उपयोग करके तीसरे बिंदु के कोऑर्डिनेट्स निकाले जाते हैं जो कर्व पर स्थित होता है। हालाँकि, किसी दिए गए x-कोऑर्डिनेट के लिए आम तौर पर दो संभावित y-कोऑर्डिनेट होते हैं (कुछ विशेष मामलों को छोड़कर)। सार्वजनिक कुंजी को कंप्रेस करते समय, आप इन y-कोऑर्डिनेट्स में से एक चुनते हैं और केवल x-कोऑर्डिनेट के साथ यह संकेत शामिल करते हैं कि कौन-सा y-कोऑर्डिनेट उपयोग करना है। इस स्थिति में हम जो मेटाडेटा जोड़ते हैं, वही y-कोऑर्डिनेट को इंगित करता है।`,
        tip: `यह चैलेंज वास्तव में काफ़ी सरल है। हमें केवल यह निर्धारित करना होता है कि y-कोऑर्डिनेट सम (even) है या विषम (odd), ताकि उसी के अनुसार मेटाडेटा को हमारी सार्वजनिक कुंजी के आगे जोड़ा जा सके।`,
      },
      address_two: {
        hash_algo_heading: `SHA-256, RIPEMD-160`,
        hash_algo_paragraph: `हैश फ़ंक्शन्स किसी भी मात्रा और किसी भी प्रकार के डेटा को इनपुट के रूप में लेते हैं और हमेशा एक निश्चित आकार का आउटपुट देते हैं। SHA-256 के लिए यह 32 बाइट्स होता है। RIPEMD-160 के लिए यह 20 बाइट्स होता है। आउटपुट डिटरमिनिस्टिक होता है (एक ही इनपुट के लिए हमेशा वही आउटपुट), लेकिन इसके अलावा यह रैंडम से अलग पहचान में नहीं आता। हैश फ़ंक्शन्स डेटा को प्रभावी रूप से एक छोटे और सुसंगत फ़िंगरप्रिंट में बदल देते हैं।`,
        tip_one: `SHA-256 हैश की गणना करते समय यह सुनिश्चित करें कि आप अपनी कंप्रेस्ड कुंजी को bytes के रूप में हैश कर रहे हैं, न कि hex के रूप में। अगर आप JavaScript का उपयोग कर रहे हैं, तो इसके लिए hex स्ट्रिंग को buffer में बदलना होगा।`,
        tip_two: `सुनिश्चित करें कि आप हैशिंग एल्गोरिदम सही क्रम में लागू कर रहे हैं।`,
      },
      address_three: {
        wpkh_heading: `विटनेस पब्लिक की हैश (wpkh) पता`,
        wpkh_paragraph: `बिटकॉइन पता अक्षरों की एक स्ट्रिंग होता है जिसे उपयोगकर्ताओं के लिए संभालना आसान बनाया गया है। यह छोटा होता है, कॉपी-पेस्ट करना आसान होता है, और इसमें किसी न किसी प्रकार का बिल्ट-इन चेकसम होता है ताकि यह सुनिश्चित किया जा सके कि इसे हमेशा सही तरीके से कॉपी किया गया है। यह सुरक्षित रूप से एक बिटकॉइन आउटपुट स्क्रिप्ट को एन्कोड करता है, जिससे प्राप्तकर्ता खर्च कर सकता है। आउटपुट स्क्रिप्ट्स के कई प्रकार और एन्कोडिंग के कई तरीके होते हैं। इस चैलेंज में हम एक कंप्रेस्ड सार्वजनिक कुंजी को bech32 से एन्कोड करके जिसे विटनेस पब्लिक की हैश पता कहा जाता है, वह बनाते हैं।`,
        network_heading: `मेननेट, टेस्टनेट, सिगनेट और रेगटेस्ट`,
        network_paragraph: `बिटकॉइन सॉफ़्टवेयर विकसित करते समय, असली पैसे पर भरोसा करने से पहले अपने कोड का परीक्षण करना बहुत महत्वपूर्ण होता है। बिटकॉइन सॉफ़्टवेयर को टेस्ट करने का एक सरल तरीका है एक अलग ब्लॉकचेन का उपयोग करना, जिसमें नया जेनिसिस ब्लॉक हो, जहाँ कॉइन्स का कोई वास्तविक मूल्य न हो, माइनिंग मुफ़्त और आसान हो, और किसी भी समय सब कुछ रीसेट किया जा सके। ये चेन नोड्स के एक अलग नेटवर्क द्वारा सपोर्ट की जाती हैं, जो मेननेट पर मौजूद असली कॉइन्स और नोड्स में कोई हस्तक्षेप नहीं करता। टेस्टनेट और सिगनेट ऐसी ही दो वैकल्पिक बिटकॉइन ब्लॉकचेन के नाम हैं, जिन्हें वैश्विक स्तर पर मेननेट के साथ समानांतर रूप से बनाए रखा जाता है। रेगटेस्ट एक डेवलपर मोड है जिसे लोकली चलाने के लिए डिज़ाइन किया गया है और इसमें किसी भी नेटवर्क कनेक्शन की आवश्यकता नहीं होती।`,
        tip: `सुनिश्चित करें कि आप bech32 लाइब्रेरी को ध्यान से देखें ताकि यह पता चल सके कि आप कौन-से सटीक मेथड्स का उपयोग कर सकते हैं।`,
      },
    },
  },

  chapter_five: {
    title: `क्या असली सातोशी सामने आएंगे`,
    paragraph_one: `रात हो चुकी है, और तुम थके हुए हो, लेकिन जैसे ही तुम पल भर के लिए आँखें बंद करते हो, बुरी खबरों की दोहरी खुराक आ जाती है।`,
    paragraph_two: `1) वैंडरपूल फिर से टीवी पर है।`,
    paragraph_three: `2) वह दावा कर रहा है कि वह सातोशी नाकामोटो का परपोता है।`,
    paragraph_four: `वह नींद से वंचित दिख रहा है।`,
    intro_one: {
      title: `परिचय`,
      nav_title: `भरोसा मत करो, सत्यापित करो`,
      paragraph_one: `—डेबोरा चंक: “श्री वैंडरपूल। आपने हाल ही में एंटी-सोशल मीडिया पर यह चौंकाने वाला दावा किया है कि आप सातोशी नाकामोटो के परपोता हैं। क्या यह सही है? क्या यह सच है?”`,
      paragraph_two: `—वैंडरपूल: “बिल्कुल सही है, डेबोरा। मैंने यह रहस्य बहुत, बहुत लंबे समय तक छुपाकर रखा है। देखिए, मेरे परिवार ने पीढ़ियों से एक साधारण-सा दिखने वाला CD-ROM आगे बढ़ाया है। इसे गुप्त रखने के लिए हमने इसे <span className="italic">Creed – My Own Prison</span> नाम दिया। इसमें मेरे परदादा सातोशी नाकामोटो के विशाल बिटकॉइन भंडार की प्राइवेट कीज़ हैं। इसलिए जब मैं माइनर्स की ओर से बोलता हूँ, तो समझिए कि मैं सातोशी नाकामोटो की ओर से भी बोलता हूँ।”`,
      paragraph_three: `—डेबोरा चंक: “क्या कोई तरीका है जिससे हम यह सत्यापित कर सकें कि आप वास्तव में सातोशी नाकामोटो के बिटकॉइन की प्राइवेट कीज़ के मालिक हैं?”`,
      paragraph_four: `—वैंडरपूल: “बिल्कुल है। यह पब्लिक की क्रिप्टोग्राफी का एक सरल मामला है।”`,
      paragraph_five: `—डेबोरा चंक: “लेकिन इतनी देर तक इस धरती-हिला देने वाले खुलासे को करने का इंतज़ार क्यों किया?”`,
    },
    intro_two: {
      nav_title: `वैंडरपूल का साहसिक दावा`,
      paragraph_one: `—वैंडरपूल: “मुझमें हिम्मत नहीं थी। मेरे परिवार के इतिहास को लेकर हमेशा अफ़वाहें रही हैं, जिन्हें मैं आसानी से पुष्टि कर सकता था। लेकिन मैं इतनी ज़्यादा पब्लिसिटी के लिए तैयार नहीं था। आखिरकार, मैं अपने सभी निजी द्वीपों में से अपने पसंदीदा पर, एक 14वीं सदी के किले में, एक ड्यूड रैंच पर, एक सादा और एकांत जीवन जीता हूँ, और हर हफ्ते अपने हॉट टब से इस तरह के 5–6 इंटरव्यू देता हूँ।”`,
      paragraph_two: `—वैंडरपूल: “लेकिन अब जब बिटकॉइन का भविष्य दाँव पर है, तो मुझे लगा कि सच का सामना करने का समय आ गया है—खासतौर पर Creed के डेब्यू एल्बम, My Own Prison, के संगीत का।” *वैंडरपूल 20वीं सदी के उस एल्बम के नाम वाले गीत की धुन गुनगुनाता है*`,
      paragraph_three: `—वैंडरपूल: “मैं बस इतना ही कह सकता हूँ कि मुझे पहले सामने न आने का अफ़सोस है, क्योंकि उस CD-ROM में सातोशी नाकामोटो की बिटकॉइन के लिए संशोधित योजनाएँ भी हैं। देखिए, मेरे परदादा को हमेशा यह पछतावा रहा कि उन्होंने बिटकॉइन की आपूर्ति को 21 मिलियन कॉइनों तक सीमित कर दिया। इसी वजह से मैं अपने परदादा के सपने को पूरा करने के लिए स्थायी बिटकॉइन इश्यूअन्स के पक्ष में बिटकॉइन को हार्ड फोर्क करने की योजना बना रहा हूँ।”`,
    },
    intro_three: {
      nav_title: `सातोशी का संदेश`,
      paragraph_one: `तुम्हारी TXM4H-A होवर स्क्रीन जीवंत हो उठती है। तुम्हारे लिए एक नया संदेश है।`,
      paragraph_two: `—HOLOCAT: मेरी नाक को बोप करना मत भूलना।`,
      paragraph_three: `तुम उसकी नाक को बोप करते हो।`,
      paragraph_four: `—सातोशी नाकामोटो: “वैंडरपूल वह नहीं है जो वह होने का दावा करता है। तुम उसे बेनकाब कर सकते हो। उससे कहो कि वह उस वॉलेट की प्राइवेट कीज़ का उपयोग करके एक संदेश साइन करके सातोशी के बिटकॉइन के स्वामित्व का प्रमाण दे।”`,
    },
    derive_message_one: {
      title: `संदेश निकालें`,
      nav_title: `विवादित संदेश`,
      heading: `वैंडरपूल कहता है कि उसने सातोशी की कीज़ से एक संदेश साइन किया है:`,
      code_one: `-----BEGIN BITCOIN SIGNED MESSAGE----- \n \n मैं वैंडरपूल हूँ और मेरे पास उस प्राइवेट की का नियंत्रण है जिसका उपयोग सातोशी ने ब्लॉक #170 में पुष्टि हुई पहली बिटकॉइन ट्रांज़ैक्शन को साइन करने के लिए किया था। यह संदेश उसी प्राइवेट की से साइन किया गया है। \n \n -----BEGIN BITCOIN SIGNATURE----- \n \n`,
      code_two: `<span className="break-all"> H4vQbVD0pLK7pkzPto8BHourzsBrHMB3Qf5oYVmr741pPwdU2m6FaZZmxh4ScHxFoDelFC9qG0PnAUl5qMFth8k= </span>`,
      code_three: `\n \n-----END BITCOIN SIGNATURE-----`,
      paragraph_two: `इसका मतलब आखिर है क्या?`,
    },
    derive_message_two: {
      nav_title: `पब्लिक की ढूँढना`,
      paragraph_one: `अध्याय 4 में हमने सीखा था कि प्राइवेट कीज़ विशाल रैंडम संख्याएँ होती हैं जिन्हें उन्हें बनाने वाला गुप्त रखता है। हम एलिप्टिक कर्व गणित का उपयोग करके उस प्राइवेट की से एक पब्लिक की निकाल सकते हैं।`,
      paragraph_two: `पब्लिक की को एक यूनिक पहचानकर्ता के रूप में साझा किया जा सकता है और प्राइवेट की का उपयोग यह साबित करने के लिए किया जाता है कि किसी व्यक्ति का उस पहचानकर्ता पर नियंत्रण है। उस प्रमाण को सिग्नेचर कहा जाता है। सिग्नेचर बनाने के लिए एक संदेश और एक प्राइवेट की चाहिए। कोई भी व्यक्ति संदेश की एक कॉपी और संबंधित पब्लिक की के साथ सिग्नेचर को सत्यापित कर सकता है।`,
      paragraph_three: `वैंडरपूल ने एक सिग्नेचर और एक संदेश दिया है। पब्लिक की कहाँ है?`,
    },
    derive_message_three: {
      nav_title: `सातोशी का सिग्नेचर ढूँढें`,
      heading: `आइए सातोशी का सिग्नेचर ढूँढने से शुरू करें`,
      paragraph_one: `ब्लॉक #170 में सातोशी से हाल फ़िन्नी को किया गया <link href="https://bitcointalk.org/index.php?topic=155054.0" target="_blank" className="underline">पहला बिटकॉइन ट्रांज़ैक्शन</link> शामिल है। उस ट्रांज़ैक्शन में केवल <Link href="https://blockstream.info/tx/f4184fc596403b9d638783cf57adfe4c75c605f6356fbc91338530e9831e9e16?expand" target="_blank" className="underline">एक इनपुट</Link> है। उस इनपुट से scriptSig प्राप्त करें। उसमें सातोशी का सिग्नेचर है!`,
      placeholder: `यहाँ डेटा पेस्ट करें`,
      success: `अच्छा किया! यह वास्तव में सातोशी का सिग्नेचर है, जो उसके बिटकॉइन को हाल फ़िन्नी को ट्रांसफ़र करने की अनुमति देता है।`,
    },
    derive_message_four: {
      nav_title: `सातोशी की पब्लिक की ढूँढें`,
      heading: `तो उसकी पब्लिक की कहाँ है?`,
      paragraph_one: `वह वास्तव में उस बिटकॉइन के साथ संग्रहीत है जिसे सातोशी ने ब्लॉक #9 को माइन करके बनाया था।`,
      paragraph_two: `<Link href="https://blockstream.info/tx/0437cd7f8525ceed2324359c2d0ba26006d92d856a9c20fa0241106ee5a597c9?output:0&expand" target="_blank" className="underline">लिंक का अनुसरण करें</Link> और इनपुट #0 सेक्शन के शीर्ष पर स्रोत ट्रांज़ैक्शन देखें। यह वही ट्रांज़ैक्शन है जिसे सातोशी ने ब्लॉक #9 को माइन करके बनाया था। इस ट्रांज़ैक्शन में 50 BTC बनते हैं और उन्हें नियंत्रित किया जाता है… एक पब्लिक की द्वारा! scriptPubKey में 0411… से शुरू होने वाला डेटा ढूँढें।`,
      paragraph_three: `पब्लिक की, OP_PUSHBYTES और OP_CHECKSIG स्क्रिप्ट कमांड्स के बीच रहती है। इसे नीचे पेस्ट करें:`,
      placeholder: `यहाँ डेटा पेस्ट करें`,
      success: `बस यही है!`,
    },
    derive_message_five: {
      nav_title: `अब सिग्नेचर सत्यापित करें`,
      paragraph_one: `पिछले अभ्यास में हमने देखा कि सातोशी को ब्लॉक #9 माइन करने के लिए 50 BTC मिले। उसने इन्हें हाल फ़िन्नी को भेजे गए अपने ट्रांज़ैक्शन (ब्लॉक #170) के इनपुट के रूप में इस्तेमाल किया—10 BTC हाल फ़िन्नी की पब्लिक की को भेजे और 40 BTC बदलाव के रूप में अपने पास वापस लिए। सातोशी की प्राइवेट की का उपयोग उन फ़ंड्स के ट्रांसफ़र को अधिकृत करने के लिए सिग्नेचर बनाने में किया गया था।`,
      paragraph_two: `अब हमें यह सीखना है कि सिग्नेचर को कैसे सत्यापित किया जाए। लेकिन अभी भी कुछ गायब है… वह संदेश क्या है जिसे सातोशी ने हाल के लिए ट्रांज़ैक्शन को अधिकृत करने के लिए साइन किया था?`,
    },
    derive_message_six: {
      nav_title: `संदेश निकालें`,
      heading: `ट्रांज़ैक्शन से संदेश निकालें`,
      paragraph_one: `सिर्फ ब्लॉक एक्सप्लोरर वेब पेज देखकर ही यह स्पष्ट हो जाता है कि एक बिटकॉइन ट्रांज़ैक्शन में कई अलग-अलग हिस्से होते हैं। कुछ हिस्से छोटे नंबर होते हैं और कुछ बड़े डेटा ब्लॉक्स। बिटकॉइन प्रोटोकॉल में ट्रांज़ैक्शनों से संदेश बनाने के लिए एक बहुत विशिष्ट एल्गोरिदम होता है, ताकि उन संदेशों को प्राइवेट कीज़ से साइन किया जा सके।`,
      paragraph_two: `हम <Link href="https://en.bitcoin.it/wiki/OP_CHECKSIG" target="_blank" className="underline">यहाँ</Link> बताई गई प्रक्रिया का सार प्रस्तुत करेंगे। यह सुविधा से <Link href="https://en.bitcoin.it/wiki/OP_CHECKSIG#Code_samples_and_raw_dumps" target="_blank" className="underline">ब्लॉक #170 के इसी ट्रांज़ैक्शन</Link> को उदाहरण के रूप में उपयोग करता है।`,
      paragraph_three: `शुरू करने के लिए, हमें पूरे ट्रांज़ैक्शन को बनाने वाले रॉ बाइट्स चाहिए। <Link href="https://blockstream.info/api/tx/f4184fc596403b9d638783cf57adfe4c75c605f6356fbc91338530e9831e9e16/hex" target="_blank" className="underline">हमारा ब्लॉक एक्सप्लोरर</Link> इसमें मदद कर सकता है। "hex" API एंडपॉइंट का उपयोग करें और पूरे डेटा ब्लॉब को पेस्ट करें।`,
      input_challenge_label: `ट्रांज़ैक्शन ब्लॉब पेस्ट करें`,
      success_message_line_one: `यह प्रत्येक घटक के साथ लेबल किया गया रॉ ट्रांज़ैक्शन है:`,
      success_message_line_two: `वर्ज़न:`,
      success_message_line_three: `इनपुट्स की संख्या:`,
      success_message_line_four: `वह tx का हैश जिससे इनपुट #0 आया है:`,
      success_message_line_five: `फ़ंडिंग ट्रांज़ैक्शन में इनपुट #0 का इंडेक्स:`,
      success_message_line_six: `इनपुट #0 खर्च करने को अधिकृत करने वाला scriptSig:`,
      success_message_line_seven: `इनपुट #0 सीक्वेंस:`,
      success_message_line_eight: `आउटपुट्स की संख्या:`,
      success_message_line_nine: `आउटपुट #0 का मान (10 BTC या 1,000,000,000 सतोशी):`,
      success_message_line_ten: `आउटपुट #0 का scriptPubKey (हाल फ़िन्नी की पब्लिक की + OP_CHECKSIG):`,
      success_message_line_eleven: `आउटपुट #1 का मान (40 BTC या 4,000,000,000 सतोशी):`,
      success_message_line_twelve: `आउटपुट #1 का scriptPubKey (परिवर्तन के लिए फिर से सातोशी की अपनी पब्लिक की):`,
      success_message_line_thirteen: `लॉकटाइम:`,
    },
    derive_message_seven: {
      nav_title: `साइन करने के लिए संदेश बनाएँ`,
      paragraph_one: `ऐसे संदेश को साइन करना असंभव है जिसमें उसका अपना सिग्नेचर शामिल हो, इसलिए scriptSig को हटाना पड़ता है। बिटकॉइन प्रोटोकॉल में इसे वास्तव में उस ट्रांज़ैक्शन आउटपुट के scriptPubKey से बदल दिया जाता है जिसे हम खर्च कर रहे हैं।`,
      paragraph_two: `हम पहले ही पिछले चरण में scriptPubKey ढूँढ चुके हैं, आप उसे पहले खाली स्थान में पेस्ट कर सकते हैं।`,
      paragraph_three: {
        a: `हमारे ट्रांज़ैक्शन संदेश के लिए आख़िरी चीज़ जो चाहिए वह है एक`,
        b: `। अगले अध्याय में हम इसे और कवर करेंगे, लेकिन फिलहाल हम संदेश के अंत में <span className="font-bold">01000000</span> मान जोड़ देंगे।`,
      },
      tooltip_one: {
        question: `sighash फ़्लैग्स क्या हैं?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=what%2520are%2520sighash%2520flags%253F`,
        highlighted: `sighash प्रकार फ़्लैग`,
      },
      success: `अच्छा! तुमने साइन करने के लिए संदेश बना लिया है।`,
    },
    verify_signature_one: {
      title: `सिग्नेचर सत्यापित करें`,
      nav_title: `सिग्नेचर का सत्यापन`,
      heading: `आख़िरकार हमारे पास एक संदेश है!`,
      paragraph_one: `हमारे पास वह सिग्नेचर भी है जिसे हम जानते हैं कि सातोशी ने अपनी प्राइवेट कीज़ से बनाया था, और हमारे पास उसकी पब्लिक की भी है। आइए सीखें कि सिग्नेचर को कैसे सत्यापित किया जाए और फिर वैंडरपूल के सिग्नेचर को सत्यापित करने की कोशिश करें।`,
    },
    verify_signature_two: {
      title: `सिग्नेचर सत्यापित करें`,
      nav_title: `संदेश को हैश करें`,
      heading: `ट्रांज़ैक्शन डाइजेस्ट को हैश करें`,
      paragraph_one: `पिछले चरण में हमने जो सीरियलाइज़्ड ट्रांज़ैक्शन डेटा तैयार किया था, वह ECDSA से साइन या सत्यापित करने के लिए वास्तव में बहुत लंबा है।`,
      paragraph_two: `क्या हमें बड़े डेटा को अधिक सुसंगत, प्रबंधनीय टुकड़ों में संपीड़ित करने का कोई तरीका पता है? बिल्कुल: हैशिंग।`,
      paragraph_three: {
        a: `बिटकॉइन प्रोटोकॉल एक `,
        b: ` का उपयोग ट्रांज़ैक्शन को साइन करने योग्य संदेश में संपीड़ित करने के लिए करता है।`,
      },
      paragraph_four: `जब हमारे पास 32-बाइट का हैश आ जाता है, तो उस डेटा को एक पूर्णांक के रूप में पुनः व्याख्यायित किया जाता है। हाँ, एक 32-बाइट का पूर्णांक (जो वास्तव में एक बहुत ही विशाल संख्या है)!`,
      tooltip_one: {
        question: `बिटकॉइन में हर चीज़ डबल हैश (HASH256) का उपयोग क्यों करती है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=Why%2520does%2520everything%2520in%2520bitcoin%2520use%2520double%2520hash%2520%28HASH256%29%253F`,
        highlighted: `डबल SHA256 डाइजेस्ट`,
      },
      success: `अच्छा किया!`,
    },
    verify_signature_three: {
      nav_title: `सिग्नेचर डिकोड करें`,
      heading: `सिग्नेचर डिकोड करें`,
      label_one: `R मान पेस्ट करें`,
      label_two: `S मान पेस्ट करें`,
      paragraph_one: `सातोशी का सिग्नेचर DER नामक सिस्टम में एन्कोड किया गया है, जो ASN.1 का एक उपसमुच्चय है।`,
      paragraph_two: `हमें दो 32-बाइट संख्याएँ निकालनी हैं। इन्हें क्रमशः R और S कहा जाता है और DER सीक्वेंस में प्रत्येक के आगे 0220 बाइट्स जुड़े होते हैं। DER ब्लॉब को पूरी तरह डिकोड करने के बजाय, बस इन प्रीफ़िक्स को ढूँढें और R तथा S मान पेस्ट करें।`,
      paragraph_three: `# सातोशी का सिग्नेचर, हाल फ़िन्नी को किए गए tx (ब्लॉक 170) के इनपुट scriptSig से`,
    },
    verify_signature_four: {
      nav_title: `पब्लिक की डिकोड करें`,
      heading: `पब्लिक की डिकोड करें`,
      label_one: `x कोऑर्डिनेट पेस्ट करें`,
      label_two: `y कोऑर्डिनेट पेस्ट करें`,
      paragraph_one: `अध्याय 4 में हमने सीखा था कि पब्लिक की वास्तव में ECDSA कर्व पर बिंदु होती हैं, यानी उनमें x और y मान होते हैं। पहला बाइट 04 का मतलब “अनकंप्रेस्ड” होता है (02 और 03 के विपरीत, जैसा कि हमने अध्याय 4 में सीखा था)। उस पहले बाइट को हटा दें और शेष डेटा 32-बाइट के x और y कोऑर्डिनेट्स होंगे। फिर से कॉपी और पेस्ट करें।`,
      paragraph_two: `# सातोशी की पब्लिक की, ब्लॉक 9 के कॉइनबेस आउटपुट scriptPubKey से`,
    },
    verify_signature_five: {
      title: `सिग्नेचर सत्यापित करें`,
      nav_title: `सिग्नेचर का परीक्षण करें`,
      heading: `सिग्नेचर सत्यापित करें!`,
      success: `तुमने कर दिखाया! तुमने सातोशी का सिग्नेचर सत्यापित कर लिया है!`,
      paragraph_one: `इस बिंदु पर हमारे पास ECDSA गणित करने के लिए ज़रूरी सब कुछ है।`,
      paragraph_two: `ECDSA सिग्नेचर सत्यापन एल्गोरिदम <Link className="underline" href="https://en.wikipedia.org/wiki/Elliptic_Curve_Digital_Signature_Algorithm#Signature_verification_algorithm" target="_blank">यहाँ</Link> और <Link className="underline" href="https://www.secg.org/sec1-v2.pdf#page=52" target="_blank">यहाँ</Link> समझाया गया है।`,
      paragraph_three: `हमने आपके लिए पब्लिक की के X और Y तत्वों से एक ग्रुप एलिमेंट ऑब्जेक्ट बना दिया है। आपको ECDSA सिग्नेचर सत्यापन फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">verify()</span> को पूरा करना है, जो केवल तभी True लौटाए जब सब कुछ वैध हो!`,
      paragraph_four: `हम जानते हैं कि सातोशी का सिग्नेचर वैध है—इसे 2010 से हर बिटकॉइन फुल नोड द्वारा जाँचा गया है! अगर आपका प्रोग्राम True नहीं लौटाता, तो कुछ गलत है।`,
      python: {
        paragraph_five_part_one: `संकेत: <span className="text-green">pow()</span>`,
        paragraph_five_part_two: `मेथड नकारात्मक एक्सपोनेंट्स और एक मॉड्यूलस को आर्ग्युमेंट्स के रूप में स्वीकार कर सकता है। अधिक जानकारी <Link className="underline" href="https://docs.python.org/3/library/functions.html#pow" target="_blank">डॉक्यूमेंटेशन</Link> में।`,
      },
      javascript: {
        paragraph_five_part_one: `हमने एक हेल्पर फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">invert()</span>`,
        paragraph_five_part_two: `प्रदान किया है, जिसकी आपको JavaScript के नेटिव मॉड्यूलर एक्सपोनेंशिएशन फ़ंक्शन के स्थान पर आवश्यकता होगी।`,
      },
    },
    validate_signature_one: {
      title: `सिग्नेचर मान्य करें`,
      nav_title: `संदेश तैयार करें`,
      heading: `वैंडरपूल के संदेश को सत्यापन के लिए तैयार करें`,
      paragraph_one: `वैंडरपूल ने अपने स्टंट के लिए <Link href="https://github.com/bitcoin/bips/blob/master/bip-0137.mediawiki" target="_blank" className="underline">बिटकॉइन मैसेज साइनिंग प्रोटोकॉल</Link> का उपयोग किया। गणना वही एल्गोरिदम उपयोग करती है जिसे हमने पहले ही परिभाषित किया है, लेकिन डेटा की तैयारी थोड़ी अलग होती है।`,
      paragraph_two: `सबसे पहले, हमें उसके संदेश को बाइट्स की एक ऐरे में एन्कोड करना होगा, जो निम्न टेम्पलेट के अनुरूप हो:`,
      paragraph_three: {
        pre_link: `फिर हम उस डेटा ब्लॉब को `,
        highlighted: `डबल SHA-256 हैश`,
        question: `हम बिटकॉइन में डबल हैश क्यों करते हैं?`,
        post_link: ` करेंगे, और उस हैश को एक पूर्णांक में बदल देंगे। फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">encode_message()</span> को पूरा करें। इसे 32-बाइट का hex मान लौटाना चाहिए।`,
      },
      success: `अच्छा किया`,
    },
    validate_signature_two: {
      nav_title: `सिग्नेचर तैयार करें`,
      heading: `वैंडरपूल के सिग्नेचर को सत्यापन के लिए तैयार करें`,
      paragraph_one: `वैंडरपूल द्वारा उपयोग किया गया बिटकॉइन मैसेज साइनिंग प्रोटोकॉल सिग्नेचर के लिए base64 निर्दिष्ट करता है। हमें उस base64 स्ट्रिंग को 65-बाइट के अनुक्रम में डिकोड करना होगा। फिलहाल, हम पहले मेटाडेटा बाइट को नज़रअंदाज़ कर सकते हैं। शेष डेटा वही 32-बाइट r और s मान हैं जिनके बारे में हमने चरण 6 में सीखा था।`,
      javascript: {
        paragraph_two: {
          post_link: `फ़ंक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">decode_sig()</span> को पूरा करें।`,
          return: `इसे [r, s] मानों के साथ BigInts की एक ऐरे लौटानी चाहिए।`,
        },
      },
      python: {
        paragraph_two: {
          post_link: `फ़ंक्शन <span className=" text-green">decode_sig()</span> को पूरा करें।`,
          return: `इसे (r, s) मानों के साथ एक टपल लौटानी चाहिए।`,
        },
      },
      success: `अच्छा किया`,
    },
    validate_signature_three: {
      title: `सिग्नेचर मान्य करें`,
      nav_title: `देखें क्या वैंडरपूल झूठ बोल रहा था`,
      heading: `तो क्या वैंडरपूल झूठा है?!`,
      paragraph_one: `आइए प्रोग्राम के लिए सभी आवश्यक घटक इकट्ठा करें और सत्यापित करें कि वैंडरपूल का सिग्नेचर वास्तव में सातोशी की पब्लिक की से जुड़ी प्राइवेट की से उत्पन्न हुआ था या नहीं! कृपया दिए गए कोड का उपयोग करके <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">verify()</span> फ़ंक्शन को चलाने के लिए आवश्यक गायब पैरामीटर्स भरें।`,
      paragraph_two: `फिर हम प्रोग्राम चलाकर देख सकते हैं कि वैंडरपूल झूठ बोल रहा था या नहीं। ढोल की थाप, कृपया...`,
      success: `यह संदेश दर्शाता है कि सिग्नेचर सातोशी की पब्लिक की से उत्पन्न नहीं हुआ, क्योंकि सत्यापन विफल रहा।`,
    },
    validate_signature_four: {
      title: `सिग्नेचर मान्य करें`,
      nav_title: `सही की ढूँढें`,
      heading: `वैंडरपूल ने वह सिग्नेचर आखिर बनाया कैसे?`,
      paragraph_one: `होलोकैट बीच में बोलती है और कहती है कि BitRey में एक भगोड़े ने हमें उन पब्लिक कीज़ की एक सूची भेजी है जिनका वैंडरपूल आमतौर पर उपयोग करता है—शायद उसने संदेश साइन करने के लिए इन्हीं में से किसी एक की का उपयोग किया हो।`,
      paragraph_two: `कृपया वह की प्रदान करें जो सत्यापन प्रक्रिया को सफलतापूर्वक पूरा करती है, ताकि हम पहचान सकें कि वैंडरपूल ने इस संदेश को साइन करने के लिए कौन-सी पब्लिक की इस्तेमाल की।`,
      paragraph_three: `आइए देखें कि क्या तुम इनमें से किसी एक की का उपयोग करके वैंडरपूल के संदेश और सिग्नेचर को सत्यापित कर सकते हो?`,
      success: `इस पब्लिक की के लिए सिग्नेचर वैध है—यह सातोशी नहीं था!`,
    },
    outro_one: {
      title: `आउट्रो`,
      nav_title: `अध्याय पूरा`,
      heading: `वैंडरपूल ने झूठ बोला!`,
      paragraph_one: `तुमने बिटकॉइन का एक सबसे महत्वपूर्ण सबक सीखा। तुमने भरोसा नहीं किया—तुमने सत्यापित किया।<br><br>ऐसा करके, तुमने पाया कि वैंडरपूल ने संदेश साइन करने के लिए सातोशी की कीज़ का उपयोग नहीं किया, जिससे उसकी पारिवारिक कहानी, उसकी विश्वसनीयता और BitRey की विश्वसनीयता पर बड़ा सवाल खड़ा हो गया।<br><br>अब बस काश तुम उस गाने को अपने दिमाग़ से निकाल पाते।`,
    },
    resources: {
      derive_message_three: {
        op_pushdata_heading: `OP_PUSHDATA`,
        op_pushdata_paragraph_one: `बिटकॉइन स्क्रिप्ट में OP_PUSHDATA ब्लॉकचेन में मनचाहे डेटा के टुकड़ों को सम्मिलित करने में एक महत्वपूर्ण भूमिका निभाता है। यह वास्तव में opcodes की एक पूरी श्रेणी है जो विभिन्न आकारों के डेटा एलिमेंट्स को शामिल करने की अनुमति देती है, जिससे बिटकॉइन की स्क्रिप्टिंग भाषा अधिक लचीली बनती है। यह opcode विशेष रूप से विभिन्न स्मार्ट कॉन्ट्रैक्ट फ़ंक्शनैलिटीज़ और कस्टम ट्रांज़ैक्शन प्रकारों के कार्यान्वयन में महत्वपूर्ण है। चूँकि हमें पता है कि यहाँ 71 बाइट्स का डेटा स्टैक पर पुश किया जाना है, क्या तुम यह निकाल सकते हो कि यह opcode hex में कैसे दर्शाया जाएगा? इन OP_CODES के बारे में और पढ़ने के लिए <Link href="https://en.bitcoin.it/wiki/Script#Constants" target="_blank" className="underline">यहाँ</Link> देखें।`,
      },
      derive_message_four: {
        op_checksig_heading: `OP_CHECKSIG`,
        op_checksig_paragraph_one: `बिटकॉइन स्क्रिप्ट में OP_CHECKSIG यह सुनिश्चित करने के लिए अत्यंत महत्वपूर्ण है कि सही प्राइवेट की ही किसी दिए गए ट्रांज़ैक्शन को खर्च कर सके। लगभग हर बिटकॉइन स्क्रिप्ट में एक OP_CHECKSIG होता है ताकि यह सुनिश्चित किया जा सके कि बिटकॉइन खर्च करने की कोशिश करने वाला व्यक्ति दी गई की के साथ ऐसा कर सकता है। इन OP_CODES के बारे में और पढ़ने के लिए <Link href="https://en.bitcoin.it/wiki/Script#Constants" target="_blank" className="underline">यहाँ</Link> देखें।`,
      },
      derive_message_six: {
        transaction_parts_heading: `ट्रांज़ैक्शन के हिस्से`,
        transaction_parts_one: `वर्ज़न: यह संस्करण बताता है कि ट्रांज़ैक्शन कैसे संगठित होगा।`,
        transaction_parts_two: `इनपुट्स की संख्या: इस ट्रांज़ैक्शन में इनपुट्स की संख्या।`,
        transaction_parts_three: `इनपुट #0 TXID: यह उस ट्रांज़ैक्शन का हैश है जिससे इनपुट #0 खर्च करता है।`,
        transaction_parts_four: `इनपुट #0 इंडेक्स: यह ऊपर दिए गए TXID द्वारा पहचाने गए ट्रांज़ैक्शन का आउटपुट इंडेक्स है जो फ़ंड्स का स्रोत प्रदान करता है।`,
        transaction_parts_five: `Scriptsig: यह वह डेटा है जो ऊपर निर्दिष्ट आउटपुट को खर्च करने को अधिकृत करता है। आमतौर पर इसमें सिग्नेचर्स होते हैं।`,
        transaction_parts_six: `इनपुट #0 सीक्वेंस: यह खर्च किए जा रहे इनपुट का सीक्वेंस नंबर है।`,
        transaction_parts_seven: `आउटपुट्स की संख्या: यह दर्शाता है कि tx में कितने आउटपुट हैं।`,
        transaction_parts_eight: `आउटपुट #0 का मान: यह वह राशि है जो पहले आउटपुट द्वारा खर्च की जाती है, जिसे लिटिल-एंडियन पूर्णांक के रूप में व्यक्त किया जाता है।`,
        transaction_parts_nine: `आउटपुट #0 का scriptPubKey: यह वह स्क्रिप्ट है जो निर्धारित करती है कि फ़ंड्स को खर्च करने के लिए क्या आवश्यक है। आमतौर पर इसमें एक पब्लिक की और अन्य opcodes होते हैं जो एक चुनौती बनाते हैं।`,
        transaction_parts_ten: `आउटपुट #1 का मान: यह वह राशि है जो दूसरे आउटपुट द्वारा खर्च की जाती है, जिसे लिटिल-एंडियन पूर्णांक के रूप में व्यक्त किया जाता है।`,
        transaction_parts_eleven: `आउटपुट #1 का scriptPubKey: यह वह स्क्रिप्ट है जो निर्धारित करती है कि फ़ंड्स को खर्च करने के लिए क्या आवश्यक है। आमतौर पर इसमें एक पब्लिक की और अन्य opcodes होते हैं जो एक चुनौती बनाते हैं।`,
        transaction_parts_twelve: `लॉकटाइम: वह ब्लॉक ऊँचाई जिसके पहले यह ट्रांज़ैक्शन पुष्टि के लिए वैध नहीं होता।`,
      },
      derive_message_seven: {
        sighash_type_flag_heading: `SigHash प्रकार फ़्लैग`,
        sighash_type_flag_paragraph_one: `SigHash फ़्लैग्स बिटकॉइन में एक तंत्र हैं जो यह परिभाषित करते हैं कि ट्रांज़ैक्शन के कौन-से हिस्से उस हैश में शामिल होंगे जिसे प्राइवेट की द्वारा साइन किया जाता है। मूल रूप से, ये साइन करने वाले की प्रतिबद्धता की सीमा को ट्रांज़ैक्शन डेटा के विशिष्ट हिस्सों तक निर्धारित करते हैं। SigHash फ़्लैग एक सिंगल बाइट होता है जो प्रत्येक सिग्नेचर के साथ जोड़ा जाता है और एक ही ट्रांज़ैक्शन के भीतर इनपुट्स के बीच अलग-अलग हो सकता है। SigHash फ़्लैग्स के कई प्रकार होते हैं, जिनके बारे में आप <Link href="https://river.com/learn/terms/s/sighash-flag" target="_blank" className="underline">यहाँ</Link> सीख सकते हैं।`,
      },
      verify_signature_two: {
        tip_one: `JavaScript संकेत: आप <span className="p-1 font-mono bg-[#0000004D] m-1">Buffer.from(someString, 'hex');</span> का उपयोग करके एक hex स्ट्रिंग को बाइट्स के बफ़र में बदल सकते हैं।`,
        signature_verification_heading: `सिग्नेचर सत्यापन`,
        signature_verification_paragraph_one: `सिग्नेचर सत्यापन एक गणितीय एल्गोरिदम है जिसमें एक पक्ष ऐसा डेटा (सिग्नेचर) प्रदान करता है जिसे केवल वही उत्पन्न कर सकता है यदि वह एक गुप्त संख्या (प्राइवेट की) जानता हो। सत्यापन में सिग्नेचर, पब्लिक की और दिए गए संदेश की तुलना शामिल होती है। यदि एल्गोरिदम TRUE बूलियन आउटपुट देता है, तो सिग्नेचर को प्रामाणिक माना जाता है।`,
      },
      verify_signature_three: {
        signature_encoding_heading: `सिग्नेचर एन्कोडिंग`,
        signature_encoding_paragraph_one: `(DER) सिग्नेचर या Distinguished Encoding Rules, बिटकॉइन में ECDSA सिग्नेचर को एन्कोड करने के लिए उपयोग किया जाने वाला एक फ़ॉर्मैट है। ECDSA सिग्नेचर एक प्राइवेट की और साइन किए गए संदेश के हैश का उपयोग करके बनाया जाता है। इसमें दो 32-बाइट संख्याएँ (r, s) होती हैं। इसके कई घटक होते हैं, जिनके बारे में आप <Link href="https://technicaldifficulties.io/2020/07/22/bip-66-unpacking-der-signatures/" target="_blank" className="underline">यहाँ</Link> और जान सकते हैं।`,
      },
      verify_signature_four: {
        eliptic_curve_heading: `एलिप्टिक कर्व डिजिटल सिग्नेचर एल्गोरिदम (ECDSA)`,
        eliptic_curve_paragraph_one: `ECDSA एक क्रिप्टोग्राफ़िक एल्गोरिदम है जिसका उपयोग बिटकॉइन यह सुनिश्चित करने के लिए करता है कि फ़ंड्स केवल उनके वैध मालिकों द्वारा ही खर्च किए जा सकें। पब्लिक की को एलिप्टिक कर्व गुणा के माध्यम से प्राइवेट की से निकाला जाता है, जो गणनात्मक रूप से सरल है। हालाँकि, इस प्रक्रिया को उलटकर पब्लिक की से प्राइवेट की निकालना गणनात्मक रूप से असंभव है। यह एक-तरफ़ा फ़ंक्शन बिटकॉइन की सुरक्षा की आधारशिला है।`,
        public_private_key_heading: `पब्लिक और प्राइवेट कीज़`,
        public_private_key_paragraph_one: `बिटकॉइन में सुरक्षित ट्रांज़ैक्शनों को सुनिश्चित करने के लिए कीज़ की एक जोड़ी का उपयोग किया जाता है। प्राइवेट की, जिसे गुप्त रखा जाता है, ट्रांज़ैक्शनों को साइन करने और बिटकॉइन पते के स्वामित्व को साबित करने के लिए उपयोग होती है। पब्लिक की, जो प्राइवेट की से निकाली जाती है, साझा की जा सकती है और यह सत्यापित करने के लिए उपयोग होती है कि सिग्नेचर प्राइवेट की धारक द्वारा बनाया गया है, बिना प्राइवेट की को उजागर किए।`,
      },
      verify_signature_five: {
        finite_field_arithmetic_heading: `सीमित क्षेत्र अंकगणित`,
        finite_field_arithmetic_paragraph_one: `इस प्रकार का अंकगणित, जिसका उपयोग ECDSA में होता है, एक निश्चित सीमा या क्षेत्र के भीतर संख्याओं से संबंधित होता है। जोड़, घटाव, गुणा और मॉड्यूलर इनवर्स निकालने जैसे ऑपरेशन्स इस क्षेत्र के आकार के सापेक्ष किए जाते हैं। यह बिटकॉइन की क्रिप्टोग्राफी में एलिप्टिक कर्व गणनाओं के लिए आवश्यक है।`,
        ge_and_fe_heading: `ग्रुप एलिमेंट्स (GE) और फ़ील्ड एलिमेंट्स (FE)`,
        ge_and_fe_paragraph_one: `एलिप्टिक कर्व क्रिप्टोग्राफी के संदर्भ में, एक ग्रुप एलिमेंट आम तौर पर एलिप्टिक कर्व पर एक बिंदु को दर्शाता है। इस चैलेंज में, GE ऐसे ही एक बिंदु को संदर्भित करता है जिसके विशिष्ट x और y कोऑर्डिनेट्स होते हैं। FE सीमित क्षेत्र का एक एलिमेंट दर्शाता है, जिसका उपयोग क्षेत्र की सीमाओं के भीतर गणनाओं के लिए किया जाता है।`,
        modular_inverse_heading: `मॉड्यूलर इनवर्स`,
        modular_inverse_paragraph_one: `किसी संख्या a का m मॉड्यूलो में मॉड्यूलर इनवर्स वह संख्या b होती है जिसके लिए (a * b) % m = 1 हो। मॉड्यूलर इनवर्स निकालना ECDSA सिग्नेचर सत्यापन में एक महत्वपूर्ण चरण है। इसका उपयोग सत्यापन प्रक्रिया के दौरान u1 और u2 की गणना में किया जाता है।`,
      },
      validate_signature_one: {
        message_verification_heading: `संदेश सत्यापन का महत्व`,
        message_verification_paragraph_one: `संदेश सत्यापन बिटकॉइन इकोसिस्टम के भीतर संचार की सुरक्षा को बढ़ाता है। यह पक्षों को संदेशों की प्रामाणिकता और अखंडता सत्यापित करने की अनुमति देता है, जो उन स्थितियों में मूल्यवान होता है जहाँ भरोसा और सत्यापन आवश्यक होते हैं, जैसे पीयर-टू-पीयर ट्रांज़ैक्शनों या स्मार्ट कॉन्ट्रैक्ट में पक्षों के बीच संचार में। इसके अलावा, संदेश सत्यापन विभिन्न अनुप्रयोगों के लिए एक आधार के रूप में काम करता है, जिनमें पहचान सत्यापन और किसी विशेष बिटकॉइन पते के स्वामित्व का प्रमाण शामिल है। यह क्रिप्टोग्राफ़िक आश्वासन की एक परत जोड़ता है, जो बिटकॉइन नेटवर्क की ट्रस्टलेस और विकेंद्रीकृत प्रकृति को मज़बूत करता है।`,
      },
      validate_signature_two: {
        base64_encoding_heading: `Base64 एन्कोडिंग`,
        base64_encoding_paragraph_one: `Base64 एक बुनियादी बाइट-से-टेक्स्ट एन्कोडिंग स्कीम है जो डेटा को बाइट्स में बदलने की अनुमति देती है ताकि उन्हें बफ़र्स में उपयोग किया जा सके, या बाइट्स से टेक्स्ट में इस तरह बदला जा सके कि URL पाथ्स और क्वेरी पैरामीटर्स के साथ कोई समस्या न हो। यह base58 एन्कोडिंग स्कीम से अलग है क्योंकि इसमें वे मिलते-जुलते कैरेक्टर्स (शून्य, बड़ा 'O', बड़ा 'I', और छोटा 'l') शामिल रहते हैं, जो अन्यथा किसी उपयोगकर्ता को एन्कोडेड संदेश कॉपी या डिक्टेट करते समय भ्रमित कर सकते हैं।`,
      },
      validate_signature_three: {
        signing_and_ownership_heading: `संदेश साइनिंग और स्वामित्व`,
        signing_and_ownership_paragraph_one: `बिटकॉइन की छद्म-गुमनामी के कारण, हम निश्चित रूप से बहुत सीमित चीज़ें ही साबित कर सकते हैं, क्योंकि किसी की का मालिक संदेश साइन करने से मना कर सकता है या जानबूझकर गलत की से संदेश साइन कर सकता है। हम केवल यह साबित कर सकते हैं कि जो की एक अवैध सिग्नेचर बनाती है, वह उस की से मेल नहीं खाती जो किसी संदेश को साइन कर सकती है।`,
      },
      validate_signature_four: {
        one_for_one_heading: `एक के लिए एक`,
        one_for_one_paragraph_one: `ECDSA की विश्वसनीयता और सुरक्षा सुनिश्चित करने के लिए, एक प्राइवेट की द्वारा बनाया गया सिग्नेचर केवल उसी से संबंधित पब्लिक की द्वारा सत्यापित किया जा सकता है। यदि अलग-अलग प्राइवेट कीज़ एक ही पब्लिक की या सिग्नेचर बना सकतीं, तो यह ECDSA की सुरक्षा और विश्वसनीयता को कमजोर कर देता। इसके माध्यम से हम जान सकते हैं कि जिस पब्लिक की ने इस संदेश को साइन किया है, उसी के पास इस बिटकॉइन का स्वामित्व है।`,
      },
    },
  },
  chapter_six: {
    title: `चाबी धारक (The Keyholder)`,
    paragraph_one: `आह! वेंडरपूल (Vanderpoole) उसके फर्जी दावों को उजागर करने के लिए आपके पीछे पड़ा है। लेकिन इस तथ्य के बावजूद कि अब सब कुछ साफ हो चुका है, बहुत से डरे हुए लोग अभी भी उस मिथक से चिपके हुए हैं जिसे वेंडरपूल ने अपने, अपने परिवार और अपने कथित पूर्वजों के चारों ओर बनाया था। समय डरावना है, और लोगों को एक नायक की जरूरत है। दुर्भाग्य से, कई लोगों के लिए, वह उनके पास मौजूद सबसे अच्छा विकल्प है।`,
    intro_one: {
      title: `परिचय`,
      nav_title: `क्या वह सच में सातोशी था?`,
      paragraph_one: `—सातोशी नाकामोतो: "शाबाश। अब दुनिया खुद देख सकती है कि वेंडरपूल एक धोखाधड़ी है। भले ही कुछ लोग अभी इस पर विश्वास न करें, लेकिन हमारा काम पूरा होने से पहले वे जरूर करेंगे।"`,
      paragraph_two: `आप एक पल के लिए रुकते हैं और महसूस करते हैं कि इस बिंदु तक हर संदेश पर "सातोशी नाकामोतो" के हस्ताक्षर थे। आपने अभी मान लिया था कि यह किसी ऐसे व्यक्ति द्वारा इस्तेमाल किया गया छद्म नाम (pseudonym) है जो बिटकॉइन के मूल सिद्धांतों का पालन करता है। निश्चित रूप से, वे असली सातोशी नाकामोतो नहीं हो सकते। लेकिन, अंत में आप तय करते हैं, कि यह पूछना उचित है।`,
      paragraph_three: `—"यह सुनने में मुझे बेवकूफ बना सकता है, लेकिन क्या आप असली सातोशी हैं?"`,
    },
    intro_two: {
      title: `परिचय`,
      nav_title: `मिका 3000 को भुगतान`,
      paragraph_one: `—होलोकैट (HOLOCAT): "शायद हाल ही में आपकी बेवकूफी दिखाने वाली यह इकलौती बात नहीं है।"`,
      paragraph_two: `—सातोशी नाकामोतो: "बिटकॉइन कई साल पहले ही अपने निर्माता के नियंत्रण से बहुत आगे निकल चुका है। इससे कोई फर्क नहीं पड़ता कि वेंडरपूल या मैं सातोशी होते, या उनके वंशजों में से एक। बिटकॉइन इसके समुदाय द्वारा परिभाषित किया गया है और इसे किसी एक व्यक्ति या संस्था द्वारा—सातोशी सहित—हथियाया नहीं जा सकता है। इसे साबित करना ही असली लड़ाई है। मुझे आशा है कि आपको बुरा नहीं लगेगा, लेकिन मैंने आपके सनकी फ्रीलांस रिपोर्टर मित्र से संपर्क करने के लिए कहा है।"`,
      paragraph_three: `—उसने क्या?`,
      paragraph_four: `—टिंग।`,
      paragraph_five: `—होलोकैट: मुझे बूप (boop) करना मत भूलना।`,
      paragraph_six: `—मिका 3000 (MIKA 3000): "आपके पास हिम्मत है, लेकिन सिर्फ हिम्मत काफी नहीं है। आपने जो खोजा वह तो बस शुरुआत है। इस कहानी में और भी बहुत कुछ है, लेकिन 'और' का क्या मतलब है, यह निश्चित रूप से जानने के लिए हमें वेंडरपूल के निजी द्वीप पर जाना होगा। इसमें बहुत खर्च होगा, इसलिए मुझे उस मल्टीसिग (multisig) वॉलेट से फंड निकालने में आपकी मदद की जरूरत है जिसे आपने सेटअप करने में मेरी मदद की थी। आपके पास अभी भी मेरी एक चाबी है, है ना?"`,
    },
    in_out_one: {
      title: `इन और आउट (The ins and outs)`,
      nav_title: `बिना खर्च किया गया UTXO`,
      paragraph_one: `मिका 3000 को वेंडरपूल के निजी द्वीप की यात्रा के लिए गियर खरीदने हेतु 1 BTC की आवश्यकता है। आप उसे अपने अध्याय 3 के माइनिंग पुरस्कारों में से 1 BTC भेजने का निर्णय लेते हैं, जिसे माइनिंग पूल द्वारा आपके द्वारा अध्याय 4 में बनाए गए पते पर भेजा गया था।`,
      paragraph_two: `आप अपना बिटकॉइन फुल नोड खोलते हैं और यह देखने के लिए कमांड चलाते हैं कि आपका पैसा ब्लॉकचेन में कहां है।`,
      paragraph_three: `यह एक अनस्पेंट ट्रांजैक्शन आउटपुट (unspent transaction output - जिसे "UTXO" भी कहा जाता है) है। आप शायद अध्याय 4 से अपने कंप्रेस्ड पब्लिक की हैश (compressed public key hash) और पते को पहचान लेंगे। राशि भी सही लग रही है: 1.61 BTC।`,
    },
    in_out_two: {
      title: `इन और आउट (The ins and outs)`,
      nav_title: `प्राप्त करने वाला पता`,
      paragraph_one: `मिका 3000 आपको अपना 1 BTC योगदान भेजने के लिए एक पता देती है:`,
      paragraph_two: `हम्म, वह पता आपके पते से बहुत लंबा लग रहा है! मुझे आश्चर्य है क्यों...`,
      paragraph_three: `हमें एक ट्रांजैक्शन बनाना और साइन करना होगा जो आपके 1.61 BTC में से एक को इस पते पर भेजे। हमने अध्याय 5 में सातोशी के ट्रांजैक्शन स्ट्रक्चर को देखा था लेकिन आपका थोड़ा अलग होगा। आज, ट्रांजैक्शन बनाने के नए तरीके मौजूद हैं। हम 'सेग्रिगेटेड विटनेस' (Segregated Witness) नामक प्रोटोकॉल का उपयोग करेंगे जो ट्रांजैक्शन वर्जन को 2 पर सेट करता है।`,
    },
    in_out_three: {
      title: `इन और आउट (The ins and outs)`,
      nav_title: `ट्रांजैक्शन के चरण`,
      paragraph_one: `सेग्रिगेटेड विटनेस (Segregated Witness) ट्रांजैक्शन ठीक अपने पुराने पूर्ववर्तियों (legacy) की तरह ही काम करते हैं। इसमें वर्जन और लॉकटाइम जैसे कुछ ग्लोबल वैल्यू होते हैं। इसमें इनपुट्स की एक एरे (UTXOs जिन्हें हम खर्च करना चाहते हैं) और आउटपुट्स की एक एरे (नए UTXOs जिन्हें हम बनाना चाहते हैं, ताकि अन्य लोग भविष्य में खर्च कर सकें) होती है। गवाहों (witnesses) की भी एक एरे होगी, प्रत्येक इनपुट के लिए एक। यहीं पर scriptSig के बजाय सिग्नेचर और स्क्रिप्ट जाएंगे।`,
      paragraph_two: `इन सभी घटकों के लिए संदेश क्रमांकन (message serializations) यहाँ <Link href="https://en.bitcoin.it/wiki/Protocol_documentation#tx" target="_blank" className="underline">दस्तावेज़</Link> और <Link href="https://github.com/bitcoinbook/bitcoinbook/blob/6d1c26e1640ae32b28389d5ae4caf1214c2be7db/ch06_transactions.adoc" target="_black" className="underline" >यहाँ</Link> दिया गया है।`,
    },
    in_out_four: {
      normal: {
        title: `इन और आउट`,
        nav_title: `इनपुट क्लास`,
        heading: `इनपुट क्लास कार्यान्वयन को देखना`,
        paragraph_one: `यहाँ हमारे पास दो क्लासेस के लिए कोड है: एक <span className="font-bold">Input</span> क्लास और एक <span className="font-bold">Outpoint</span> (आउटपुट नहीं!) क्लास।`,
        paragraph_two: `इनपुट्स बिना खर्च किए गए ट्रांजैक्शन आउटपुट (UTXOs) से आते हैं। यदि आप <span className="text-green p-1 font-mono bg-[#00000033] m-1 text-base">from_output()</span> मेथड को आउटपुट का विवरण प्रदान करते हैं, तो यह Input क्लास का एक इंस्टेंस (instance) बना देगा:`,
        paragraph_three: `पहले दो आर्गुमेंट्स (arguments) हैं:`,
        paragraph_four: `1. <span className="font-bold">txid: </span> उस ट्रांजैक्शन की आईडी जिसने आउटपुट बनाया, और`,
        paragraph_five: `2. <span className="font-bold">vout: </span> ट्रांजैक्शन की आउटपुट लिस्ट में उस आउटपुट का इंडेक्स (index)।`,
        paragraph_six: `एक साथ, जानकारी के ये दो टुकड़े एक <span className="font-bold">Outpoint</span> बनाते हैं। अंततः हम txid और vout वैल्यू पास करेंगे जो पिछले अभ्यास में <span className="text-green p-1 font-mono bg-[#00000033] m-1 text-base">listunspent</span> कमांड चलाने से मिले थे।`,
        paragraph_seven: `दूसरे दो आर्गुमेंट्स उस आउटपुट की वैल्यू हैं जिसे हम खर्च करना चाहते हैं (सतोशी में) और कुछ जिसे स्क्रिप्टकोड (scriptcode) कहा जाता है। उस डेटा की बाद तक आवश्यकता नहीं है इसलिए चलिए अस्थायी रूप से खाली बाइट एरे का उपयोग करते हैं।`,
        paragraph_eight: {
          a: `बिटकॉइन में हैश`,
          b: {
            text: ` उलटे (reversed)`,
            question: `हम बिटकॉइन में हैश को क्यों उलटते हैं?`,
            href: `https://chat.bitcoinsearch.xyz/?author=holocat&question=why%2520are%2520hashes%2520reversed%2520in%2520bitcoin`,
          },
          c: ` होते हैं, लेकिन केवल तब जब उपयोगकर्ता के सामने प्रस्तुत किए जाते हैं या दर्ज किए जाते हैं। जब एक हैश हेक्साडेसिमल फॉर्मेट में प्रदान किया जाता है, तो रॉ बाइट्स के रूप में डेटा को स्टोर या ट्रांसमिट करने से पहले बाइट ऑर्डर को उलट दिया जाना चाहिए।`,
        },
        paragraph_nine: `आप इसका एक उदाहरण <span className="text-green p-1 font-mono bg-[#00000033] m-1 text-base">from_output()</span> मेथड में देख सकते हैं जहाँ यह txid आर्गुमेंट को हैंडल करता है।`,
        paragraph_ten: `हमें एक <span className="text-green p-1 font-mono bg-[#00000033] m-1 text-base">serialize()</span> मेथड की भी आवश्यकता है जो स्पेसिफिकेशन के अनुसार बाइट एरे रिटर्न करे। इसी तरह नेटवर्क पर नोड्स के बीच ट्रांजैक्शन वास्तव में भेजा जाता है, और इसे ब्लॉक में व्यक्त किया जाता है:`,
        heading_three: `Outpoint`,
        table_one: {
          heading: {
            one: `विवरण`,
            two: `नाम`,
            three: `प्रकार`,
            four: `साइज`,
          },
          row_one: {
            column: {
              one: `खर्च किए जा रहे ट्रांजैक्शन का हैश`,
              two: `txid`,
              three: `bytes`,
              four: `32`,
            },
          },
          row_two: {
            column: {
              one: `ट्रांजैक्शन की आउटपुट एरे में खर्च किए जा रहे आउटपुट की स्थिति`,
              two: `index`,
              three: `int`,
              four: `4`,
            },
          },
        },
        heading_four: `Input`,
        table_two: {
          row_one: {
            column: {
              one: `txid और आउटपुट इंडेक्स जिससे खर्च किया जा रहा है`,
              two: `outpoint`,
              three: `bytes`,
              four: `36`,
            },
          },
          row_two: {
            column: {
              one: `ScriptSig की लंबाई (Segregated Witness के लिए हमेशा 0)`,
              two: `length`,
              three: `int`,
              four: `1`,
            },
          },
          row_three: {
            column: {
              one: `Segregated Witness के लिए हमेशा खाली`,
              two: `script`,
              three: `bytes`,
              four: `0`,
            },
          },
          row_four: {
            column: {
              one: `डिफ़ॉल्ट वैल्यू 0xffffffff है लेकिन रिलेटिव टाइमलॉक्स के लिए उपयोग किया जा सकता है`,
              two: `sequence`,
              three: `int`,
              four: `4`,
            },
          },
        },
        paragraph_eleven: {
          a: `याद रखें: बिटकॉइन में पूर्णांक (integers) `,
          b: {
            text: `लिटिल-एंडियन (little-endian)`,
            question: `एंडियननेस (endianness) क्या है?`,
            href: `https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520endianness%253F`,
          },
          c: ` क्रम में सीरियलाइज किए जाते हैं।`,
        },
        success: `Input क्लास सही लग रही है। बहुत बढ़िया!`,
      },
      hard: {
        title: `इन और आउट`,
        nav_title: `इनपुट क्लास बनाएँ`,
        heading: `Input क्लास के कार्यान्वयन को पूरा करें`,
        paragraph_one: `इसमें निम्नलिखित मेथड होना चाहिए:`,
        paragraph_two: `पहले दो आर्गुमेंट्स ट्रांजैक्शन आईडी और उस ट्रांजैक्शन के आउटपुट का इंडेक्स हैं जिससे आप खर्च करना चाहते हैं।`,
        paragraph_three: `अंततः हम txid और vout वैल्यू पास करेंगे जो आपको ऊपर listunspent से मिले थे। ध्यान दें कि बिटकॉइन में हैश लिटिल-एंडियन होते हैं, जिसका अर्थ है कि आपको txid स्ट्रिंग के बाइट ऑर्डर को उलटना होगा!`,
        paragraph_four: `दूसरे दो आर्गुमेंट्स उस आउटपुट की वैल्यू (सतोशी में) और कुछ जिसे स्क्रिप्टकोड कहा जाता है, हैं। अभी के लिए, बस इस डेटा को Input क्लास की प्रॉपर्टीज के रूप में स्टोर करें, हमें स्टेप 6 तक इनकी आवश्यकता नहीं होगी।`,
        paragraph_five: `हमें एक <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">serialize()</span> मेथड की भी आवश्यकता है जो स्पेसिफिकेशन के अनुसार बाइट एरे रिटर्न करे:`,
        heading_two: `Outpoint`,
        table_one: {
          heading: {
            one: `विवरण`,
            two: `नाम`,
            three: `प्रकार`,
            four: `साइज`,
          },
          row_one: {
            column: {
              one: `खर्च किए जा रहे ट्रांजैक्शन का हैश`,
              two: `txid`,
              three: `bytes`,
              four: `32`,
            },
          },
          row_two: {
            column: {
              one: `ट्रांजैक्शन की आउटपुट एरे में खर्च किए जा रहे आउटपुट की स्थिति`,
              two: `index`,
              three: `int`,
              four: `4`,
            },
          },
        },
        heading_three: `Input`,
        table_two: {
          row_one: {
            column: {
              one: `txid और आउटपुट इंडेक्स जिससे खर्च किया जा रहा है`,
              two: `outpoint`,
              three: `bytes`,
              four: `36`,
            },
          },
          row_two: {
            column: {
              one: `ScriptSig की लंबाई (Segregated Witness के लिए हमेशा 0)`,
              two: `length`,
              three: `int`,
              four: `1`,
            },
          },
          row_three: {
            column: {
              one: `Segregated Witness के लिए हमेशा खाली`,
              two: `script`,
              three: `bytes`,
              four: `0`,
            },
          },
          row_four: {
            column: {
              one: `डिफ़ॉल्ट वैल्यू 0xffffffff है लेकिन रिलेटिव टाइमलॉक्स के लिए उपयोग किया जा सकता है`,
              two: `sequence`,
              three: `int`,
              four: `4`,
            },
          },
        },
        success: `Input क्लास सही लग रही है। बहुत बढ़िया!`,
      },
    },
    in_out_five: {
      title: `इन और आउट`,
      nav_title: `आउटपुट क्लास बनाएँ`,
      heading: `Output क्लास के कार्यान्वयन को पूरा करें`,
      paragraph_one: `Input क्लास की तरह ही, इसमें एक मेथड <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">from_options()</span> की आवश्यकता है जो यूजर-प्रोवाइडेड डेटा से Output ऑब्जेक्ट का निर्माण करेगा:`,
      paragraph_two: `यह स्ट्रिंग के रूप में एक बिटकॉइन पता (जैसे मिका 3000 का पता) और पूर्णांक (integer) के रूप में एक वैल्यू स्वीकार करता है। वैल्यू सतोशी की संख्या के रूप में व्यक्त की जाती है! याद रखें, 1 BTC = 10,00,00,000 सतोशी। आपको पते को वर्जन और डेटा घटकों में डिकोड करने के लिए फिर से हमारी bech32 लाइब्रेरी का उपयोग करना होगा।
        क्लास को एक <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">serialize()</span> मेथड की भी आवश्यकता है जो स्पेसिफिकेशन के अनुसार बाइट एरे रिटर्न करे:`,
      heading_two: `Output`,
      table: {
        heading: {
          one: `विवरण`,
          two: `नाम`,
          three: `प्रकार`,
          four: `साइज`,
        },
        row_one: {
          column: {
            one: `भेजी जा रही सतोशी की संख्या।`,
            two: `value`,
            three: `bytes`,
            four: `8`,
          },
        },
        row_two: {
          column: {
            one: `अगली स्क्रिप्ट की कुल लंबाई ("विटनेस प्रोग्राम")।`,
            two: `length`,
            three: `int`,
            four: `1`,
          },
        },
        row_three: {
          column: {
            one: `सेग्रिगेटेड विटनेस वर्जन। bech32 पते से प्राप्त किया गया।`,
            two: `version`,
            three: `int`,
            four: `1`,
          },
        },
        row_four: {
          column: {
            one: `अगले विटनेस प्रोग्राम डेटा की लंबाई।`,
            two: `length`,
            three: `int`,
            four: `1`,
          },
        },
        row_five: {
          column: {
            one: `bech32 पते से प्राप्त डेटा घटक।`,
            two: `index`,
            three: `bytes`,
            four: `(var)`,
          },
        },
      },
      paragraph_three: `भूलें नहीं: बिटकॉइन में पूर्णांक लिटिल-एंडियन सीरियलाइज किए जाते हैं!`,
      success: `Output क्लास सही लग रही है। बहुत बढ़िया!`,
    },
    put_it_together_one: {
      title: `सब कुछ एक साथ लाना`,
      normal: {
        title: `सब कुछ एक साथ लाना`,
        nav_title: `ट्रांजैक्शन डाइजेस्ट बनाएँ`,
        heading: `ट्रांजैक्शन डाइजेस्ट`,
        paragraph_one: `अध्याय 5 में हमने सीखा कि ट्रांजैक्शन साइन करने के लिए हमें पहले इसके डेटा को पुनर्व्यवस्थित और हैश करके एक मैसेज में बदलना होगा, जो हमारे साइनिंग एल्गोरिदम के लिए रॉ इनपुट्स में से एक बन जाता है। चूंकि हम अब सेग्रिगेटेड विटनेस का उपयोग कर रहे हैं, हमें अपडेटेड ट्रांजैक्शन डाइजेस्ट एल्गोरिदम को भी लागू करने की आवश्यकता है जो <Link href="https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki" target="_blank" className="underline">BIP 143</Link> में निर्दिष्ट है।`,
        paragraph_two: `याद रखें कि प्रत्येक ट्रांजैक्शन इनपुट को अपने स्वयं के सिग्नेचर की आवश्यकता होती है, और इसलिए डाइजेस्ट एल्गोरिदम के कुछ घटकों को कैश (cache) और पुन: उपयोग किया जा सकता है लेकिन अन्य इस बात पर निर्भर करेंगे कि किस इनपुट को साइन किया जा रहा है! ट्रांजैक्शन मेथड <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">digest(input_index)</span> को पूरा करें जो इनपुट साइन करने के लिए 32-बाइट मैसेज की गणना करता है।`,
        list_heading: `कुछ नोट्स:`,
        list_one: `"Double SHA-256" या dSHA256 = sha256(sha256(data))`,
        list_two: `value उस आउटपुट में सतोशी की राशि है जिससे खर्च किया जा रहा है। हमने इसे स्टेप 2 में अपनी Input क्लास में जोड़ा था, और अब तक इसे क्लास के अंदर सेव करके रखा था।`,
        list_three: `scriptcode रॉ बिटकॉइन स्क्रिप्ट है जिसका मूल्यांकन किया जा रहा है। हमने इसे भी स्टेप 2 में अपनी Input क्लास में जोड़ा था।`,
        list_four: `सभी पूर्णांक लिटिल-एंडियन के रूप में एनकोड किए गए हैं!`,
        paragraph_three: `हम अगले भाग में इस पर और गहराई से चर्चा करेंगे, लेकिन अपने पे-टू-विटनेस-पब्लिक-की-हैश (P2WPKH) पते से खर्च करने के लिए, आपका स्क्रिप्टकोड होगा:`,
        paragraph_four: `...जो निम्नलिखित बिटकॉइन स्क्रिप्ट में डिकोड होता है।`,
        paragraph_five: `स्क्रिप्टकोड के बारे में अधिक जानकारी के लिए <Link href="https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki" target="_blank" className="underline">BIP 143</Link> देखें।`,
        paragraph_six: `रॉ ट्रांजैक्शन में एक प्रीइमेज (preimage) होता है जो निम्नलिखित का सीरियलाइजेशन है:`,
        headings: {
          item_one: `विवरण`,
          item_two: `नाम`,
          item_three: `प्रकार`,
          item_four: `साइज`,
        },
        table: {
          row_one: {
            item_one: `ट्रांजैक्शन वर्जन, डिफ़ॉल्ट 2`,
            item_two: `version`,
            item_three: `int`,
            item_four: `4`,
          },
          row_two: {
            item_one: `सभी इनपुट्स से सभी आउटपॉइंट्स का dSHA256, सीरियलाइज्ड`,
            item_two: `bytes`,
            item_three: `bytes`,
            item_four: `32`,
          },
          row_three: {
            item_one: `सभी इनपुट्स से सभी सीक्वेंस वैल्यू का dSHA256, सीरियलाइज्ड`,
            item_two: `sequences`,
            item_three: `bytes`,
            item_four: `32`,
          },
          row_four: {
            item_one: `साइन किए जा रहे सिंगल इनपुट का सीरियलाइज्ड आउटपॉइंट`,
            item_two: `outpoint`,
            item_three: `bytes`,
            item_four: `36`,
          },
          row_five: {
            item_one: `आउटपुट स्क्रिप्ट जिससे खर्च किया जा रहा है`,
            item_two: `scriptcode`,
            item_three: `bytes`,
            item_four: `(var)`,
          },
          row_six: {
            item_one: `साइन किए जा रहे सिंगल इनपुट द्वारा खर्च की जा रही सतोशी वैल्यू`,
            item_two: `value`,
            item_three: `int`,
            item_four: `8`,
          },
          row_seven: {
            item_one: `साइन किए जा रहे सिंगल इनपुट की सीक्वेंस वैल्यू`,
            item_two: `sequence`,
            item_three: `int`,
            item_four: `4`,
          },
          row_eight: {
            item_one: `सभी आउटपुट्स का dSHA256, सीरियलाइज्ड`,
            item_two: `outputs`,
            item_three: `bytes`,
            item_four: `32`,
          },
          row_nine: {
            item_one: `ट्रांजैक्शन लॉकटाइम, डिफ़ॉल्ट 0`,
            item_two: `locktime`,
            item_three: `int`,
            item_four: `4`,
          },
          row_ten: {
            item_one: `सिग्नेचर हैश टाइप, हम "ALL" इंगित करने के लिए 1 का उपयोग करेंगे`,
            item_two: `sighash`,
            item_three: `int`,
            item_four: `4`,
          },
        },
        paragraph_seven: `अंत में, जिस संदेश को हम साइन करते हैं वह इस सभी सीरियलाइज्ड डेटा का डबल SHA-256 है।`,
        success: `digest() मेथड सही लग रहा है। बहुत बढ़िया!`,
      },
      hard: {
        title: `सब कुछ एक साथ लाना`,
        nav_title: `विटनेस क्लास बनाएँ`,
        heading: `Witness क्लास के कार्यान्वयन को पूरा करें`,
        paragraph_one: `इसमें निम्नलिखित मेथड होना चाहिए, जो एक बाइट एरे स्वीकार करता है और उस आइटम को विटनेस स्टैक में जोड़ता है।`,
        paragraph_two: `इसे एक <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">serialize()</span> मेथड की भी आवश्यकता होगी जो सीरियलाइज्ड विटनेस स्टैक रिटर्न करे।`,
        subheading_one: `विटनेस स्टैक (Witness stack)`,
        headings: {
          item_one: `विवरण`,
          item_two: `नाम`,
          item_three: `प्रकार`,
          item_four: `साइज`,
        },
        table_one: {
          row_one: {
            item_one: `विटनेस स्टैक में आइटम्स की संख्या`,
            item_two: `count`,
            item_three: `int`,
            item_four: `1`,
          },
          row_two: {
            item_one: `सीरियलाइज्ड स्टैक आइटम्स`,
            item_two: `items`,
            item_three: `(items)`,
            item_four: `(var)`,
          },
        },
        subheading_two: `विटनेस स्टैक आइटम`,
        table_two: {
          row_one: {
            item_one: `अगले स्टैक आइटम की कुल लंबाई`,
            item_two: `length`,
            item_three: `int`,
            item_four: `1`,
          },
          row_two: {
            item_one: `स्टैक आइटम के रॉ बाइट्स`,
            item_two: `data`,
            item_three: `bytes`,
            item_four: `(var)`,
          },
        },
        success: `Witness क्लास सही लग रही है। बहुत बढ़िया!`,
      },
    },
    put_it_together_two: {
      normal: {
        title: `सब कुछ एक साथ लाना`,
        nav_title: `विटनेस क्लास बनाएँ`,
        heading: `साइन करें और विटनेस को पॉप्युलेट करें!`,
        paragraph_one: `पिछले अध्याय में, हमने कुछ महत्वपूर्ण ECDSA सिग्नेचर वेरिफिकेशन कोड लिखा था। अब, एक वैध सिग्नेचर बनाने के लिए, हम उस कोड को लेंगे और उसे थोड़ा पुनर्व्यवस्थित करेंगे।`,
        paragraph_two: `इस अभ्यास में हम ECDSA साइनिंग एल्गोरिदम के पीछे के कुछ गणित को लागू करेंगे। यह कैसे काम करता है, इस पर अधिक जानकारी के लिए इन संसाधनों को देखें:`,
        paragraph_three: `• <Link href="https://en.wikipedia.org/wiki/Elliptic_Curve_Digital_Signature_Algorithm" target="_blank" className="underline">Elliptic Curve Digital Signature Algorithm</Link> के लिए विकिपीडिया पेज`,
        paragraph_four: `• <Link href="https://www.secg.org/sec1-v2.pdf#subsubsection.4.1.3" target="_blank" className="underline">Standards for Efficient Cryptography 1 (SEC 1)</Link>: पेज 44, सेक्शन 4.1.3`,
        heading_one: `स्टेप 1`,
        paragraph_five: `Transaction क्लास में, एक मेथड <span className="text-green p-1 text-base font-mono bg-[#0000004D] m-1">compute_input_signature(index, key)</span> है जो एक इनपुट का इंडेक्स नंबर और एक प्राइवेट की (32-बाइट पूर्णांक, या जावास्क्रिप्ट में BigInt) स्वीकार करता है। इस मेथड को पूरा करें ताकि यह चुने हुए इनपुट के लिए मैसेज डाइजेस्ट की गणना करे। हमारे पिछले स्टेप के <span className="text-green p-1 text-base font-mono bg-[#0000004D] m-1">digest()</span> मेथड का उपयोग करें, फिर दो 32-बाइट पूर्णांकों के रूप में एक ECDSA सिग्नेचर रिटर्न करें: <span className="italic">r</span> और <span className="italic">s</span>।`,
        heading_two: `स्टेप 2`,
        paragraph_six: `साइनिंग एल्गोरिदम के लिए, बिटकॉइन प्रोटोकॉल को एक और चीज़ की आवश्यकता होती है। <span className="italic">s</span> वैल्यू "लो" (low) होनी चाहिए, जिसका अर्थ है कर्व के ऑर्डर के आधे से कम। इस चेक को <span className="text-green p-1 text-base font-mono bg-[#0000004D] m-1">compute_input_signature()</span> में जोड़ें।`,
        paragraph_seven: `अधिक जानने के लिए <Link href="https://github.com/bitcoin/bips/blob/master/bip-0146.mediawiki#low_s" target="_blank" className="underline">BIP 146</Link> देखें।`,
        heading_three: `स्टेप 3`,
        paragraph_eight: `मेथड <span className="text-green p-1 text-base font-mono bg-[#0000004D] m-1">sign_input(index, key)</span> को पूरा करें ताकि यह <span className="text-green p-1 text-base font-mono bg-[#0000004D] m-1"> compute_input_signature(index, key)</span> को कॉल करे। रिटर्न वैल्यू को हैंडल करते समय, <span className="italic">r</span> और <span className="italic">s</span> को DER नामक एल्गोरिदम के साथ एनकोड करने की आवश्यकता होती है जिसे हमने आपके लिए लागू किया है।`,
        heading_four: `स्टेप 4`,
        paragraph_nine: `बिटकॉइन को DER-सिग्नेचर के अंत में एक अतिरिक्त बाइट की आवश्यकता होती है। यह बाइट "sighash type" का प्रतिनिधित्व करता है। अभी के लिए हम इसके लिए हमेशा बाइट <span className="p-1 text-base font-mono bg-[#0000004D] m-1">0x01</span> का उपयोग करेंगे, जो "SIGHASH ALL" को दर्शाता है।`,
        heading_five: `स्टेप 5`,
        paragraph_ten: `अंतिम चरण दो स्टैक आइटम्स के साथ एक Witness ऑब्जेक्ट बनाना है: अभी बनाया गया DER एनकोडेड सिग्नेचर ब्लॉब, और आपकी कंप्रेस्ड पब्लिक की। सिग्नेचर को पहले पुश करें, उसके बाद पब्लिक की।`,
        paragraph_eleven: `विटनेस स्टैक ऑब्जेक्ट को ट्रांजैक्शन ऑब्जेक्ट के विटनेस एरे में जोड़ें।`,
        success: `compute_input_signature() और sign_input() मेथड्स सही लग रहे हैं। बहुत बढ़िया!`,
      },
      hard: {
        title: `सब कुछ एक साथ लाना`,
        nav_title: `ट्रांजैक्शन को सीरियलाइज करें`,
        heading: `Transaction क्लास के कार्यान्वयन को पूरा करें`,
        paragraph_one: `इसमें ग्लोबल प्रॉपर्टीज लॉकटाइम और वर्जन के साथ-साथ इनपुट्स, आउटपुट्स और विटनेस स्टैक की एक एरे होनी चाहिए।`,
        paragraph_two: `इसे एक <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">serialize()</span> मेथड की आवश्यकता होगी जो बिटकॉइन p2p नेटवर्क पर प्रसारण के लिए फॉर्मेटेड बाइट्स के रूप में संपूर्ण ट्रांजैक्शन को आउटपुट करे।`,
        headings: {
          item_one: `विवरण`,
          item_two: `नाम`,
          item_three: `प्रकार`,
          item_four: `साइज`,
        },
        table: {
          row_one: {
            item_one: `वर्तमान में 2`,
            item_two: `version`,
            item_three: `int`,
            item_four: `4`,
          },
          row_two: {
            item_one: `सेग्रिगेटेड विटनेस के लिए ठीक 0x0001 होना चाहिए`,
            item_two: `flags`,
            item_three: `bytes`,
            item_four: `2`,
          },
          row_three: {
            item_one: `इनपुट्स की संख्या`,
            item_two: `in count`,
            item_three: `int`,
            item_four: `1`,
          },
          row_four: {
            item_one: `सभी ट्रांजैक्शन इनपुट्स, सीरियलाइज्ड`,
            item_two: `inputs`,
            item_three: `Inputs[]`,
            item_four: `(var)`,
          },
          row_five: {
            item_one: `आउटपुट्स की संख्या`,
            item_two: `out count`,
            item_three: `int`,
            item_four: `1`,
          },
          row_six: {
            item_one: `सभी ट्रांजैक्शन आउटपुट्स, सीरियलाइज्ड`,
            item_two: `outputs`,
            item_three: `Outputs[]`,
            item_four: `(var)`,
          },
          row_seven: {
            item_one: `सभी विटनेस स्टैक, सीरियलाइज्ड`,
            item_two: `witness`,
            item_three: `Witnesses[]`,
            item_four: `(var)`,
          },
          row_eight: {
            item_one: `0 पर सेट करना अंतिमता (finality) दर्शाता है`,
            item_two: `locktime`,
            item_three: `int`,
            item_four: `4`,
          },
        },
        paragraph_three: `ध्यान दें कि विटनेस के लिए कोई "count" वैल्यू नहीं है। ऐसा इसलिए है क्योंकि विटनेस स्टैक की संख्या हमेशा इनपुट्स की संख्या के ठीक बराबर होनी चाहिए।`,
        success: `serialize() मेथड सही लग रहा है। बहुत बढ़िया!`,
      },
    },
    put_it_together_three: {
      normal: {
        title: `सब कुछ एक साथ लाना`,
        nav_title: `ट्रांजैक्शन साइन करें`,
        heading: `Transaction क्लास के कार्यान्वयन को पूरा करें`,
        paragraph_one: `हमारे ट्रांजैक्शन को पूरा करने के लिए हमें एक <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">serialize()</span> मेथड की आवश्यकता होगी जो बिटकॉइन p2p नेटवर्क पर प्रसारण के लिए फॉर्मेटेड बाइट्स के रूप में संपूर्ण ट्रांजैक्शन को आउटपुट करे।`,
        paragraph_two: `हमारी स्क्रिप्ट को एक Transaction ऑब्जेक्ट बनाना और साइन करना चाहिए। इसमें एक इनपुट होगा (वह UTXO जिसे हमने <span className="underline">The input class</span> में पहचाना था) और दो आउटपुट:`,
        paragraph_three: `हमें अपना इनपुट पता है, हमें अपना आउटपुट पता है। क्या हम ट्रांजैक्शन बनाने और साइन करने के लिए तैयार हैं? पूरी तरह से नहीं। हमारे पास 1.61 BTC का इनपुट है और 1 BTC का आउटपुट... बाकी 0.61 BTC का क्या होता है? उसका अधिकांश हिस्सा "चेंज" (change) होगा और हमें इसे वापस अपने पते पर भेजना होगा!`,
        paragraph_four: `ध्यान दें कि विटनेस के लिए कोई "count" वैल्यू नहीं है। ऐसा इसलिए है क्योंकि विटनेस स्टैक की संख्या हमेशा इनपुट्स की संख्या के ठीक बराबर होनी चाहिए।`,
        paragraph_five: `लेकिन रुकिए! हमें एक "फीस" (fee) शामिल करने की आवश्यकता है। हम माइनिंग पूल्स के लिए अपने चेंज आउटपुट का एक छोटा सा हिस्सा काट लेंगे ताकि उन्हें हमारे ट्रांजैक्शन को ब्लॉक में शामिल करने के लिए प्रोत्साहित किया जा सके। चलिए अपने चेंज को 6,10,00,000 से घटाकर 6,09,99,000 सतोशी कर देते हैं।`,
        paragraph_six: `अंत में हमारा काम पूरा हुआ। आपकी स्क्रिप्ट ट्रांजैक्शन serialize() मेथड का परिणाम रिटर्न करके समाप्त होनी चाहिए। यह एक वैध साइन किया हुआ बिटकॉइन ट्रांजैक्शन है और हम इसे मिका 3000 को उसकी जरूरत के पैसे भेजने के लिए नेटवर्क पर ब्रॉडकास्ट कर सकते हैं!`,
        headings: {
          item_one: `विवरण`,
          item_two: `नाम`,
          item_three: `प्रकार`,
          item_four: `साइज`,
        },
        table: {
          row_one: {
            item_one: `वर्तमान में 2`,
            item_two: `version`,
            item_three: `int`,
            item_four: `4`,
          },
          row_two: {
            item_one: `सेग्रिगेटेड विटनेस के लिए ठीक 0x0001 होना चाहिए`,
            item_two: `flags`,
            item_three: `bytes`,
            item_four: `2`,
          },
          row_three: {
            item_one: `इनपुट्स की संख्या`,
            item_two: `in count`,
            item_three: `int`,
            item_four: `1`,
          },
          row_four: {
            item_one: `सभी ट्रांजैक्शन इनपुट्स, सीरियलाइज्ड`,
            item_two: `inputs`,
            item_three: `Inputs[]`,
            item_four: `(var)`,
          },
          row_five: {
            item_one: `आउटपुट्स की संख्या`,
            item_two: `out count`,
            item_three: `int`,
            item_four: `1`,
          },
          row_six: {
            item_one: `सभी ट्रांजैक्शन आउटपुट्स, सीरियलाइज्ड`,
            item_two: `outputs`,
            item_three: `Outputs[]`,
            item_four: `(var)`,
          },
          row_seven: {
            item_one: `सभी विटनेस स्टैक, सीरियलाइज्ड`,
            item_two: `witness`,
            item_three: `Witnesses[]`,
            item_four: `(var)`,
          },
          row_eight: {
            item_one: `0 पर सेट करना अंतिमता (finality) दर्शाता है`,
            item_two: `locktime`,
            item_three: `int`,
            item_four: `4`,
          },
        },
        bullet_one: `मिका 3000 को bc1qgghq08syehkym52ueu9nl5x8gth23vr8hurv9dyfcmhaqk4lrlgs28epwj पर 10,00,00,000 सतोशी मिलते हैं`,
        bullet_two: `आपको अपने पते bc1qm2dr49zrgf9wc74h5c58wlm3xrnujfuf5g80hs पर 6,10,00,000 वापस मिलते हैं`,
        success: `आपने कर दिखाया! आपने एक ट्रांजैक्शन बना लिया है!`,
      },
      hard: {
        title: `सब कुछ एक साथ लाना`,
        nav_title: `ट्रांजैक्शन डाइजेस्ट बनाएँ`,
        heading: `ट्रांजैक्शन डाइजेस्ट`,
        paragraph_one: `अध्याय 5 में हमने सीखा कि ट्रांजैक्शन साइन करने के लिए हमें पहले इसके डेटा को पुनर्व्यवस्थित और हैश करके एक मैसेज में बदलना होगा, जो हमारे साइनिंग एल्गोरिदम के लिए रॉ इनपुट्स में से एक बन जाता है। चूंकि हम अब सेग्रिगेटेड विटनेस का उपयोग कर रहे हैं, हमें अपडेटेड ट्रांजैक्शन डाइजेस्ट एल्गोरिदम को भी लागू करने की आवश्यकता है जो <Link href="https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki" target="_blank" className="underline">BIP 143</Link> में निर्दिष्ट है।`,
        paragraph_two: `याद रखें कि प्रत्येक ट्रांजैक्शन इनपुट को अपने स्वयं के सिग्नेचर की आवश्यकता होती है, और इसलिए डाइजेस्ट एल्गोरिदम के कुछ घटकों को कैश और पुन: उपयोग किया जा सकता है लेकिन अन्य इस बात पर निर्भर करेंगे कि किस इनपुट को साइन किया जा रहा है! ट्रांजैक्शन मेथड <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">digest(input_index)</span> को पूरा करें जो इनपुट साइन करने के लिए 32-बाइट मैसेज की गणना करता है।`,
        list_heading: `कुछ नोट्स:`,
        list_one: `"Double SHA-256" या dSHA256 = sha256(sha256(data))`,
        list_two: `value उस आउटपुट में सतोशी की राशि है जिससे खर्च किया जा रहा है। हमने इसे स्टेप 2 में अपनी Input क्लास में जोड़ा था।`,
        list_three: `scriptcode रॉ बिटकॉइन स्क्रिप्ट है जिसका मूल्यांकन किया जा रहा है। हमने इसे भी स्टेप 2 में अपनी Input क्लास में जोड़ा था।`,
        paragraph_three: `हम अगले भाग में इस पर और गहराई से चर्चा करेंगे, लेकिन अपने पे-टू-विटनेस-पब्लिक-की-हैश पते से खर्च करने के लिए, आपका स्क्रिप्टकोड होगा:`,
        paragraph_four: `...जो निम्नलिखित बिटकॉइन स्क्रिप्ट में डिकोड होता है।`,
        paragraph_five: `स्क्रिप्टकोड के बारे में अधिक जानकारी के लिए <Link href="https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki" target="_blank" className="underline">BIP 143</Link> देखें।`,
        paragraph_six: `रॉ ट्रांजैक्शन में एक प्रीइमेज होता है जो निम्नलिखित का सीरियलाइजेशन है:`,
        headings: {
          item_one: `विवरण`,
          item_two: `नाम`,
          item_three: `प्रकार`,
          item_four: `साइज`,
        },
        table: {
          row_one: {
            item_one: `ट्रांजैक्शन वर्जन, डिफ़ॉल्ट 2`,
            item_two: `version`,
            item_three: `int`,
            item_four: `4`,
          },
          row_two: {
            item_one: `सभी इनपुट्स से सभी आउटपॉइंट्स का dSHA256, सीरियलाइज्ड`,
            item_two: `bytes`,
            item_three: `bytes`,
            item_four: `32`,
          },
          row_three: {
            item_one: `सभी इनपुट्स से सभी सीक्वेंस वैल्यू का dSHA256, सीरियलाइज्ड`,
            item_two: `sequences`,
            item_three: `bytes`,
            item_four: `32`,
          },
          row_four: {
            item_one: `साइन किए जा रहे सिंगल इनपुट का सीरियलाइज्ड आउटपॉइंट`,
            item_two: `outpoint`,
            item_three: `bytes`,
            item_four: `36`,
          },
          row_five: {
            item_one: `आउटपुट स्क्रिप्ट जिससे खर्च किया जा रहा है`,
            item_two: `scriptcode`,
            item_three: `bytes`,
            item_four: `(var)`,
          },
          row_six: {
            item_one: `साइन किए जा रहे सिंगल इनपुट द्वारा खर्च की जा रही सतोशी वैल्यू`,
            item_two: `value`,
            item_three: `int`,
            item_four: `8`,
          },
          row_seven: {
            item_one: `साइन किए जा रहे सिंगल इनपुट की सीक्वेंस वैल्यू`,
            item_two: `sequence`,
            item_three: `int`,
            item_four: `8`,
          },
          row_eight: {
            item_one: `सभी आउटपुट्स का dSHA256, सीरियलाइज्ड`,
            item_two: `outputs`,
            item_three: `bytes`,
            item_four: `32`,
          },
          row_nine: {
            item_one: `ट्रांजैक्शन लॉकटाइम, डिफ़ॉल्ट 0`,
            item_two: `locktime`,
            item_three: `int`,
            item_four: `4`,
          },
          row_ten: {
            item_one: `सिग्नेचर हैश टाइप, हम "ALL" इंगित करने के लिए 1 का उपयोग करेंगे`,
            item_two: `sighash`,
            item_three: `int`,
            item_four: `4`,
          },
        },
        paragraph_seven: `अंत में, जिस संदेश को हम साइन करते हैं वह इस सभी सीरियलाइज्ड डेटा का डबल SHA-256 है।`,
        success: `digest() मेथड सही लग रहा है। बहुत बढ़िया!`,
      },
    },
    put_it_together_four: {
      hard: {
        title: `सब कुछ एक साथ लाना`,
        heading: `साइनिंग!`,
        nav_title: `ट्रांजैक्शन साइन करें`,
        paragraph_one: `हमने पिछले अध्याय में ECDSA सिग्नेचर वेरिफिकेशन कोड लिखा था, अब हमें एक वैध सिग्नेचर बनाने के लिए उसे थोड़ा पुनर्व्यवस्थित करने की आवश्यकता है। अपनी Transaction क्लास में <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">compute_input_signature(index: int, key: int)</span> नामक एक मेथड जोड़ें जो एक इनपुट इंडेक्स नंबर और एक प्राइवेट की (एक 32-बाइट पूर्णांक!) स्वीकार करता है। इसे स्टेप 6 के <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">digest()</span> मेथड का उपयोग करके चुने हुए इनपुट के लिए मैसेज डाइजेस्ट की गणना करनी चाहिए, और दो 32-बाइट पूर्णांकों r और s के रूप में एक ECDSA सिग्नेचर रिटर्न करना चाहिए।`,
        paragraph_two: `ECDSA साइनिंग एल्गोरिदम के लिए <Link href="https://en.wikipedia.org/wiki/Elliptic_Curve_Digital_Signature_Algorithm" target="_blank" className="underline">यह पेज</Link> देखें। साथ ही <Link href="https://www.secg.org/sec1-v2.pdf#subsubsection.4.1.3" target="_blank" className="underline">यह PDF</Link> (पेज 44, सेक्शन 4.1.3) भी।`,
        paragraph_three: `बिटकॉइन प्रोटोकॉल को साइनिंग एल्गोरिदम में एक अतिरिक्त स्टेप की आवश्यकता होती है, जिसके लिए आवश्यक है कि s वैल्यू "लो" हो, जिसका अर्थ है कर्व के ऑर्डर के आधे से कम। इसके बारे में <Link href="https://github.com/bitcoin/bips/blob/master/bip-0146.mediawiki#low_s" target="_blank" className="underline">BIP 146</Link> में अधिक जानें।`,
        success: `compute_input_signature() मेथड सही लग रहा है। बहुत बढ़िया!`,
      },
    },
    put_it_together_five: {
      hard: {
        title: `सब कुछ एक साथ लाना`,
        heading: `विटनेस को पॉप्युलेट करें`,
        nav_title: `विटनेस को पॉप्युलेट करें`,
        paragraph_one: `मेथड <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">sign_input(index: int, key: int)</span> को पूरा करें जो हमारे स्टेप 7 के मेथड <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">compute_input_signature(index, key)</span> को कॉल करता है और इसके रिटर्न वैल्यू को हैंडल करता है। r और s नंबरों को DER नामक एल्गोरिदम के साथ एनकोड करने की आवश्यकता होती है जिसे हमने आपके लिए लागू किया है।`,
        paragraph_two: `बिटकॉइन को DER-सिग्नेचर के अंत में एक अतिरिक्त बाइट की आवश्यकता होती है जो "sighash type" का प्रतिनिधित्व करता है। अभी के लिए हम इसके लिए हमेशा बाइट 0x01 का उपयोग करेंगे जो "SIGHASH ALL" को दर्शाता है।`,
        paragraph_three: `एक बार जब हमारे पास वह सिग्नेचर ब्लॉब हो जाता है, तो हमें दो स्टैक आइटम्स के साथ एक Witness ऑब्जेक्ट बनाना होता है: सिग्नेचर ब्लॉब, और आपकी कंप्रेस्ड पब्लिक की। सिग्नेचर को पहले पुश करें, उसके बाद पब्लिक की।`,
        paragraph_four: `विटनेस स्टैक ऑब्जेक्ट को फिर ट्रांजैक्शन ऑब्जेक्ट के विटनेस एरे में जोड़ा जा सकता है।`,
        success: `sign_input() मेथड सही लग रहा है। बहुत बढ़िया!`,
      },
    },
    put_it_together_six: {
      hard: {
        title: `सब कुछ एक साथ लाना`,
        heading: `सब कुछ एक साथ लाना`,
        nav_title: `सब कुछ एक साथ लाना!`,
        paragraph_one: `हमें अपना इनपुट पता है, हमें अपना आउटपुट पता है। क्या हम ट्रांजैक्शन बनाने और साइन करने के लिए तैयार हैं? पूरी तरह से नहीं। हमारे पास 1.61 BTC का इनपुट है और 1 BTC का आउटपुट... बाकी 0.61 BTC का क्या होता है? उसका अधिकांश हिस्सा "चेंज" होगा और हमें इसे वापस अपने पते पर भेजना होगा!`,
        paragraph_two: `एक स्क्रिप्ट लिखें जो एक Transaction ऑब्जेक्ट बनाती और साइन करती है। इसमें एक इनपुट (स्टेप 1 में हमारे द्वारा पहचाना गया UTXO) और दो आउटपुट होने चाहिए:`,
        paragraph_three: `लेकिन रुकिए! हमें एक "फीस" शामिल करने की आवश्यकता है। हम माइनिंग पूल्स के लिए अपने चेंज आउटपुट का एक छोटा सा हिस्सा काट लेंगे ताकि उन्हें हमारे ट्रांजैक्शन को ब्लॉक में शामिल करने के लिए प्रोत्साहित किया जा सके। चलिए अपने चेंज को 6,10,00,000 से घटाकर 6,09,99,000 सतोशी कर देते हैं।`,
        paragraph_four: `अंत में हमारा काम पूरा हुआ। आपकी स्क्रिप्ट ट्रांजैक्शन <span className="text-green p-1 font-mono bg-[#0000004D] m-0.5 text-sm">serialize()</span> मेथड का परिणाम रिटर्न करके समाप्त होनी चाहिए। यह एक वैध साइन किया हुआ बिटकॉइन ट्रांजैक्शन है और हम इसे मिका 3000 को उसकी जरूरत के पैसे भेजने के लिए नेटवर्क पर ब्रॉडकास्ट कर सकते हैं!`,
        bullet_one: `मिका 3000 को bc1qgghq08syehkym52ueu9nl5x8gth23vr8hurv9dyfcmhaqk4lrlgs28epwj पर 10,00,00,000 सतोशी मिलते हैं`,
        bullet_two: `आपको अपने पते bc1qm2dr49zrgf9wc74h5c58wlm3xrnujfuf5g80hs पर 6,10,00,000 वापस मिलते हैं`,
        success: `आपने कर दिखाया! आपने एक ट्रांजैक्शन बना लिया है!`,
      },
    },
    outro_one: {
      title: `उपसंहार`,
      nav_title: `अध्याय पूर्ण`,
      heading: `आपने कर दिखाया!`,
      paragraph_one: `आपने मिका 3000 को उसकी मदद के लिए भुगतान करने हेतु शुरुआत से सफलतापूर्वक एक ट्रांजैक्शन बनाया। अब जब हम यहाँ का काम पूरा कर चुके हैं, तो देखते हैं कि हमें वेंडरपूल के द्वीप पर क्या मिल सकता है।`,
    },
    book_a_call_one: {
      title: 'BDP के साथ कॉल बुक करें',
      nav_title: 'BDP के साथ कॉल बुक करें',
      heading:
        'बिटकॉइन देव प्रोजेक्ट (Bitcoin Dev Project) के साथ कॉल के बारे में क्या ख्याल है?',
      paragraph_one:
        '—मिका 3000: "शुरुआत से उस ट्रांजैक्शन को बनाने का प्रभावशाली काम। पब्लिक-प्राइवेट की-पेयर के साथ अपना स्वयं का बिटकॉइन पता बनाने से लेकर यह साबित करने तक कि वेंडरपूल के हस्ताक्षर धोखाधड़ी थे, यह स्पष्ट है कि आप अपनी चीज़ों को अच्छी तरह जानते हैं।"',
      paragraph_two:
        '"क्या कोई संभावना है कि आप इस पूरे बिटकॉइन ओपन-सोर्स सॉफ्टवेयर (BOSS) के बारे में और बात करना चाहेंगे? मैं <Link className="!underline" target="_blank" href="https://bitcoindevs.xyz" /> बिटकॉइन देव प्रोजेक्ट </Link> के कुछ लोगों को जानती हूँ जिनसे मैं आपकी जान-पहचान करा सकती हूँ। वे हमेशा आपके जैसे प्रतिभाशाली कोडर्स की तलाश में रहते हैं ताकि बिटकॉइन को बनाने, मजबूत करने और सुरक्षित करने में मदद मिल सके ताकि यह सिर्फ पैसे से कहीं अधिक भविष्य बना रहे।"',
      paragraph_three:
        'यह आपको एक कैलेंडर पर ले जाएगा जहां आप बिटकॉइन देव प्रोजेक्ट के एक सदस्य के साथ बिटकॉइन ओपन-सोर्स सॉफ्टवेयर और संबंधित करियर के अवसरों में अधिक शामिल होने के तरीकों पर चर्चा करने के लिए एक वास्तविक वीडियो कॉल बुक कर सकते हैं। यह सेविंग सातोशी गेम से पूरी तरह अलग है और इसे अस्वीकार करने से आपके गेम की प्रगति पर कोई असर नहीं पड़ेगा।',
      button_text_one: 'कॉल शेड्यूल करें',
      button_text_two: 'गेम जारी रखें',
    },
    resources: {
      in_out: {
        input_class_heading: `Input क्लास`,
        input_class_paragraph_one: `संसाधन (Placeholder Resources)`,
        output_class_heading: `Output क्लास`,
        output_class_paragraph_one: `संसाधन (Placeholder Resources)`,
      },
      put_it_together: {
        building_a_transaction_heading: `ट्रांजैक्शन बनाना`,
        building_a_transaction_paragraph_one: `संसाधन (Placeholder Resources)`,
      },
    },
  },
  chapter_seven: {
    title: `हमला ही सबसे अच्छा बचाव है (Offense is the Best Defense)`,
    paragraph_one: `आप और मिका 3000 वेंडरपूल के निजी द्वीप पर पहुँचते हैं—पहले विमान और पैराशूट के ज़रिए, फिर ड्यून बग्गी (dune buggy) से, और अंत में एक ऐसी नाव से जो खुद चलती है।`,
    intro_one: {
      title: `परिचय`,
      nav_title: `कंपाउंड में घुसपैठ`,
      paragraph_one: `आप अपने साथियों से पूछते हैं कि क्या वे वेंडरपूल के सुरक्षा ड्रोनों की सेना को लेकर चिंतित हैं।`,
      paragraph_two: `—होलोकैट: "मुझे 15 मिनट दो। वे असल में पक्षी हैं, और मैं एक बिल्ली हूँ। उनके पास कोई मौका नहीं है।"`,
      paragraph_three: `होलोकैट अपने पंजे निकालती है और एक-एक करके वेंडरपूल की ड्रोन सेना का काम तमाम कर देती है। मिका 3000 आपको एक काला टर्टलनेक स्वेटर, दस्ताने और नाइट विजन चश्मा थमाती है।`,
      paragraph_four: `—मिका 3000: "तुम हवाई शर्ट (Hawaiian shirt) पहनकर जासूसी नहीं कर सकते। तुम क्या सोच रहे थे? यह कोई लावारिस गोदाम नहीं है; यह एक किला है। और सुनो, मैं लगभग भूल ही गई थी। यह ग्रैपलिंग हुक (grappling hook) लो।"`,
      paragraph_five: `यह सोचते हुए कि आप किस मुसीबत में पड़ गए हैं, आप और मिका 3000 वेंडरपूल के मुख्य निवास की दीवारों पर चढ़ जाते हैं। आपको यह देखकर आश्चर्य होता है कि उसका घर बिटकॉइन-समर्थक कला, किताबों और पत्रिकाओं से भरा पड़ा है। वह वास्तव में एक सच्चा बिटकॉइनर है, या कम से कम पहले था। वहाँ 125 साल पुराने माइनर्स का संग्रह कांच के बक्सों में सुरक्षित रखा है। तभी आपको वह दिखता है: वेंडरपूल की वर्कशॉप।`,
    },
    intro_two: {
      nav_title: `कंट्रोल रूम`,
      paragraph_one: `वह विशाल कमरा अस्त-व्यस्त है, हालाँकि उसकी बनावट व्यवस्थित है। याद है जब माइनर्स खाली ब्लॉक्स बनाकर बिटकॉइन नेटवर्क को जाम कर रहे थे? खुली नोटबुकों के अंदर, आपको वेंडरपूल द्वारा इस्तेमाल किए गए बैकडोर (backdoor) के विस्तृत डिजाइन मिलते हैं। आप सही थे: यह सब एक झूठ था, लेकिन यह किसी शातिर खलनायक ने नहीं, बल्कि बिटकॉइन के एक ऐसे हताश विश्वासी ने बोला था जिसकी कंपनी अब और मुकाबला नहीं कर सकती थी। अपनी विरासत को बचाने के लिए, वेंडरपूल ने माइनर्स को एक वायरस से संक्रमित कर दिया था।`,
      paragraph_two: `यह वायरस सभी माइनर्स द्वारा उपयोग किए जाने वाले कोड के एक हिस्से को बदल देता है, चाहे वे किसी पूल का हिस्सा हों या नहीं। यह 'ब्लॉक बिल्डिंग लॉजिक' है—वह एल्गोरिदम जो ट्रांजैक्शन को ब्लॉक टेंपलेट में इकट्ठा करता है। वह टेंपलेट अभी भी प्रूफ-ऑफ-वर्क के लिए वैध हैशिंग कोड के पास भेजा जाता है। एक वैध हैश की खोज करते समय टेंपलेट को अरबों अलग-अलग नॉनस (nonces) के साथ जोड़ा जाता है, लेकिन जब तक वह मिलता है, तब तक नुकसान—यानी ब्लॉक टेंपलेट में ट्रांजैक्शन की अनुपस्थिति—हो चुका होता है।`,
      paragraph_three: `—होलोकैट: "कितना बड़ा नुकसान है। उनका परिवार कभी महान था। वेंडरपूल परिवार को इस हालत में देखना बहुत दुखद है।"`,
    },
    intro_three: {
      nav_title: `सॉफ्टवेयर में सुधार`,
      paragraph_one: `लेकिन आप वेंडरपूल के सर्वर पर उस अपंग माइनिंग कोड को ऐसे ही नहीं छोड़ सकते। यह माइनर्स को संक्रमित करना जारी रखेगा। आपको इसे ठीक करना होगा! जैसे ही आप कोड पढ़ते हैं, होलोकैट आपको एक मेमपूल (mempool) डिस्प्ले दिखाती है जो अपुष्ट ट्रांजैक्शन से भर रहा है। जितनी जल्दी यह कोड ठीक हो जाए, उतना ही बेहतर है।`,
    },
    mempool_transaction_one: {
      title: `ब्लॉक बनाना`,
      nav_title: `एक ब्लॉक इकट्ठा करें`,
      heading: `कोड चुनौती (Code Challenge)`,
      python: {
        paragraph_one: `यह वह कोड है जो आपको वेंडरपूल के सर्वर पर मिला है। यह एक JSON फ़ाइल से वर्तमान मेमपूल को इम्पोर्ट करता है और सभी अपुष्ट ट्रांजैक्शन को MempoolTransaction क्लास के इंस्टेंस के रूप में मेमोरी में स्टोर करता है। वेंडरपूल ने जिस फंक्शन को खराब किया है वह <span className="text-green">assemble_block()</span> है। यदि आप कोड को वैसे ही चलाते हैं जैसा वेंडरपूल ने छोड़ा था, तो आपको समस्या तुरंत समझ आ जाएगी।`,
      },
      javascript: {
        paragraph_one: `यह वह कोड है जो आपको वेंडरपूल के सर्वर पर मिला है। यह एक JSON फ़ाइल से वर्तमान मेमपूल को इम्पोर्ट करता है और सभी अपुष्ट ट्रांजैक्शन को MempoolTransaction क्लास के इंस्टेंस के रूप में मेमोरी में स्टोर करता है। वेंडरपूल ने जिस फंक्शन को खराब किया है वह <span className="text-green">assembleBlock()</span> है। यदि आप कोड को वैसे ही चलाते हैं जैसा वेंडरपूल ने छोड़ा था, तो आपको समस्या तुरंत समझ आ जाएगी।`,
      },
      paragraph_two: {
        a: `आपको ब्लॉक असेंबली फंक्शन को न केवल वैध ब्लॉक बनाने के लिए ठीक करना है, बल्कि ब्लॉक में मिलने वाली फीस को भी अधिकतम करना है, ताकि माइनर्स सर्वसम्मति नियमों (consensus rules) के तहत अधिक से अधिक लाभ कमा सकें। सबसे महत्वपूर्ण नियम जिन पर आपको ध्यान देना होगा, वे ब्लॉक में कुल `,
        b: {
          text: `ट्रांजैक्शन वेट (transaction weight) `,
          href: `https://chat.bitcoinsearch.xyz/?author=holocat&question=what%2520are%2520weighted%2520units`,
          question: `वेटेड यूनिट्स क्या हैं?`,
        },
        c: ` और `,
        d: {
          text: `ट्रांजैक्शन के क्रम `,
          href: `https://chat.bitcoinsearch.xyz/?author=holocat&question=what%2520order%2520do%2520transactions%2520need%2520to%2520be%2520in%2520a%2520block`,
          question: `एक ब्लॉक में ट्रांजैक्शन किस क्रम में होने चाहिए?`,
        },
        e: ` को प्रतिबंधित करते हैं।`,
      },
      paragraph_three: `अपने मिशन को पूरा करने के लिए आप निम्नलिखित धारणाएँ बना सकते हैं:`,
      bullet_one: `मेमपूल के सभी ट्रांजैक्शन पहले ही वैध (valid) सत्यापित किए जा चुके हैं।`,
      bullet_two: `कॉइनबेस ट्रांजैक्शन, और इसके द्वारा ब्लॉक में जोड़े गए वजन को नजरअंदाज किया जा सकता है।`,
      paragraph_four: `आप पूरी रॉ मेमपूल JSON फ़ाइल यहाँ <Link href="https://github.com/saving-satoshi/resources/blob/main/chapter-7/mempool.json" target="_blank" className="underline">देख सकते हैं</Link>।`,
      paragraph_five: `या कुछ बुनियादी पैटर्न्स के लिए इस तालिका में फ़ाइल के अंश देख सकते हैं:`,
      headings: {
        item_one: `ट्रांजैक्शन आईडी (TXID)`,
        item_two: `फीस`,
        item_two_b: `सतोशी`,
        item_three: `वजन (Weight)`,
        item_three_b: `वेट यूनिट्स (WU)`,
        item_four: `पूर्वज (Ancestors)`,
      },
      table_one: {
        footer: `बाकी ट्रांजैक्शन डेटा के लिए JSON फ़ाइल <Link href="https://github.com/saving-satoshi/resources/blob/main/chapter-7/mempool.json" target="_blank" className="underline">यहाँ</Link> देखें`,
      },
      poor: `यह एक वैध ब्लॉक है, लेकिन क्या आप इसे और बेहतर बना सकते हैं? अधिक फीस इकट्ठा करने का प्रयास करें।`,
      good: `यह एक वैध ब्लॉक है, लेकिन आपको अभी तक अधिकतम फीस नहीं मिल रही है। कोशिश जारी रखें, या आगे बढ़ें—आपकी मर्जी।`,
      success: `यह एक वैध ब्लॉक है, और आपने फीस को ऑप्टिमाइज़ किया है। शानदार!`,
    },
    outro_one: {
      title: `उपसंहार`,
      nav_title: `अध्याय पूर्ण`,
      heading: `आपने कर दिखाया!`,
      paragraph_one: `आप कंपाउंड से सुरक्षित निकलकर घर लौट आते हैं। जब कहानी सार्वजनिक होती है, तो निवेशक सामूहिक रूप से अपने BitRey शेयर बेच देते हैं, जिससे वेंडरपूल की कुल संपत्ति धड़ाम से गिर जाती है।`,
    },
    resources: {
      mempool_transaction_one: {
        bytes_v_weight_heading: `बाइट्स बनाम वेट यूनिट्स (Bytes vs Weight Units)`,
        bytes_v_weight_paragraph_one: `बिटकॉइन ब्लॉक निर्माण में, "वेट यूनिट्स" (WU) और "बाइट्स" ट्रांजैक्शन और ब्लॉक के आकार को मापने के लिए उपयोग किए जाने वाले दो अलग-अलग मेट्रिक्स हैं।`,
        bytes_v_weight_subheading_bytes: `बाइट्स (Bytes)`,
        bytes_v_weight_paragraph_two: `बाइट्स वास्तविक डेटा के संदर्भ में एक ट्रांजैक्शन या ब्लॉक के कच्चे आकार को संदर्भित करते हैं। यह ट्रांजैक्शन डेटा का शाब्दिक आकार होता है जब इसे सीरियलाइज (सहेजने या भेजने योग्य फॉर्मेट में बदलना) किया जाता है। सेग्रिगेटेड विटनेस (SegWit) के लागू होने से पहले, ब्लॉक का आकार 1 मेगाबाइट (1 MB) तक सीमित था।`,
        bytes_v_weight_subheading_wu: `वेटेड यूनिट्स (Weighted Units)`,
        bytes_v_weight_paragraph_three: `वेटेड यूनिट्स एक अधिक जटिल मीट्रिक है जिसे SegWit के साथ बिटकॉइन सुधार प्रस्ताव 141 (<Link href="https://github.com/bitcoin/bips/blob/master/bip-0141.mediawiki#user-content-Other_consensus_critical_limits" target="_blank" className="undeline">BIP 141</Link>) में पेश किया गया था। इस प्रणाली का उद्देश्य विटनेस डेटा के प्रभाव को अलग से मानकर ब्लॉक स्पेस को अधिक निष्पक्ष रूप से आवंटित करना है।`,
        bytes_v_weight_paragraph_four: `हमारे इस पाठ में, यह ध्यान रखना महत्वपूर्ण है कि हम अधिकतम ब्लॉक आकार की गणना के लिए वेट यूनिट्स का उपयोग कर रहे हैं। सुनिश्चित करें कि आपका ब्लॉक 4,000,000 वेट यूनिट्स के अधिकतम आकार से अधिक न हो।`,
      },
    },
  },
  chapter_eight: {
    title: `इक्कीस मिलियन (Twenty-One Million)`,
    paragraph_one: `आपकी जांच की वजह से, लोग वास्तव में आपसे सुनना चाहते हैं, इसलिए आप होलोकैट की नाक को 'बूप' (boop) करते हैं, जिससे डेबोरा चंक (Deborah Chunk) का एक निमंत्रण सामने आता है। वह आपको 'LARGE BIG NEWS' स्टूडियो के कार्यालयों में व्यक्तिगत रूप से उपस्थित होने के लिए आमंत्रित करती हैं। कहानी को बाहर लाना महत्वपूर्ण है, इसलिए आप एक बार फिर अपने बजटकॉप्टर (Budgetcopter) में सवार हो जाते हैं।`,
    intro_one: {
      title: `परिचय`,
      nav_title: `वेंडरपूल का धोखा`,
      paragraph_one: `—डेबोरा चंक: "ये दस्तावेज़ थॉमस वेंडरपूल के कथित झूठ को इस तरह उजागर करते हैं जो निश्चित रूप से ऐतिहासिक है, यहाँ तक कि अपमानजनक भी। पहली चीज़ जो लोग सबसे पहले जानना चाहेंगे वह यह है कि क्या आपने अकेले काम किया। दूसरी बात यह कि आपको अपनी जानकारी कहाँ से मिली।"`,
      paragraph_two: `आप उन्हें होलोकैट के बारे में बताते हैं और केवल होलोकैट के बारे में ही। आप कहते हैं कि जानकारी सीधे आपको और मिका 3000 को सातोशी नाकामोतो होने का दावा करने वाले किसी व्यक्ति द्वारा दी गई थी, जिसे आपको संदेह है कि वास्तव में वह एक हैकर समूह (hacker collective) है। यह आखिरी बिंदु थॉमस वेंडरपूल को सीधे शो में कॉल करने के लिए मजबूर कर देता है।`,
    },
    intro_two: {
      title: `परिचय`,
      nav_title: `वेंडरपूल का गुस्सा`,
      paragraph_one: `—थॉमस वेंडरपूल: "मेरा परिवार ही सातोशी नाकामोतो है! क्या आपने देखा कि इस नौसिखिये ने अभी क्या कहा? उसने अभी स्वीकार किया कि वह हैकरों के साथ काम कर रहा है, एक ऐसा समूह जो केवल सातोशी नाकामोतो नाम का उपयोग उस विरासत पर दावा करने के लिए करता है जो कानूनी रूप से मेरी है। यह बदमाश उन बिटकॉइनर्स के विरोध को कमजोर करने के लिए झूठ बोल रहा है जो ब्लॉक रिवॉर्ड (block rewards) को खत्म करने को लेकर उचित रूप से परेशान हैं!"`,
      paragraph_two: `वेंडरपूल आप पर दो सदी पुराने अपमानजनक शब्द फेंकना जारी रखता है। वह आपको वारमिंट (varmint), रैप्सकैलियन (rapscallion), पीली पीठ वाला (yellow belly), ग्रीनहॉर्न (greenhorn) और बहुत कुछ कहता है। आपको लगभग उसके लिए बुरा लगता है। उसका परिवार निर्विवाद रूप से बिटकॉइन के इतिहास के लिए महत्वपूर्ण था, भले ही सातोशी नाकामोतो के बारे में उसके दावे स्पष्ट रूप से नकली हों।`,
    },
    intro_three: {
      intro: `परिचय`,
      nav_title: `वेंडरपूल के खिलाफ आरोप`,
      paragraph_one: `—डेबोरा चंक: "मिस्टर वेंडरपूल, अगर मैं कह सकूँ। लोग भ्रमित और अनिश्चित हैं कि क्या बिटकॉइन की आपूर्ति के साथ छेड़छाड़ की गई है। क्या आप साबित कर सकते हैं कि आपने कथित छेड़छाड़ में कोई भूमिका नहीं निभाई? रहस्यमयी हैकर और उसकी होलोकैट, क्या आप साबित कर सकते हैं कि वेंडरपूल ने बिटकॉइन के खिलाफ इस अपराध का प्रयास किया था?"`,
    },
    building_blocks_one: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `चेन टिप ढूँढना`,
      paragraph_one: {
        a: `आप जानते हैं कि वेंडरपूल उन ब्लॉक्स को माइन करके लोगों को भ्रमित करने की कोशिश कर रहा है जो अनुमति से अधिक बिटकॉइन उत्पन्न करते हैं, जिससे अंततः मुद्रा की आपूर्ति बढ़ जाती है। ये ब्लॉक अमान्य हैं क्योंकि वे हार्ड-कोडेड प्रोटोकॉल नियमों को तोड़ते हैं, लेकिन वे अभी भी छोटी या दुर्भावनापूर्ण सॉफ्टवेयर चलाने वाले कुछ लोगों को मूर्ख बना सकते हैं, या `,
        b: {
          text: `लाइट क्लाइंट्स (light clients) `,
          href: `https://chat.bitcoinsearch.xyz/?author=holocat&question=what%2520are%2520light%2520clients%253F`,
          question: `लाइट क्लाइंट्स क्या हैं?`,
        },
        c: ` को, जो नेटवर्क डेटा को पूरी तरह से सत्यापित नहीं करते हैं।`,
      },
      paragraph_two: `आप यह भी जानते हैं कि नेटवर्क पर कहीं न कहीं जेनेसिस ब्लॉक से आज की "चेन टिप" (chain tip) तक वैध ब्लॉक्स की एक श्रृंखला है, जहाँ हर ट्रांजैक्शन और ब्लॉक नियमों का पालन करता है। यह श्रृंखला ही एकमात्र <span className="italic">असली</span> श्रृंखला है, एकमात्र श्रृंखला जो मायने रखती है, और एकमात्र श्रृंखला जहाँ बिटकॉइन की 21 मिलियन मूल बिटकॉइन की आपूर्ति बरकरार है।`,
      paragraph_three: `अब, पूरी दुनिया के सामने लाइव टीवी पर, आपको सबसे लंबी वैध ब्लॉकचेन ढूंढनी है और सिक्कों की आपूर्ति की अखंडता को सत्यापित करना है। जब आप ऐसा करेंगे, तो आप यह भी साबित कर पाएंगे कि वेंडरपूल ने बिटकॉइन नेटवर्क को अमान्य ब्लॉक्स का माइनफील्ड बना दिया है।`,
    },
    building_blocks_two: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `एक बिटकॉइन ब्लॉक ट्री`,
      paragraph_one: `प्रत्येक ब्लॉक का ठीक एक पिछला ब्लॉक होता है, लेकिन उसके एक से अधिक अगले ब्लॉक हो सकते हैं। इस वजह से, बिटकॉइन ब्लॉक एक श्रृंखला के बजाय एक पेड़ (tree) की तरह अधिक होते हैं। कुछ शाखाएँ मृत अंत (dead-ends) हैं और, जैसा कि आपको साबित करना चाहिए, वेंडरपूल की हरकतों के कारण कुछ शाखाएँ अमान्य हैं।`,
      paragraph_two: `इस भूलभुलैया में कहीं जेनेसिस ब्लॉक से आज के सबसे हालिया ब्लॉक तक का रास्ता है। आपको इसे ढूंढना होगा और डेबोरा चंक को बताना होगा कि पेड़ की सबसे वैध श्रृंखला के सिरे (tip) पर कौन सा ब्लॉक है... अगले कमर्शियल ब्रेक से पहले। आह!`,
      paragraph_three: `बिटकॉइन के ब्लॉकचेन "पेड़" की यह कलात्मक व्याख्या दिखाती है कि कैसे प्रत्येक ब्लॉक का ठीक एक जनक (parent) होता है, लेकिन एक से अधिक संतान (child) हो सकती हैं। प्रत्येक ब्लॉक को उसके हैश और उसके जनक के हैश (<span className="p-1 font-mono m-0.5 text-sm">prev</span>) के साथ लेबल किया गया है।`,
      paragraph_four: `इनमें से कुछ ब्लॉक लाल हैं क्योंकि वे अमान्य हैं। जेनेसिस ब्लॉक से शुरू होने वाला ब्लॉक्स का सबसे लंबा रास्ता हरे रंग का है और "सबसे अधिक काम" (most work) या "सबसे वैध" श्रृंखला का प्रतिनिधित्व करता है। इन ब्लॉक्स में ट्रांजैक्शन ही एकमात्र वास्तव में "पुष्ट" (confirmed) ट्रांजैक्शन हैं। अन्य वैध ब्लॉक, नीले वाले, के पास "सबसे अधिक काम" वाली श्रृंखला जितनी संतानें नहीं हैं। वे <span className="italic">स्टेल टिप्स</span> (stale tips) के रूप में समाप्त हो जाते हैं।`,
    },
    building_blocks_three: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `बिटकॉइन API का अन्वेषण करें`,
      heading: `बिटकॉइन API`,
      paragraph_one: `इन सवालों के जवाब देने के लिए, आपको इसके JSON-RPC API के माध्यम से एक बिटकॉइन फुल नोड के साथ इंटरैक्ट करना होगा। हमने आपके लिए <span className="p-1 font-mono bg-[#0000004D] m-1">bitcoin_rpc</span> नामक एक लाइब्रेरी इम्पोर्ट की है जो आपकी स्क्रिप्ट से फुल नोड तक सुरक्षित HTTP कनेक्शन संभालती है, आपके कमांड निष्पादित करती है और रिस्पॉन्स रिटर्न करती है। आपका फुल नोड "प्रूनिंग" (pruning) कर रहा है इसलिए इसके पास केवल पिछले 300 ब्लॉक्स तक ही पहुँच है, लेकिन वेंडरपूल की हालिया गड़बड़ियों को शामिल करने के लिए यह पर्याप्त होना चाहिए।`,
      paragraph_two: `चलिए API से परिचित होने के साथ शुरुआत करते हैं। लाइब्रेरी में एक फंक्शन है जो एक आवश्यक आर्गुमेंट, <span className="p-1 font-mono bg-[#0000004D] m-1">method</span> (एक स्ट्रिंग) और एक वैकल्पिक आर्गुमेंट, <span className="p-1 font-mono bg-[#0000004D] m-1">params</span> (या तो एक स्ट्रिंग या नंबर) स्वीकार करता है:`,
      paragraph_three: `API में एक सुविधाजनक "help" मेथड भी है! उपलब्ध कमांड के बारे में अधिक जानने के लिए इससे मदद मांगें, फिर वर्तमान नेटवर्क कठिनाई (difficulty) को प्रिंट करके चुनौती को पास करें।`,
      success: `API का अन्वेषण करने का अच्छा काम! चलिए आगे बढ़ते हैं।`,
    },
    building_blocks_four: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `सबसे कम ट्रांजैक्शन वाला ब्लॉक खोजें`,
      heading: `ब्लॉक डेटा`,
      paragraph_one: `प्रत्येक बिटकॉइन फुल नोड का एक डेटाबेस होता है। वहीं ब्लॉक्स को उनके हैश द्वारा स्टोर और इंडेक्स किया जाता है। फुल नोड एक दूसरे इंडेक्स के साथ ट्रैक रखता है कि चेन में प्रत्येक ऊँचाई (height) पर कौन से ब्लॉक उम्मीदवार हैं, जो height -> [block hashes] को मैप करता है।`,
      paragraph_two: `JSON-RPC API ब्लॉक डेटा को JSON ऑब्जेक्ट के रूप में रिटर्न करता है जिसमें एक प्रॉपर्टी <span className="p-1 font-mono bg-[#0000004D] m-1">txs</span> शामिल होती है जो ट्रांजैक्शन ऑब्जेक्ट्स की एक एरे है।`,
      paragraph_three: `हाइट 6929996 पर सभी ब्लॉक उम्मीदवारों को पुनः प्राप्त करें और उसमें सबसे कम ट्रांजैक्शन वाले ब्लॉक का हैश प्रिंट करें।`,
      success: `बहुत बढ़िया`,
    },
    building_blocks_five: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `ट्रांजैक्शन फीस प्राप्त करें`,
      heading: `ट्रांजैक्शन डेटा`,
      paragraph_one: `एक ब्लॉक में पुष्ट किए गए ट्रांजैक्शन ऑब्जेक्ट्स JSON ऑब्जेक्ट होते हैं जिनमें "inputs" और "outputs" की एरे शामिल होती है। ये दोनों एरे UTXOs की सूचियाँ हैं, जिन्हें "सिक्के" (coins) के रूप में भी जाना जाता है। कॉइन ऑब्जेक्ट्स में "value" प्रॉपर्टी होती है जिसे सतोशी में दर्शाया जाता है।`,
      paragraph_two: `"inputs" एरे ट्रांजैक्शन द्वारा खर्च किए गए (नष्ट किए गए) सिक्के हैं और "outputs" एरे ट्रांजैक्शन द्वारा बनाए गए सिक्के हैं। आपको अध्याय 6 से याद होगा कि ट्रांजैक्शन हमेशा माइनर्स को ब्लॉक में शामिल करने के लिए प्रोत्साहित करने हेतु फीस का भुगतान करते हैं। वह फीस बिल्कुल ट्रांजैक्शन के कुल इनपुट और कुल आउटपुट वैल्यू के बीच का अंतर है।`,
      paragraph_three: `दूसरे शब्दों में, माइनर को वह सारा बिटकॉइन रखने को मिलता है जो ट्रांजैक्शन में भेजा गया था लेकिन ट्रांजैक्शन प्राप्तकर्ताओं को वापस नहीं भेजा गया था।`,
      paragraph_four: `यहाँ एक txid वाला ट्रांजैक्शन है:`,
      paragraph_five: `इस हैश वाले ब्लॉक में:`,
      paragraph_six: `उस ट्रांजैक्शन की फीस सतोशी में प्रिंट करें।`,
      success: `बहुत बढ़िया`,
    },
    building_blocks_six: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `सब्सिडी निर्धारित करें`,
      heading: `कॉइनबेस ट्रांजैक्शन (Coinbase Transaction)`,
      paragraph_one: `प्रत्येक ब्लॉक में पहले ट्रांजैक्शन को कॉइनबेस कहा जाता है। इसे "0वां" ट्रांजैक्शन (txs[0]) भी कहा जा सकता है और इसकी कुछ बहुत ही खास विशेषताएं हैं। सबसे पहले, इसका कोई इनपुट नहीं होता! ऐसा इसलिए है क्योंकि यह किसी भी मौजूदा सिक्के को खर्च नहीं करता है। दूसरा, इसकी आउटपुट वैल्यू प्रोटोकॉल द्वारा सख्ती से परिभाषित है (भले ही वेंडरपूल कुछ भी कहे!)। यह वह तंत्र है जिसके द्वारा माइनर्स ट्रांजैक्शन से फीस इकट्ठा करते हैं, और नए सिक्के उत्पन्न करते हैं।`,
      paragraph_two: `यह समझना काफी आसान है कि एक ब्लॉक में कुल ट्रांजैक्शन फीस को कैसे जोड़ा जाता है, लेकिन वह ब्लॉक सब्सिडी (block subsidy) वैल्यू कहाँ से आती है? बिटकॉइन नेटवर्क में हर प्रतिभागी यह कैसे निर्धारित करता है कि माइनर्स को किसी भी समय वास्तव में कितना नया बिटकॉइन उत्पन्न करने की अनुमति है?`,
      paragraph_three: `यह सातोशी नाकामोतो द्वारा लिखा गया एल्गोरिदम है जो शुरुआत से ही बिटकॉइन प्रणाली की एक अपरिवर्तनीय मूल विशेषता बना हुआ है:`,
      list_one: `2009 में माइन किए गए ब्लॉक #1 से शुरू होकर, ब्लॉक सब्सिडी 50 BTC (या 5,00,00,00,000 सतोशी) है।`,
      list_two: `प्रत्येक 2,10,000 ब्लॉक्स के बाद वह वैल्यू आधी कर दी जाती है।`,
      paragraph_four: `ब्लॉक हाइट 2,09,999 पर सब्सिडी 50 BTC थी। अगले ही ब्लॉक हाइट 2,10,000 पर सब्सिडी 25 BTC हो गई, और इसी तरह। 63 "ह्विंग्स" (halvings) के बाद सब्सिडी केवल एक सतोशी रह जाएगी। आखिरी ह्विंग सब्सिडी को शून्य पर ले आएगी।`,
      paragraph_five: `और वह आखिरी ह्विंग कल ही हुई थी!`,
      paragraph_six: `निम्नलिखित फंक्शन के कार्यान्वयन को पूरा करें जो आर्गुमेंट के रूप में ब्लॉक हाइट स्वीकार करता है और सतोशी में सब्सिडी की वैल्यू रिटर्न करता है।`,
      success: `get_subsidy फंक्शन बहुत अच्छा लग रहा है। अच्छा काम!`,
    },
    building_blocks_seven: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `वैध ब्लॉक प्राप्त करें`,
      heading: `वह हानिकारक बदमाश!`,
      paragraph_one: `हाइट 6929851 पर चार ब्लॉक उम्मीदवार हैं। उनमें से केवल एक वैध ब्लॉक है, अन्य तीन वेंडरपूल के कार्टेल द्वारा बिटकॉइन मुद्रा आपूर्ति को बढ़ाने के लापरवाह प्रयासों में माइन किए गए थे।`,
      paragraph_two: `पिछले चैलेंज में लिखे गए ब्लॉक सब्सिडी फंक्शन और JSON-RPC API का उपयोग करते हुए, ब्लॉक उम्मीदवार की वैधता की जांच करने के लिए एक फंक्शन लिखें। यह जांचकर करें कि क्या कॉइनबेस आउटपुट सही है। यदि ब्लॉक वैध है तो आपका फंक्शन true रिटर्न करना चाहिए।`,
      paragraph_three: `यहाँ बताया गया है कि हाइट 6929851 पर एक वैध ब्लॉक खोजने के लिए आपके कोड का उपयोग कैसे किया जाएगा:`,
      success: `वैलिडेट ब्लॉक फंक्शन बहुत अच्छा लग रहा है। अच्छा काम!`,
    },
    building_blocks_eight: {
      title: `बिल्डिंग ब्लॉक्स`,
      nav_title: `शो टाइम!`,
      heading_one: `शो टाइम!`,
      paragraph_one: `कैमरे चल रहे हैं, दुनिया भर के दो अरब लोग लाइव स्ट्रीम देख रहे हैं। अगले कमर्शियल ब्रेक तक केवल कुछ ही मिनट बचे हैं। डेबोरा चंक को पसीना आ रहा है। किसी तरह, होलोकैट को भी पसीना आ रहा है। कॉल के दूसरे छोर पर कहीं वेंडरपूल को भी पसीना आ रहा होगा। यह आपका पल है।`,
      paragraph_two: `हाइट 6929851 पर आपके द्वारा खोजे गए ब्लॉक से ठीक पहले वाले वैध ब्लॉक से शुरू करते हुए, वैध ब्लॉक्स की सबसे लंबी चेन ढूंढें जिसे आप ढूंढ सकते हैं। चेन को ब्लॉक हैश की एरे के रूप में स्टोर करें। इसके साथ ही, आपके द्वारा खोजे गए हर अमान्य ब्लॉक की एक एरे भी बनाए रखें, ताकि दुनिया को दिखाया जा सके कि वेंडरपूल ने बिटकॉइन को तोड़ने की कितनी कोशिश की। इससे कोई फर्क नहीं पड़ता कि ये अमान्य ब्लॉक हैश किस क्रम में हैं, लेकिन आपकी वैध चेन ब्लॉक 6929850 के हैश से शुरू होनी चाहिए और उसके बाद चेन टिप तक प्रत्येक हाइट पर एक ब्लॉक हैश होना चाहिए।`,
      paragraph_three: `वेंडरपूल चालाक है! उसने अमान्य ब्लॉक्स के ऊपर वैध ब्लॉक्स माइन किए, और वैध ब्लॉक्स की छोटी चेन के ऊपर अमान्य ब्लॉक्स! यह बाहर एक भूलभुलैया, एक माइनफील्ड है। जब आप पेड़ (tree) को पार करते हैं तो आपको कई वैध शाखाओं (branches) का ट्रैक रखने की आवश्यकता हो सकती है। ऐसे वैध जनक (parents) वाले वैध ब्लॉक होंगे जो सबसे लंबी चेन में नहीं हैं! अंत में, केवल एक वैध लीफ (leaf) होगी जिसकी ऊँचाई अन्य सभी से अधिक होगी।`,
      paragraph_four: `याद रखें: JSON API द्वारा रिटर्न किए गए ब्लॉक ऑब्जेक्ट्स में एक प्रॉपर्टी "prev" होती है जो उस ब्लॉक के जनक को उसके हैश द्वारा पहचानती है:`,
      heading_two: `एक ब्लॉक केवल तभी वैध होता है यदि:`,
      paragraph_five: `इसका कॉइनबेस आउटपुट वैल्यू अपेक्षित ब्लॉक सब्सिडी प्लस ब्लॉक में कुल ट्रांजैक्शन फीस के बराबर हो।`,
      heading_three: `और`,
      paragraph_six: `ब्लॉक एक अन्य वैध (VALID) ब्लॉक की संतान हो। यह एक वैध चेन (VALID CHAIN) सुनिश्चित करता है।`,
      paragraph_seven: `"valid" और "invalid" लेबल वाली दो एरे के साथ एक JSON ऑब्जेक्ट रिटर्न करें:`,
      success: `शो-टाइम फंक्शन बहुत अच्छा लग रहा है। अच्छा काम!`,
    },
    outro_one: {
      title: `उपसंहार`,
      nav_title: `अध्याय पूर्ण`,
      heading: `हम इसे लाइव कर रहे हैं!`,
      paragraph_one: `आपने सबसे लंबी चेन ढूंढ ली और इसे सबके सामने साबित कर दिया! आपके द्वारा खोजे गए अमान्य ब्लॉक्स की सूची प्रभावशाली रूप से लंबी है। वेंडरपूल ने लोगों को सब्सिडी वाले ब्लॉक्स स्वीकार करने के लिए बहुत कोशिश की, लेकिन वह बिटकॉइन के नियमों को बदलने के लिए कुछ नहीं कर सका। जैसा कि हमने देखा, सिर्फ इसलिए कि एक ब्लॉक चेन का हिस्सा है, इसका मतलब यह नहीं है कि वह वैध है। अब, आप वेंडरपूल को बदनाम करने के एक कदम और करीब हैं। कहने की जरूरत नहीं है कि उसने सुश्री चंक के बाकी सवालों के जवाब नहीं दिए।`,
    },
    resources: {
      building_blocks_three: {
        tip: `यह पता लगाने के लिए कि कौन से कमांड उपलब्ध हैं, पहले इस कमांड को आजमाएं।`,
        rpc_heading: `RPC कमांड्स`,
        rpc_paragraph_one: `RPC कमांड्स कमांड का एक इंटरफेस हैं जो एक क्लाइंट को प्रोग्राम से अनुरोध (requests) करने की अनुमति देते हैं, जिससे क्लाइंट और सर्वर के बीच एक इंटरेक्शन बनता है। ये अनुरोध उन मापदंडों (parameters) के साथ क्लाइंट द्वारा भेजे जाते हैं जिनकी क्लाइंट को अपने अनुरोध को संशोधित करने के लिए आवश्यकता होती है।`,
      },
      building_blocks_four: {
        block_data_heading: `ब्लॉक डेटा`,
        block_data_paragraph_one: `अपने मूल में बिटकॉइन एक लेज़र (ledger) है, इसकी शुरुआत से अब तक भेजे गए सभी ट्रांजैक्शन की एक सूची। प्रत्येक ट्रांजैक्शन ब्लॉक द्वारा व्यवस्थित किया जाता है और प्रत्येक ब्लॉक जेनेसिस ब्लॉक से क्रम में व्यवस्थित होता है।`,
      },
      building_blocks_five: {
        transaction_data_heading: `ट्रांजैक्शन डेटा`,
        transaction_data_paragraph_one: `प्रत्येक ट्रांजैक्शन में खुद को अन्य ट्रांजैक्शन से अलग करने के लिए और यह स्पष्ट करने के लिए कि कितना बिटकॉइन ट्रांसफर किया गया है और किन इनपुट्स और आउटपुट्स का उपयोग किया जा रहा है, जानकारी का अपना सबसेट होता है।`,
      },
      building_blocks_six: {
        block_subsidy_heading: `ब्लॉक सब्सिडी`,
        block_subsidy_paragraph_one: `ब्लॉक सब्सिडी प्रत्येक नए ब्लॉक के कॉइनबेस से सर्कुलेशन में जारी किए गए बिटकॉइन की राशि है। चूंकि केवल लगभग 21 मिलियन कुल बिटकॉइन बनाए जा सकते हैं, इसलिए कॉइनबेस सब्सिडी के लिए कुछ घटता हुआ समीकरण होना चाहिए जो 21 मिलियन की राशि तक पहुँच सके। नीचे दिया गया समीकरण बिटकॉइन में जो मौजूद है उसे विज़ुअलाइज़ करता है।`,

        block_subsidy_paragraph_two: `यह समीकरण क्या करता है? हम जानते हैं कि जेनेसिस ब्लॉक का कॉइनबेस रिवॉर्ड 50 बिटकॉइन था और यह समीकरण के दाईं ओर के अंश (numerator) के साथ इंगित किया गया है। हर (denominator) हमारे समीकरण का वह हिस्सा है जो इंगित करता है कि प्रत्येक ह्विंग (halving) में रिवॉर्ड कितना कम हो जाएगा, इस मामले में 2, या आधा। हम यह भी जानते हैं कि बिटकॉइन केवल एक कालानुक्रमिक प्रणाली के रूप में व्यक्तिगत ब्लॉक्स के बारे में जानता है इसलिए हम प्रत्येक ह्विंग को 2,10,00,000 ब्लॉक्स लंबा बनाते हैं। अंत में हम चाहते हैं कि प्रत्येक ह्विंग हर बार दोगुनी हो जाए, इसलिए हम उस राशि को दोगुना करना चाहते हैं जिससे सब्सिडी प्रत्येक ह्विंग द्वारा आधी हो जाती है, इसलिए हम 2 को वर्तमान ह्विंग 'i' की घात तक बढ़ाते हैं।`,
      },
      building_blocks_seven: {
        validating_heading: `ब्लॉक्स को वैलिडेट करना`,
        validating_paragraph_one: `एक ब्लॉक को वैलिडेट करना नेटवर्क की मजबूती के लिए अविश्वसनीय रूप से महत्वपूर्ण है क्योंकि प्रत्येक ब्लॉक पिछले ब्लॉक्स के ट्रांजैक्शन पर बनाया गया है, यदि अतीत में कोई भी ब्लॉक अमान्य पाया जाता है तो यह बड़े परिणाम पैदा कर सकता है क्योंकि ब्लॉक्स की एक लंबी चेन संदेह के घेरे में आ जाती है।`,
      },
      building_blocks_eight: {
        showtime_heading: `चेन को वैलिडेट करना`,
        showtime_paragraph_one: `पूरे नेटवर्क की अखंडता और सुरक्षा बनाए रखने के लिए बिटकॉइन में ब्लॉकचेन को वैलिडेट करना महत्वपूर्ण है। प्रत्येक ट्रांजैक्शन को माइनर्स द्वारा यह सुनिश्चित करने के लिए सत्यापित किया जाना चाहिए कि यह वैध है और नेटवर्क द्वारा स्थापित सर्वसम्मति नियमों का पालन करता है। यह सत्यापन प्रक्रिया डबल-स्पेंडिंग और धोखाधड़ी को रोकती है, जिससे उपयोगकर्ता किसी केंद्रीय प्राधिकरण की आवश्यकता के बिना सिस्टम पर भरोसा कर सकते हैं। इसके अलावा, यह पारदर्शिता बढ़ाता है, क्योंकि सभी सत्यापित ट्रांजैक्शन एक सार्वजनिक लेज़र पर रिकॉर्ड किए जाते हैं, जिससे कोई भी ट्रांजैक्शन के इतिहास का ऑडिट कर सकता है।`,
      },
    },
  },
  chapter_nine: {
    title: `भरोसा न करें, सत्यापित करें (Don't trust, verify).`,
    paragraph_one: `बिल्कुल सही समय पर, आपने दुनिया के सामने यह साबित कर दिया कि वेंडरपूल अमान्य ब्लॉक्स के साथ बिटकॉइन नेटवर्क को भ्रमित करने का प्रयास कर रहा है। जैसे ही कमर्शियल ब्रेक आता है, स्टूडियो का टेलीविजन क्रू अगले सेगमेंट की तैयारी करता है।`,
    intro_one: {
      title: `परिचय`,
      nav_title: `धमकियाँ`,
      paragraph_one: `हर कोई जश्न मना रहा है; हर कोई मुस्कुरा रहा है। लेकिन सेट पर एक आदमी है जो खुश नहीं है: एक लंबा, अच्छे कपड़े पहने, भूरे बालों वाला आदमी जिसे आप तुरंत पहचान लेते हैं। भीड़ छँटती है, और आप उसे पहली बार आमने-सामने देखते हैं: वेंडरपूल!`,
      paragraph_two: `उसकी मुट्ठियाँ भिंची हुई हैं। आपने उसका व्यवसाय बर्बाद कर दिया है और उसके परिवार के लंबे समय से चल रहे धोखे का पर्दाफाश कर दिया है। उसके मुँह से निकलने वाली पहली चीज़ आपकी बाकी ज़िंदगी के लिए "अनंत गुना" (times infinity) मुकदमा करने की धमकी है।`,
    },
    intro_two: {
      title: `परिचय`,
      nav_title: `समझौते पर आना`,
      paragraph_one: `जैसे ही वेंडरपूल चिल्लाता है, एक निर्माता अंदर आता है और आपको बताता है कि दुनिया भर के दर्शक आपको... किसी कारण से बिटकॉइन और कैलज़ोन (calzones) दान करके आपके काम का समर्थन करना चाहते हैं! डेबोरा आपसे दर्शकों को एक वॉलेट पता (address) प्रदान करने के लिए कहती है।`,
      paragraph_two: `यह वेंडरपूल को और भी आगबबूला कर देता है। वह मांग करता है कि आप आने वाले दान को उसके साथ बांटें, वरना वह आप पर और भी अधिक मुकदमे कर देगा—मानो अनंत से अधिक मुकदमे हो सकते हों।`,
      paragraph_three: `वेंडरपूल के साथ दान साझा करना कोई मायने नहीं रखता। पैसा उन लोगों से आ रहा है जो बिटकॉइन को कमजोर करने के वेंडरपूल के प्रयासों को उजागर करने के लिए आपको धन्यवाद देना चाहते हैं। आपको एहसास होता है कि यह मांग पैसे से ज्यादा उसकी हार के बारे में है। एक पल के लिए, आपको उसके लिए बुरा भी लगने लगता है। उसने खुद को एक ऐसे कोने में धकेल दिया है जहाँ से बाहर निकलने का कोई रास्ता नहीं है।`,
      paragraph_four: `मानो वह आपका मन पढ़ सकती हो, डेबोरा चंक हस्तक्षेप करती है। वह पूछती है कि क्या कोई ऐसी चैरिटी है जिसे वेंडरपूल दान का एक हिस्सा जाते हुए देखना चाहेगा। आपके आश्चर्य का ठिकाना नहीं रहता जब वह उत्साहपूर्वक 'लिल बिट्स फाउंडेशन' (Lil Bits Foundation) का नाम लेता है, जो बच्चों की मदद के लिए समर्पित एक गैर-लाभकारी संस्था है।`,
      paragraph_five: `वेंडरपूल का रंग मूली जैसे लाल से चुकंदर जैसे बैंगनी में शांत हो जाता है। आप अपने और वेंडरपूल के बीच एक बिटकॉइन स्क्रिप्ट अनुबंध (contract) बनाना शुरू करते हैं। वह लिल बिट्स फाउंडेशन तक फंड पहुँचाने के लिए जिम्मेदार है। इस स्क्रिप्ट अनुबंध का उपयोग आप दान का पता निकालने के लिए करेंगे। यह वेंडरपूल को एक अविश्वसनीय प्रतिपक्ष (untrustable counterparty) के रूप में मानेगा और यह सुनिश्चित करेगा कि आप दोनों अपनी सहमति के अनुसार और समय पर इसे खर्च कर सकें।`,
    },
    opcodes_one: {
      title: `ऑपकोड्स (OpCodes)`,
      nav_title: `बिटकॉइन स्क्रिप्ट`,
      heading: `बिटकॉइन स्क्रिप्ट`,
      paragraph_one: `हमने अध्याय 6 में बिटकॉइन स्क्रिप्ट का उल्लेख किया था, लेकिन हमने उस पर अधिक ध्यान नहीं दिया क्योंकि जो सिक्के आप खर्च कर रहे थे, वे एक सरल तंत्र द्वारा लॉक किए गए थे: एक एकल सिग्नेचर और एक निहित स्क्रिप्ट जो पब्लिक की के साथ उस सिग्नेचर का मूल्यांकन करती थी। अब चीजें और दिलचस्प होने वाली हैं।`,
      paragraph_two: `बिटकॉइन आउटपुट को खर्च करने के दो महत्वपूर्ण हिस्से होते हैं: एक स्क्रिप्ट और एक स्टैक।`,
      paragraph_three: `हम पहले इन दोनों अवधारणाओं को उच्च स्तर पर समझेंगे।`,
    },
    opcodes_two: {
      title: `ऑपकोड्स`,
      nav_title: `बिटकॉइन स्टैक`,
      heading: `स्टैक (The stack)`,
      paragraph_one: `किताबों के ढेर (stack) के बारे में सोचें 📚। यदि आप एक किताब जोड़ना चाहते हैं, तो आपको उसे ढेर के ऊपर रखना होगा। उसके लिए और कोई जगह नहीं है। यदि आप कोई किताब पढ़ना चाहते हैं, तो आप केवल उसी तक पहुँच सकते हैं जो ढेर के सबसे ऊपर है। यहाँ तक कि यदि आप एक से अधिक चाहते हैं, तो आपको ढेर के ऊपर से शुरू करना होगा और नीचे की ओर बढ़ना होगा। कंप्यूटिंग की भाषा में, स्टैक डेटा आइटम्स की एक एरे (array) की तरह है जिसमें दो ऑपरेशन होते हैं:`,
      paragraph_two: `<span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_PUSH</span> स्टैक के "ऊपर" एक आइटम जोड़ें।`,
      paragraph_three: `<span className="text-[#3DCFEF] w-fit rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_POP</span> प्रोसेसिंग के लिए स्टैक से "ऊपरी" आइटम को हटाएँ।`,
      subheading_one: `उदाहरण:`,
      stack_list_one: `यहाँ एक स्टैक है: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">[]</span>`,
      stack_list_two: `नंबर 1 पुश करें: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">[1]</span>`,
      stack_list_three: `नंबर 2 पुश करें: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">[1, 2]</span>`,
      stack_list_four: `स्टैक के शीर्ष आइटम को पॉप करें: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">[1]</span>`,
      paragraph_four: `ध्यान दें कि स्टैक पर पुश किया गया पहला आइटम स्टैक से पॉप किया जाने वाला आखिरी आइटम होगा, इसलिए यह स्क्रिप्ट द्वारा संसाधित (process) किया जाने वाला अंतिम आइटम होगा। इस कारण से स्टैक में "उल्टा" या "पीछे की ओर" जैसा महसूस होता है, और स्टैक पर आप जो पहली चीज़ देखते हैं, वह संभवतः स्क्रिप्ट प्रोसेसिंग के अंत में आवश्यक समाधान होगा।`,
      paragraph_five: `बिटकॉइन ट्रांजैक्शन आउटपुट को खर्च करते समय, खर्च करने वाले के लिए आवश्यक तत्व खर्च करने वाले ट्रांजैक्शन के इनपुट के 'विटनेस' (witness) सेक्शन में दिए जाते हैं (अध्याय 6 देखें) और वे तत्व स्क्रिप्ट प्रोसेसिंग शुरू होने से पहले स्टैक पर पुश कर दिए जाते हैं। हम उन आइटम्स को 'प्रारंभिक स्टैक' (INITIAL STACK) कहेंगे। वे महत्वपूर्ण हैं क्योंकि वे वास्तव में वह डेटा हैं जो एक स्क्रिप्ट को अनलॉक करते हैं और सिक्कों को खर्च करने की अनुमति देते हैं!`,
    },
    opcodes_three: {
      title: `ऑपकोड्स`,
      nav_title: `ऑपकोड्स`,
      heading: `ऑपकोड्स (OpCodes)`,
      paragraph_one: `स्क्रिप्ट कमांड्स की एक रैखिक श्रृंखला है जिन्हें एक-एक करके निष्पादित किया जाता है, जो स्टैक पर मौजूद आइटम्स में बदलाव करते हैं। जब स्क्रिप्ट का अंत होता है, तो स्टैक पर ठीक एक गैर-शून्य (गैर-गलत / TRUE) आइटम बचा होना चाहिए, अन्यथा पूरा ऑपरेशन अमान्य हो जाता है और आपका बिटकॉइन ट्रांजैक्शन भी अमान्य हो जाता है। बिटकॉइन स्क्रिप्ट भाषा में 100 से अधिक कमांड हैं, जिन्हें "ऑपकोड्स" कहा जाता है। हम इस चुनौती के लिए उनमें से केवल कुछ का उपयोग करने जा रहे हैं।`,
      paragraph_two: `आइए एक उदाहरण देखें जहाँ हम बिटकॉइन को इस गणित की समस्या के साथ लॉक करते हैं: 1 + 2 = ? जो कोई भी इस गणित की समस्या का उत्तर जानता है, वह सिक्कों को खर्च कर सकता है।`,
      paragraph_three: `स्क्रिप्ट कुछ इस तरह दिखेगी:`,
      paragraph_four: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_1 OP_2 OP_ADD OP_EQUAL</span>`,
      paragraph_five: `इस स्क्रिप्ट को हैश किया जाएगा और bech32-एनकोड करके एक पते में बदल दिया जाएगा जहाँ कोई सिक्के भेज सकता है।`,
    },
    opcodes_four: {
      title: `ऑपकोड्स`,
      nav_title: `स्टैक समाधान`,
      heading: `स्टैक समाधान`,
      paragraph_one: `स्टैक समाधान इस तरह दिखेगा और खर्च करने वाले ट्रांजैक्शन में ये सभी तत्व होने चाहिए। वे उस इनपुट के विटनेस सेक्शन में जाते हैं जो इन सिक्कों को खर्च करने की कोशिश कर रहा है। आइए इसे चरणों में समझते हैं:`,
      table_one: {
        headings: {
          item_one: `चरण (Step)`,
          item_two: `स्टैक (Stack)`,
          item_three: `स्क्रिप्ट निष्पादन (Script Execution)`,
        },
      },
      subheading_one: `स्पष्टीकरण`,
      stack_list_one: `init: फंडिंग ट्रांजैक्शन आउटपुट और खर्च करने वाले ट्रांजैक्शन इनपुट को एक साथ लाया जाता है।`,
      stack_list_two: `स्टेप 1: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_1</span> स्टैक पर "1" पुश करता है।`,
      stack_list_three: `स्टेप 2: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_2</span> स्टैक पर "2" पुश करता है।`,
      stack_list_four: `स्टेप 3: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ADD</span> स्टैक से दो आइटम पॉप करता है, उन्हें एक साथ जोड़ता है, और योग (sum) को वापस स्टैक पर पुश करता है।`,
      stack_list_five: `स्टेप 4: <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_EQUAL</span> स्टैक से दो आइटम पॉप करता है, उनकी तुलना करता है, और एक बूलियन (Boolean) परिणाम वापस स्टैक पर पुश करता है।`,
      paragraph_two: `अब हम स्क्रिप्ट के अंत तक पहुँच गए हैं और स्टैक पर केवल एक ही 'TRUE' आइटम बचा है - सिक्के खर्च हो गए!`,
      paragraph_three: `यदि हमने इस उदाहरण को स्टैक पर 4 के साथ शुरू किया होता, तो हम सिक्कों को खर्च नहीं कर पाते क्योंकि OP_EQUAL का परिणाम 'FALSE' होता। इन चुनौतियों के लिए हम ऑपकोड्स के एक बहुत ही सीमित सेट का उपयोग करने जा रहे हैं, जिन्हें हम श्रेणी के अनुसार पेश करेंगे।`,
    },
    opcodes_five: {
      title: `ऑपकोड्स`,
      nav_title: `बुनियादी अंकगणित`,
      heading: `बुनियादी अंकगणित`,
      paragraph_one: `बिटकॉइन स्क्रिप्ट सरल गणितीय ऑपरेशन कर सकती है। आप साधारण गणित का उपयोग करके सिक्कों को लॉक कर सकते हैं लेकिन फिर कोई भी जो गणित जानता है वह सिक्कों को खर्च कर सकता है! दूसरे शब्दों में, इसे मेननेट (mainnet) पर न आजमाएँ।`,
      subheading_one: `ऑपकोड्स जो स्टैक पर पूर्णांक (integers) या मनमाना डेटा पुश करते हैं`,
      opconstants_list_one_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_0</span>`,
      opconstants_list_one_paragraph: `स्टैक पर नंबर 0 पुश करता है।`,
      opconstants_list_two_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_1</span>`,
      opconstants_list_two_paragraph: `स्टैक पर नंबर 1 पुश करता है।`,
      opconstants_list_three_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_2</span>`,
      opconstants_list_three_paragraph: `स्टैक पर नंबर 2 पुश करता है।`,
      opconstants_list_four_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_3</span>`,
      opconstants_list_four_paragraph: `स्टैक पर नंबर 3 पुश करता है।`,
      opconstants_list_five_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_DUP</span>`,
      opconstants_list_five_paragraph: `शीर्ष स्टैक आइटम की एक प्रति (duplicate) स्टैक पर पुश करता है।`,
      opconstants_list_six_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_PUSH</span>`,
      opconstants_list_six_paragraph: `निम्नलिखित स्क्रिप्ट वैल्यू को स्टैक पर पुश करता है। उदाहरण वैल्यू में SIG(alice), PUBKEY(alice), HASH256(secret), secret शामिल हैं। छोटे अक्षरों वाली स्ट्रिंग्स वास्तविक डेटा का प्रतिनिधित्व करती हैं और इस दुभाषिया (interpreter) के अन्य ऑपकोड्स उन्हें वैसे ही संसाधित करेंगे जैसे वे वास्तविक चाबियाँ, सिग्नेचर, हैश और प्रीइमेज हों।`,
      subheading_two: `ऑपकोड्स जो अंकगणित करते हैं`,
      oparithmetic_list_one_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ADD</span>`,
      oparithmetic_list_one_paragraph: `स्टैक से दो आइटम पॉप करता है, उन्हें जोड़ता है, और उनके योग को वापस स्टैक पर पुश करता है।`,
      oparithmetic_list_two_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_EQUAL</span>`,
      oparithmetic_list_two_paragraph: `स्टैक से दो आइटम पॉप करता है, उनकी समानता की तुलना करता है, और वापस एक बूलियन पुश करता है।`,
      oparithmetic_list_three_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_EQUALVERIFY</span>`,
      oparithmetic_list_three_paragraph: `OP_EQUAL की तरह ही, लेकिन यदि दो आइटम बराबर नहीं हैं, तो यह त्रुटि देता है और स्क्रिप्ट निष्पादन को तुरंत रोक देता है।`,
      paragraph_two: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
    },
    opcodes_six: {
      title: `ऑपकोड्स`,
      nav_title: `क्रिप्टोग्राफी के साथ डिकोड करें`,
      heading: `सरल क्रिप्टोग्राफी`,
      paragraph_one: `हमने पिछले अध्यायों में "पे टू पब्लिक की हैश" (pay to public key hash) के बारे में जाना है। यह वह बिटकॉइन स्क्रिप्ट है जो सेग्रिगेटेड विटनेस के आने से पहले लाखों ट्रांजैक्शन आउटपुट में स्पष्ट रूप से लिखी गई थी। सिक्के पब्लिक की के हैश द्वारा लॉक किए जाते हैं। खर्च करने वाले को उस पब्लिक की को प्रकट करना होगा जो उस हैश से मेल खाती है, और फिर उस पब्लिक की द्वारा सत्यापित एक सिग्नेचर प्रदान करना होगा।`,
      subheading_one: `ऑपकोड्स जो सरल क्रिप्टोग्राफी करते हैं`,
      opcryptography_list_one_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm h-fit">OP_HASH256</span>`,
      opcryptography_list_one_paragraph: `स्टैक से एक आइटम पॉप करता है, डबल-SHA256 डाइजेस्ट की गणना करता है और उस डाइजेस्ट को वापस स्टैक पर पुश करता है। हमारे अभ्यास में इस ऑपरेशन को स्ट्रिंग्स का उपयोग करके दर्शाया गया है। उदाहरण: स्क्रिप्ट OP_1 OP_HASH256 स्टैक [HASH256(1)] उत्पन्न करती है।`,
      opcryptography_list_two_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm h-fit">OP_CHECKSIG</span>`,
      opcryptography_list_two_paragraph: `स्टैक से दो आइटम पॉप करता है। जो पहला आइटम यह पॉप करता है वह PUBKEY(...) फॉर्मेट में एक पब्लिक की होनी चाहिए। दूसरा आइटम SIG(...) फॉर्मेट में एक सिग्नेचर होना चाहिए। यदि दोनों आइटम्स के कोष्ठक के अंदर की स्ट्रिंग्स बराबर हैं, तो हम उसे एक वैध ECDSA सिग्नेचर मानते हैं और स्टैक पर 'TRUE' पुश करते हैं, अन्यथा 'FALSE'।`,
      paragraph_two: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
    },
    opcodes_seven: {
      title: `ऑपकोड्स`,
      nav_title: `मल्टीसिग (Multisig)`,
      heading: `मल्टीसिग`,
      paragraph_one: `मल्टीसिग्नेचर नीतियां पब्लिक कीज़ की एक सूची और वैध खर्च के लिए आवश्यक सिग्नेचर की संख्या प्रदान करती हैं। इसे "m-of-n" के रूप में वर्णित किया जा सकता है, जिसका अर्थ है "n पब्लिक कीज़ की इस सूची में से m संख्या में सिग्नेचर आवश्यक हैं"। पब्लिक कीज़ और m एवं n की वैल्यू आमतौर पर लॉकिंग स्क्रिप्ट में शामिल होती हैं और खर्च करने वाले को केवल सही संख्या में सिग्नेचर प्रदान करने की आवश्यकता होती है।`,
      paragraph_two: `होलोकैट सातोशी नाकामोतो के एक पहले से रिकॉर्ड किए गए संदेश के साथ आती है!`,
      paragraph_three: `नमस्ते। जब मैंने <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_CHECKMULTISIG</span> लागू किया था, तो गलती से एक बग (bug) रह गया था। यह स्टैक से एक अतिरिक्त आइटम पॉप करता है जिसका बिल्कुल भी उपयोग नहीं किया जाता है। तो, उह, ओप्स। क्षमा करें। वह कोड सर्वसम्मति-महत्वपूर्ण (consensus-critical) है, इसलिए बिटकॉइन के अतीत, वर्तमान और भविष्य के हर <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_CHECKMULTISIG</span> ऑपरेशन में एक "डमी" (dummy) तत्व शामिल करने के लिए मजबूर होना पड़ेगा। इसे भूलना मत वरना आप अपने मल्टीसिग सिक्के खर्च नहीं कर पाएंगे!`,
    },
    opcodes_eight: {
      title: `ऑपकोड्स`,
      nav_title: `एकाधिक चाबियों के साथ साइन करें`,
      heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-1">OP_CHECKMULTISIG</span>`,
      subheading_one: `इस एल्गोरिदम का पालन करके m-of-n मल्टीसिग्नेचर को संसाधित करता है।`,
      multisig_list_one: `स्टैक से एक एकल पूर्णांक पॉप करें। यह <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">n</span> वैल्यू है।`,
      multisig_list_two: `स्टैक से <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">n</span> संख्या में आइटम पॉप करें, इन सभी के <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">PUBKEY(...)</span> फॉर्मेट की पब्लिक की होने की उम्मीद है।`,
      multisig_list_three: `स्टैक से एक एकल पूर्णांक पॉप करें। यह <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">m</span> वैल्यू है।`,
      multisig_list_four: `स्टैक से <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">m</span> संख्या में आइटम पॉप करें, इन सभी के <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">SIG(...)</span> फॉर्मेट के सिग्नेचर होने की उम्मीद है।`,
      multisig_list_five: `बिल्कुल बिना किसी कारण के स्टैक से एक अतिरिक्त तत्व पॉप करें।`,
      multisig_list_six: `प्रत्येक पब्लिक की के माध्यम से दोहराएँ: स्टैक के सबसे ऊपरी सिग्नेचर के विरुद्ध की (key) को सत्यापित करें। यदि यह वैध है, तो की और सिग्नेचर दोनों को हटा दें और अगली पब्लिक की के साथ जारी रखें। यदि यह वैध नहीं है, तो केवल पब्लिक की को हटा दें और अगली पब्लिक की पर जारी रखें (जो उसी सबसे ऊपरी सिग्नेचर के विरुद्ध जांच करना शुरू करेगी)।`,
      multisig_list_seven: `यदि सभी पब्लिक कीज़ का परीक्षण किया जा चुका है और कोई सिग्नेचर शेष है, तो ऑपरेशन विफल हो जाता है।`,
      multisig_list_eight: `एक बार सभी सिग्नेचर हटा दिए जाने के बाद, ऑपरेशन सफलता के साथ समय से पहले समाप्त हो सकता है, भले ही अधिक पब्लिक कीज़ शेष हों।`,
      paragraph_one: `ध्यान दें कि m <= n. सिग्नेचर की तुलना में पब्लिक कीज़ अधिक हो सकती हैं लेकिन पब्लिक कीज़ की तुलना में सिग्नेचर कभी अधिक नहीं हो सकते। साथ ही ध्यान दें कि कीज़ और सिग्नेचर का क्रम एक ही होना चाहिए, भले ही कुछ कीज़ का उपयोग साइन करने के लिए न किया गया हो।`,
      paragraph_two: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
    },
    opcodes_nine: {
      title: `ऑपकोड्स`,
      nav_title: `अनलॉक करने की प्रतीक्षा करें`,
      heading: `टाइम लॉक्स (Time Locks)`,
      paragraph_one: `पिछली सदी में BIP 65 नामक एक दस्तावेज़ ने बिटकॉइन के लिए एक नया ऑपकोड प्रस्तावित किया था जिसे अंततः सर्वसम्मति नियमों में जोड़ दिया गया था। इसका उपयोग यह आवश्यक करने के लिए किया जाता है कि ट्रांजैक्शन का nLocktime स्क्रिप्ट द्वारा निर्दिष्ट वैल्यू पर या उससे ऊपर हो। बिटकॉइन के सर्वसम्मति नियम पहले से ही एक ब्लॉक में ट्रांजैक्शन शामिल करने से रोकते हैं यदि उस ब्लॉक की ऊँचाई ट्रांजैक्शन के nLocktime से अधिक न हो। दूसरे शब्दों में, यह ऑपकोड ट्रांजैक्शन को तब तक खर्च करने योग्य नहीं बनाता जब तक कि ब्लॉकचेन भविष्य में एक निश्चित ऊँचाई तक न पहुँच जाए। चूंकि इसे सॉफ्ट फोर्क (soft fork) के साथ जोड़ा गया था, इसलिए यह वास्तव में स्टैक से कुछ भी पॉप नहीं करता है, जिसका अर्थ है कि अधिकांश उपयोगों में <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_DROP</span> की भी आवश्यकता होगी। यदि ऑपकोड यह निर्धारित करता है कि इस ट्रांजैक्शन को ब्लॉक में शामिल करना बहुत जल्दी है, तो स्क्रिप्ट मूल्यांकन तुरंत एक त्रुटि के साथ रुक जाता है।`,
      subheading_one: `ऑपकोड्स जो ब्लॉक टाइमलॉक्स करते हैं`,
      optimelock_list_one_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_DROP</span>`,
      optimelock_list_one_paragraph: `स्टैक से एक आइटम पॉप करता है, उसे अनदेखा करता है।`,
      optimelock_list_two_heading: `<span className="flex items-center text-[#3DCFEF] w-fit rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_CHECKLOCKTIMEVERIFY</span>`,
      optimelock_list_two_paragraph: `शीर्ष स्टैक आइटम को पढ़ता है (पॉप नहीं करता) और इसे ब्लॉक ऊँचाई के रूप में व्याख्या करता है। यदि ऑपकोड द्वारा उपभोग किया गया ऊँचाई आर्गुमेंट कम से कम अगले ब्लॉक की ऊँचाई के बराबर नहीं है, तो ऑपरेशन अमान्य है।`,
      paragraph_two: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
    },
    opcodes_ten: {
      title: `ऑपकोड्स`,
      nav_title: `लॉजिक बनाएँ`,
      heading: `कंडीशनल्स (Conditionals)`,
      paragraph_one: `किसी भी अन्य अच्छी प्रोग्रामिंग भाषा की तरह, बिटकॉइन स्क्रिप्ट में भी लॉजिक ब्रांच (शाखाएँ) होती हैं! शाखाओं के माध्यम से रास्ता आमतौर पर खर्च करने वाले द्वारा चुना जाता है कि उन्हें प्रमाणीकरण शर्तों के किस संयोजन को संतुष्ट करने की आवश्यकता है।`,
      paragraph_two: `<span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_IF</span> <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ELSE</span> <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ENDIF</span> लॉजिक ब्रांचेस।`,
      paragraph_three: `<span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_IF</span> स्टैक से एक वैल्यू पॉप करता है और उसका मूल्यांकन बूलियन के रूप में करता है। यदि यह सही है, तो कोड निष्पादन <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ELSE</span> तक जारी रहता है और फिर <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ENDIF</span> पर कूद जाता है, अन्यथा यह <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ELSE</span> पर कूदता है और <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ENDIF</span> तक निष्पादन जारी रखता है। लॉजिक ब्रांच एक के अंदर एक (nested) हो सकते हैं लेकिन प्रत्येक <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_IF</span> को प्रत्येक शाखा को बंद करने के लिए <span className="text-[#3DCFEF] rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_ENDIF</span> के साथ जोड़ा जाना चाहिए, अन्यथा दुभाषिया एक त्रुटि देगा और स्क्रिप्ट विफल हो जाएगी।`,
      paragraph_four: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
    },
    proposal_one: {
      title: `उन्नत`,
      nav_title: `कहानी पर वापस`,
      heading: `कहानी पर वापस!`,
      paragraph_one: `बहुत बढ़िया! हमने उन अधिकांश ऑपकोड्स को देख लिया है जिनकी आपको बुनियादी ट्रांजैक्शन के लिए स्क्रिप्ट बनाते समय आवश्यकता होगी। अब आइए उनका परीक्षण करते हैं।`,
      paragraph_two: `प्रत्येक अनुबंध प्रस्ताव (contract proposal) के लिए जिस पर आप चर्चा करते हैं, एक बिटकॉइन स्क्रिप्ट और एक वैध खर्च करने वाला स्टैक प्रदान करें।`,
    },
    proposal_two: {
      title: `2 of 2 मल्टीसिग`,
      nav_title: `सहयोग से साइन करें`,
      heading: `2 of 2 मल्टीसिग`,
      paragraph_one: `वेंडरपूल जो पहली चीज़ सुझाता है वह 2-of-2 मल्टीसिग है। सभी दान आपके और लिल बिट्स फाउंडेशन के बीच 50/50 बांटे जाएंगे। इसे आप दोनों द्वारा प्रबंधित किया जाएगा, और आप दोनों दान के पते से होने वाले सभी खर्चों पर हस्ताक्षर करेंगे। इसका मतलब है कि आपको दान के पते से होने वाली सभी निकासी पर सहमत होना होगा।`,
      paragraph_two: `वेंडरपूल आपको अपनी पब्लिक की सौंपता है, यह PUBKEY(vanderpoole) है और आपकी PUBKEY(me) है।`,
      paragraph_three: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
      next_step_message: `अच्छा लग रहा है! अब अपने स्वयं के सिग्नेचर के साथ प्रयास करें।`,
    },
    proposal_three: {
      title: `कंडीशनल टाइम लॉक्ड ट्रांजैक्शन`,
      nav_title: `उसे इंतज़ार कराएँ`,
      heading: `कंडीशनल टाइम लॉक्ड ट्रांजैक्शन`,
      paragraph_one: `एक मिनट रुकिए, यह कोई मायने नहीं रखता—आप हमेशा के लिए उसके साथ डील नहीं करना चाहते! नया सौदा यह है कि अगले दो घंटों तक होने वाले सभी दान आपको मिलेंगे जबकि आप अभी भी टीवी पर हैं। उसके बाद जो कुछ भी आता है वह लिल बिट्स फाउंडेशन को मिलेगा। आप स्टूडियो की दीवार पर लगी बिटकॉइन ब्लॉक घड़ी को देखते हैं और सहमत होते हैं कि ब्लॉक हाइट 6930300 शायद लगभग दो घंटों में माइन हो जाएगी।`,
      paragraph_two: `याद रखें वेंडरपूल की पब्लिक की PUBKEY(vanderpoole) है और आपकी PUBKEY(me) है।`,
      paragraph_three: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
      next_step_message: `अच्छा लग रहा है! अब अपने स्वयं के सिग्नेचर के साथ प्रयास करें।`,
    },
    proposal_four: {
      title: `सीक्रेट प्रीइमेज लॉक्ड ट्रांजैक्शन`,
      nav_title: `ओरेकल के साथ काम करें`,
      heading: `सीक्रेट प्रीइमेज लॉक्ड ट्रांजैक्शन`,
      paragraph_one: `वेंडरपूल अपना विचार फिर से बदल देता है। उसे अज्ञात चीजों के कारण वह सौदा पसंद नहीं आया। वह तय करता है कि वह चाहता है कि लिल बिट्स फाउंडेशन को कुल दान का पहला 1.0 BTC मिले, और आप उसके बाद बाकी खर्च कर सकें।`,
      paragraph_two: `बिटकॉइन स्क्रिप्ट में कई UTXOs के कुल बैलेंस की जांच करने का कोई तरीका नहीं है, इसलिए आप एक निष्पक्ष तीसरे पक्ष के ओरेकल (oracle) पर सहमत होते हैं: डेबोरा चंक! वह ब्लॉकचेन पर कुल दान राशि की निगरानी करेंगी और जैसे ही वे कम से कम 1.0 BTC हो जाएंगे, वह टीवी पर लाइव उस हैश वैल्यू के प्रीइमेज की घोषणा करेंगी जिसे आप स्क्रिप्ट में शामिल करेंगे।`,
      paragraph_three: {
        a: `वह निजी तौर पर एक सुरक्षित रैंडम नॉनस (nonce) उत्पन्न करती है, फिर आपको हैश डाइजेस्ट सौंपती है: <span className="text-[#3DCFEF] w-fit rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">HASH256(FD3771E8)</span>। एक बार जब वह इस रहस्य को प्रकट कर देती है, तो आप प्राप्त होने वाले सभी सिक्के खर्च कर सकते हैं, और एक `,
        b: ` सेकंड भी पहले नहीं!`,
      },
      paragraph_four: `याद रखें वेंडरपूल की पब्लिक की PUBKEY(vanderpoole) है और आपकी PUBKEY(me) है।`,
      paragraph_five: `स्क्रिप्ट से खर्च करने के लिए प्रारंभिक स्टैक प्रदान करें।`,
      tooltip_one: {
        question: `सतोशी क्या है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520a%2520satoshi%253F`,
        highlighted: `सतोशी`,
      },
      next_step_message: `आइए देखें कि क्या हमने प्रीइमेज के साथ अपने सिग्नेचर का सही उपयोग किया है।`,
    },
    outro_one: {
      title: `उपसंहार`,
      nav_title: `अध्याय पूर्ण`,
      heading: `शाबाश!`,
      paragraph_one: `दान अब आपको और लिल बिट्स फाउंडेशन को वितरित कर दिया गया है और कई दर्शक वेंडरपूल के कार्यों पर प्रकाश डालने के लिए आपको धन्यवाद देते हैं। हालाँकि बिटकॉइन की विकेंद्रीकृत प्रकृति नेटवर्क पर कब्जा करना कठिन बनाती है, लेकिन यह उसके जैसे लोगों को कोशिश करने से नहीं रोकती है। आप राहत महसूस कर रहे हैं कि सच आखिरकार सामने आ गया है, खासकर यहाँ तक पहुँचने के लिए की गई इतनी मेहनत के बाद।`,
    },

    resources: {
      opcodes_five: {
        arithmetic_heading: `अंकगणितीय ऑपकोड्स`,
        arithmetic_paragraph: `बिटकॉइन स्क्रिप्ट में अंकगणितीय ऑपरेशन गणित की तरह ही कुछ इनपुट लेते हैं जिन पर गणितीय क्रियाएं की जाती हैं। वास्तविक बिटकॉइन स्क्रिप्ट में इनपुट हस्ताक्षरित (signed) 32-बिट पूर्णांकों तक सीमित होते हैं लेकिन आउटपुट ओवरफ्लो हो सकता है।`,
        spoiler: `प्रारंभिक स्टैक में दो पूर्णांक डालें जिनका योग 3 हो।`,
      },
      opcodes_six: {
        cryptography_heading: `क्रिप्टोग्राफिक ऑपकोड्स`,
        cryptography_paragraph: `ये ऑपकोड्स रोजमर्रा के ट्रांजैक्शन में महत्वपूर्ण हैं क्योंकि वे यह सुनिश्चित करते हैं कि आउटपुट केवल उस utxo के मालिक के सिग्नेचर के साथ ही खर्च किए जा सकें। ध्यान दें कि ऑपकोड्स की कोई औपचारिक श्रेणियां नहीं हैं और वे केवल उनके हेक्स कोड प्रतिनिधित्व द्वारा व्यवस्थित हैं।`,
        spoiler: `स्क्रिप्ट हैश की गई पब्लिक की के विरुद्ध सिग्नेचर की जाँच करती है। पहले सिग्नेचर की डालें फिर पब्लिक की।`,
      },
      opcodes_eight: {
        multisig_heading: `मल्टीसिग ऑपकोड्स`,
        multisig_paragraph: `<span className="text-[#3DCFEF] rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_CHECKMULTISIG</span> में एक उल्लेखनीय बग है जिसके लिए स्टैक में शीर्ष पर एक और अप्रयुक्त वैल्यू शामिल करने की आवश्यकता होती है जिसका वास्तविक मल्टीसिग से कोई संबंध नहीं है।`,
        spoiler: `यह दो सिग्नेचर की आवश्यकता वाली एक मल्टीसिग स्क्रिप्ट है, और स्टैक पर पहली वैल्यू CHECKMULTISIG ऑपरेशन की एक विचित्रता के लिए प्लेसहोल्डर है।`,
      },
      opcodes_nine: {
        timelock_heading: `टाइमलॉक ऑपकोड्स`,
        timelock_paragraph: `बिटकॉइन स्क्रिप्ट वर्तमान ब्लॉक ऊँचाई को पढ़ सकती है जिससे भविष्य में बिटकॉइन ब्लॉक्स के आधार पर ट्रांजैक्शन को लॉक किया जा सकता है। वास्तविक <span className="text-[#3DCFEF] rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_CHECKLOCKTIMEVERIFY</span> की सटीक जानकारी यहाँ मिल सकती है।`,
        timelock_link: `<Link target="_blank" href="https://github.com/bitcoin/bips/blob/master/bip-0065.mediawiki" className="underline">यहाँ</Link>।`,
        spoiler: `स्क्रिप्ट एक विशिष्ट ब्लॉक ऊँचाई तक खर्च करने को लॉक करती है और फिर प्रारंभिक स्टैक में सिग्नेचर को सत्यापित करती है।`,
      },
      opcodes_ten: {
        conditionals_heading: `ऑपकोड लॉजिक`,
        conditionals_paragraph: `कंडीशनल ऑपकोड्स कुछ बुनियादी प्रोग्रामिंग लॉजिक शाखाओं की अनुमति देते हैं। हालाँकि कंडीशनल लॉजिक बिटकॉइन स्क्रिप्ट में अतिरिक्त संभावनाओं की एक विस्तृत श्रृंखला की अनुमति देता है, फिर भी यह पारंपरिक प्रोग्रामिंग भाषा की तुलना में सीमित है।`,
        spoiler: `प्रारंभिक स्टैक पर पहले दो वैल्यू का योग गलत है, इसलिए स्क्रिप्ट OP_ELSE शाखा का पालन करती है।`,
      },
      proposal_two: {
        making_script_heading: `स्क्रिप्ट बनाना`,
        making_script_paragraph: `याद रखें कि स्क्रिप्ट केवल तभी सत्यापित की जा सकती हैं जब वे स्टैक पर एकल 'truthy' वैल्यू के साथ समाप्त हों। कुछ वर्जन किसी भी 'truthy' वैल्यू की अनुमति देते हैं लेकिन हमारा स्क्रिप्ट संपादक केवल 1 या 'true' के बराबर वैल्यू की अनुमति देता है।`,
        tip: `<span className="text-[#3DCFEF] rounded-sm px-1.5 h-[28px] font-mono bg-[#0000004D] m-0.5 text-sm">OP_CHECKMULTISIG</span> में उस बग के बारे में न भूलें जिसके लिए स्टैक पर अतिरिक्त अप्रयुक्त वैल्यू की आवश्यकता होती है!`,
        spoiler: `स्क्रिप्ट संकेत: इस मल्टीसिग व्यवस्था में दोनों प्रतिभागियों को हस्ताक्षर करने की आवश्यकता है। स्क्रिप्ट निर्दिष्ट करती है कि दो सिग्नेचर आवश्यक हैं और इसमें दोनों पब्लिक की शामिल हैं।
स्टैक संकेत: स्क्रिप्ट को संतुष्ट करने के लिए, आपको दोनों सिग्नेचर प्रदान करने होंगे। स्टैक पर 0, CHECKMULTISIG ऑपरेशन के एक विशिष्ट व्यवहार के लिए है।`,
      },
      proposal_three: {
        tip: `वेंडरपूल के सिग्नेचर को आपके सिग्नेचर से अलग करने के लिए कुछ टाइमलॉक के साथ कंडीशनल को जोड़ने के बारे में सोचें।`,
        spoiler: `स्क्रिप्ट संकेत: स्क्रिप्ट दो स्थितियों के तहत खर्च करने की अनुमति देती है: ब्लॉक 6930300 से पहले या बाद में। ब्लॉक से पहले, आप खर्च कर सकते हैं; ब्लॉक के बाद, वेंडरपूल कर सकता है।
स्टैक संकेत: निर्दिष्ट ब्लॉक से पहले खर्च करने के लिए, आप अपने सिग्नेचर का उपयोग करते हैं। ब्लॉक के बाद, वेंडरपूल अपने सिग्नेचर का उपयोग करता है और उसे 0 प्रदान करने की आवश्यकता होती है क्योंकि स्क्रिप्ट लॉक-टाइम सत्यापन से आगे निकल गई है।`,
      },
      proposal_four: {
        tip: `प्रीइमेज का खुलासा अज्ञात समय के बाद होगा इसलिए टाइमलॉक्स का उपयोग करने की कोई आवश्यकता नहीं है।`,
        spoiler: `स्क्रिप्ट संकेत: स्क्रिप्ट दो स्थितियों के तहत खर्च करने की अनुमति देती है: रहस्य उजागर होने से पहले या बाद में। ब्लॉक से पहले, वेंडरपूल खर्च कर सकता है; ब्लॉक के बाद, आप दोनों कर सकते हैं।
स्टैक संकेत: रहस्य उजागर होने से पहले खर्च करने के लिए, वेंडरपूल अपने सिग्नेचर का उपयोग करता है। रहस्य उजागर होने के बाद, आप अपने सिग्नेचर, रहस्य का एक हैश उपयोग करते हैं, और 0 प्रदान करते हैं क्योंकि स्क्रिप्ट उस सत्यापन से आगे निकल गई है।`,
      },
    },
  },
  chapter_ten: {
    title: `10 बिलियन कनेक्शन (10 billion connections)`,
    paragraph_one: `टीवी स्टूडियो की 'ON-AIR' लाइट बंद हो जाती है। एक लंबे और घटनापूर्ण दिन के बाद क्रू के सदस्य अपने 3D कैमरे बंद करके बाहर निकल रहे हैं। मिका 3000 वहाँ आपका इंतज़ार कर रही है।`,
    intro_one: {
      title: `जश्न`,
      nav_title: `जश्न`,
      paragraph_one: `—मिका 3000: "तुमने कर दिखाया! तुमने वाकई इसे मुमकिन कर दिया! चलो कुछ पीते हैं और जश्न मनाते हैं।"`,
      paragraph_two: `आप पास के एक बार में जाते हैं जिसका नाम 'द पब्लिक की पब' (The Public Key Pub) है। लास्ज़लो नाम का एक मिलनसार बारटेंडर आप दोनों का स्वागत करता है।`,
      paragraph_three: `—मिका 3000: "पता नहीं क्यों, लेकिन मुझे अभी एक कैलज़ोन (calzone) खाने की बहुत इच्छा हो रही है।"`,
      paragraph_four: `—लास्ज़लो: "हमारे पास वे तो नहीं हैं, लेकिन मेरे परदादा ने यह सुनिश्चित किया था कि यहाँ का पिज़्ज़ा दुनिया में सबसे अच्छा हो। कुछ लोग कहेंगे—10,000 बिटकॉइन जितना अच्छा।"`,
      paragraph_five: {
        a: `—मिका 3000: "10 हज़ार बिटकॉइन? रुको... क्या तुम्हारा नाम लास्ज़लो इसलिए है क्योंकि तुम वंशज हो `,
        b: ` के?"`,
      },
      paragraph_six: `—लास्ज़लो: "वही इकलौता और असली।"`,
      tooltip_one: {
        question: `लास्ज़लो और पिज़्ज़ा डे का क्या महत्व है?`,
        link: `https://chat.bitcoinsearch.xyz/?author=holocat&question=What%2520is%2520the%2520significance%2520of%2520Laszlo%2520and%2520pizza%2520day%253F`,
        highlighted: `मशहूर लास्ज़लो`,
      },
    },
    intro_two: {
      title: `ड्रिंक्स ऑर्डर करना`,
      nav_title: `ड्रिंक्स ऑर्डर करना`,
      paragraph_one: `—मिका 3000: "यह बहुत कूल है। जब तक इसकी कीमत 10,000 बिटकॉइन न हो, हम वह पिज़्ज़ा और दो 'लाइटनिंग लेमोनेड' (Lightning Lemonades) लेंगे। हालाँकि कैलज़ोन न होने का अफसोस है।"`,
      paragraph_two: `मिका 3000 और लास्ज़लो अपने सौर-ऊर्जा से चलने वाले 'ePhone Infinities' निकालते हैं और बटन दबाना शुरू करते हैं।`,
      paragraph_three: `—मिका 3000: "ओह। तुम्हारे उस कारनामे ने माइनर फीस का हुलिया बिगाड़ दिया है। बिटकॉइन नेटवर्क पर गतिविधि बहुत बढ़ गई है और ट्रांजैक्शन फीस आसमान छू रही है! हमें इसका भुगतान 'ऑफ-चेन' (off-chain) करना होगा।"`,
    },
    intro_three: {
      title: `ऑफ-चेन?`,
      nav_title: `ऑफ-चेन?`,
      paragraph_one: `जब से "सातोशी" ने आपसे संपर्क किया है, आपने केवल ऑन-चेन (on-chain) ट्रांजैक्शन के साथ काम किया है। इसी तरह आपने अपने माइनिंग रिवॉर्ड्स का दावा किया और मिका 3000 को फंड ट्रांसफर किए। हालाँकि, ये ऑन-चेन ट्रांजैक्शन बार-बार होने वाले रोजमर्रा के उपयोग के लिए आदर्श नहीं हैं क्योंकि ब्लॉक स्पेस सीमित है और माइनर फीस बदलती रहती है।`,
      paragraph_two: `तो फिर लोग बिटकॉइन का रोज़ाना स्केलेबल (scalable) तरीके से उपयोग कैसे कर पाते हैं? इसका उत्तर है ऑफ-चेन भुगतान, जिसे आपने शायद लाखों बार देखा होगा: एक नारंगी कैब यात्रियों को उतारकर तेज़ी से निकल जाती है, कोई हलाल कार्ट से रात का खाना खरीद रहा है, या कोई बच्चा स्टोर से अपने होलोडॉग और डिजीमिल्क के साथ बाहर निकल रहा है। पैसे के उपयोग के मामले लगभग अनंत हैं।`,
      paragraph_three: `भले ही बिटकॉइन अपने आप में इतनी अधिक गतिविधि को संभालने के लिए डिज़ाइन नहीं किया गया है, लेकिन ऑफ-चेन भुगतान के साथ, यह मुमकिन है।`,
      paragraph_four: `—आप: "यह बिल्कुल भी समस्या नहीं है, मिका 3000। मैं इसे संभाल सकता हूँ। मैं लास्ज़लो से लाइटनिंग लेमोनेड खरीदने के लिए ऑफ-चेन भुगतान का उपयोग करके इसे साबित करूँगा।"`,
    },
    opening_a_channel_one: {
      title: `प्रारंभिक फंड`,
      nav_title: `प्रारंभिक फंड`,
      heading_one: `प्रारंभिक फंड`,
      paragraph_one: `आपके वॉलेट में ब्लॉकचेन पर 101,000 सतोशी का एक पुष्ट (confirmed) UTXO है। ऑफ-चेन भुगतान करना काफी सरल लगता है, है ना?`,
    },
    opening_a_channel_two: {
      title: `ऑफ-चेन ट्रांजैक्शन`,
      nav_title: `ऑफ-चेन ट्रांजैक्शन`,
      heading_one: `ऑफ-चेन ट्रांजैक्शन`,
      paragraph_one: `आइए एक वैध बिटकॉइन ट्रांजैक्शन बनाते हैं लेकिन इसे नेटवर्क पर ब्रॉडकास्ट करने के बजाय, हम इसे सीधे लास्ज़लो को देंगे। बदले में, वह आपको लाइटनिंग लेमोनेड देगा क्योंकि वह इस ट्रांजैक्शन को जब चाहे ब्रॉडकास्ट कर सकता है। एक बार जब यह ब्लॉक में पुष्ट और माइन हो जाएगा, तो पैसा उसका हो जाएगा।`,
      paragraph_two: `याद रखें यह साल 2140 है! एक लाइटनिंग लेमोनेड की कीमत 0.00001000 BTC है।`,
      heading_two: `निर्देश`,
      off_chain_list_one: `दो आउटपुट राशि भरें: पहले आउटपुट में लास्ज़लो को 1000 सतोशी, और दूसरे आउटपुट में बाकी राशि खुद को 'चेंज' (change) के रूप में दें।`,
      off_chain_list_two: `पैसे पाने के लिए, लास्ज़लो को इस ट्रांजैक्शन को नेटवर्क पर ब्रॉडकास्ट करना होगा, और इसके लिए माइनर फीस की आवश्यकता होगी। चलिए उस फीस के लिए 1000 सतोशी अलग रख देते हैं। इसे ध्यान में रखते हुए अपने चेंज आउटपुट की राशि अपडेट करें।`,
      off_chain_list_three: `दो आउटपुट स्क्रिप्ट लिखें।`,
      off_chain_list_four: `<span className="rounded-sm px-1.5 py-1 h-[28px] bg-[#0000004D] m-0.5 text-base">Sign</span> पर क्लिक करके इनपुट साइन करें।`,
      heading_three: `संकेत (Hints)`,
      hint_one: `लास्ज़लो आउटपुट 0 को <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(LASZLO)</span> के साथ खर्च करता है।`,
      hint_two: `आप आउटपुट 1 को <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(YOU)</span> के साथ खर्च करते हैं।`,
      hint_three: `ये सिग्नेचर आउटपुट स्क्रिप्ट का हिस्सा नहीं हैं।`,
    },
    opening_a_channel_three: {
      title: `ऑफ-चेन भुगतान में भरोसे की समस्या`,
      nav_title: `ऑफ-चेन भुगतान में भरोसे की समस्या`,
      paragraph_one: `—लास्ज़लो: "रुको एक मिनट, यह कोई मायने नहीं रखता—जब तक मैं ट्रांजैक्शन ब्रॉडकास्ट नहीं करता, तुम अभी भी वे 101,000 सतोशी खर्च कर सकते हो। तुम अपना लेमोनेड पी लोगे, पैसे किसी और चीज़ पर खर्च कर दोगे, और मुझे कुछ नहीं मिलेगा!"`,
      paragraph_two: `अगर हम ऑफ-चेन लेनदेन करने जा रहे हैं, तो मुझे इस बात की गारंटी चाहिए कि जिस पैसे का उपयोग तुम मुझे ऑफ-चेन भुगतान करने के लिए कर रहे हो, उसे तुम खुद ऑन-चेन पर नहीं हिला सकते।"`,
    },
    opening_a_channel_four: {
      title: `मल्टीसिग (Multisig)`,
      nav_title: `मल्टीसिग`,
      heading_one: `मल्टीसिग`,
      paragraph_one: `लास्ज़लो को भुगतान करने से पहले, आइए फंड को 2-of-2 मल्टीसिग में डालें, जो ब्लॉकचेन पर पुष्ट हो। फिर हम उस एकल ऑन-चेन ट्रांजैक्शन से अधिक काम लेने का तरीका निकाल सकते हैं—यानी कम में ज़्यादा करना।`,
      heading_two: `निर्देश`,
      multisig_one: `आउटपुट राशि और आउटपुट स्क्रिप्ट भरें।`,
      multisig_two: `<span className="rounded-sm px-1.5 py-1 h-[28px] bg-[#0000004D] m-0.5 text-base">Sign and Broadcast</span> पर क्लिक करके इनपुट साइन करें।`,
      heading_three: `संकेत`,
      hint_one_a: `आप और लास्ज़लो भविष्य में आउटपुट 0 को इस तरह खर्च करने के लिए मिलकर काम करना चाहते हैं: <br/> `,
      hint_one_b: `<span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> 0 SIG(LASZLO) SIG(YOU) </span>`,
      hint_two: `माइनर फीस अलग रखना न भूलें।`,
    },
    opening_a_channel_five: {
      title: `मल्टीसिग में रिफंड सुरक्षा`,
      nav_title: `मल्टीसिग में रिफंड सुरक्षा`,
      paragraph_one: `—लास्ज़लो: "ठीक है, धन्यवाद। यह एक अच्छी शुरुआत है। लेकिन क्या होगा अगर मैं मेज से उठकर चला जाऊँ और तुम मुझे फिर कभी न मिलो? मैं इस ट्रांजैक्शन को ब्रॉडकास्ट कर सकता हूँ, और तुम्हारे 100,000 सतोशी एक 2-की (key) मल्टीसिग में फंस जाएंगे जिससे तुम उन्हें कभी वापस नहीं पा सकोगे।"`,
      paragraph_two: `अपने भले के लिए; इसे साइन करने से पहले एक रिफंड ट्रांजैक्शन (refund transaction) बना लो ताकि तुम्हें पता हो कि तुम अपना पैसा वापस पा सकते हो।"`,
    },
    updating_the_state_one: {
      title: `रिफंड (The refund)`,
      nav_title: `रिफंड`,
      heading_one: `रिफंड`,
      paragraph_one: `आपके ePhone Infinity पर एक नया टैब दिखाई देता है: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">Refund</span> जो उसी स्क्रीन पर एक और TX टेम्प्लेट शुरू करता है, जिसमें <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">Multisig</span> आउटपुट से इस TX इनपुट की ओर एक तीर है।`,
      heading_two: `निर्देश`,
      refund_list_one: `आउटपुट राशि और आउटपुट स्क्रिप्ट भरें।`,
      refund_list_two: `<span className="rounded-sm px-1.5 py-1 h-[28px] bg-[#0000004D] m-0.5 text-base">Send to Laszlo</span> पर क्लिक करके इसे लास्ज़लो को भेजें ताकि वह हमें बता सके कि क्या वह इसे साइन करेगा।`,
      refund_list_three: `अभी इसे खुद साइन न करें! पहले देखते हैं लास्ज़लो क्या सोचता है।`,
      heading_three: `संकेत`,
      hint_one: `आउटपुट 0 आपके द्वारा <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap">SIG(YOU)</span> के साथ खर्च किया जाता है।`,
    },
    updating_the_state_two: {
      title: `भुगतान सुरक्षित करना`,
      nav_title: `भुगतान सुरक्षित करना`,
      paragraph_one: `—लास्ज़लो: "ठीक है, बढ़िया। मैं इस पर हस्ताक्षर करके तुम्हें वापस भेज दूँगा, और फिर तुम उस 2-of-2 मल्टीसिग के फंडिंग ट्रांजैक्शन पर हस्ताक्षर कर सकते हो।"`,
      paragraph_two: `अरे... एक मिनट रुको। अगर मैं इस पर हस्ताक्षर करता हूँ, तो हम वहीं पहुँच जाएँगे जहाँ से शुरू किया था: तुम मेरे लाइटनिंग लेमोनेड देने के बाद भी इस ट्रांजैक्शन को ब्रॉडकास्ट कर सकते हो, और मुझे मेरा पैसा नहीं मिलेगा।"`,
      paragraph_three: `इससे पहले कि मैं इस पर हस्ताक्षर करूँ, मुझे गारंटी चाहिए कि यह रिफंड ट्रांजैक्शन रद्द (revoked) किया जा सकता है।"`,
      paragraph_four: `एक बार जब तुम मुझे लाइटनिंग लेमोनेड के लिए वास्तव में भुगतान कर देते हो, तो तुम्हें इस रिफंड ट्रांजैक्शन को ब्रॉडकास्ट करने में सक्षम नहीं होना चाहिए। और अगर तुम इसे रद्द होने के बाद भी ब्रॉडकास्ट करने की कोशिश करते हो, तो मुझे <span className="italic">पूरे</span> 100,000 सतोशी रखने को मिलेंगे!"`,
    },
    updating_the_state_three: {
      title: `रद्द करना (The revocation)`,
      nav_title: `रद्द करना`,
      heading_one: `रद्द करना`,
      paragraph_one: `आप 100,000 सतोशी के आउटपुट को लास्ज़लो द्वारा 'रद्द करने योग्य' बना सकते हैं यदि आप इसमें एक अतिरिक्त शर्त जोड़ते हैं। लॉजिक ब्रांच लास्ज़लो को अपनी चाबी और आपके द्वारा बनाई गई एक नई प्राइवेट चाबी के साथ आउटपुट खर्च करने की अनुमति देनी चाहिए। ट्रांजैक्शन रद्द करने के लिए, आप लास्ज़लो को वह नई प्राइवेट चाबी दे देते हैं। यह एक असामान्य काम है, लेकिन यह 100,000 सतोशी को दांव पर लगा देता है और लास्ज़लो को फंड जब्त करने की अनुमति देता है यदि आप रद्द करने के बाद ट्रांजैक्शन ब्रॉडकास्ट करने की कोशिश करते हैं।`,
      paragraph_two: `आप एक नया की-पेयर बनाते हैं: एक प्राइवेट चाबी <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_1</span> और <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">PUBKEY(REVOCATION_YOU_1)</span>। आप हर बार इसी तरह एक नया की-पेयर बनाएंगे जब आप पेमेंट चैनल की स्थिति (state) को अपडेट करना चाहेंगे।`,
      heading_two: `निर्देश`,
      revocation_list_one: `स्क्रिप्ट में एक IF शर्त जोड़ें ताकि लास्ज़लो केवल तभी आउटपुट खर्च कर सके जब उसके पास 'रिवोकेशन की' (revocation key) भी हो (आप इस चाबी को रद्द करने का समय आने तक गुप्त रखेंगे!)।`,
      revocation_list_two: `<span className="rounded-sm px-1.5 py-1 h-[28px] bg-[#0000004D] m-0.5 text-base">Send to Laszlo</span> पर क्लिक करके इसे लास्ज़लो को भेजें ताकि वह साइन कर सके।`,
      revocation_list_three: `अभी खुद साइन न करें!`,
      heading_three: `संकेत`,
      paragraph_three: `आउटपुट 0 इनमें से किसी एक द्वारा खर्च किया जाता है:`,
      hint_one: `प्रारंभिक स्टैक यदि आप फंड का दावा करते हैं: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(YOU) 1 </span>`,
      hint_two: `प्रारंभिक स्टैक यदि लास्ज़लो फंड का दावा करता है: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> 0 SIG(REVOCATION_YOU_1) SIG(LASZLO) 0 </span>`,
    },
    updating_the_state_four: {
      title: `रद्द करने की होड़`,
      nav_title: `रद्द करने की होड़`,
      paragraph_one: `—लास्ज़लो: "खैर, यह बेहतर है, लेकिन मुझे अभी ख्याल आया कि अगर मेरे पास रिवोकेशन की है भी, तो भी इस आउटपुट को खर्च करने के लिए तुम्हारे और मेरे बीच एक रेस होगी।"`,
      paragraph_two: `मुझे एक अच्छी 'हेड स्टार्ट' (शुरुआती बढ़त) चाहिए ताकि मुझे यह नोटिस करने का मौका मिले कि तुमने मुझे धोखा दिया है। फिर मैं तुम्हारे पूरे रिफंड लेने से पहले रिवोकेशन की के साथ बिटकॉइन जब्त कर सकूँ।"`,
    },
    updating_the_state_five: {
      title: `टाइम लॉक (The time lock)`,
      nav_title: `टाइम लॉक`,
      heading_one: `टाइम लॉक`,
      time_lock_list_one: `आउटपुट खर्च करने से पहले 700 ब्लॉक की देरी जोड़ें।`,
      time_lock_list_two: `<span className="rounded-sm px-1.5 py-1 h-[28px] bg-[#0000004D] m-0.5 text-base">Send to Laszlo</span> पर क्लिक करके इसे लास्ज़लो को भेजें ताकि वह साइन कर सके।`,
      time_lock_list_three: `अभी खुद साइन न करें!`,
      heading_two: `संकेत`,
      paragraph_one: `आउटपुट 0 इनमें से किसी एक द्वारा खर्च किया जाता है:`,
      hint_one: `700 ब्लॉक के बाद आपके द्वारा प्रारंभिक स्टैक: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap">SIG(YOU) 1</span> `,
      hint_two: `लास्ज़लो द्वारा प्रारंभिक स्टैक: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap">0 SIG(REVOCATION_YOU_1) SIG(LASZLO) 0 </span> `,
    },
    updating_the_state_six: {
      title: `लास्ज़लो के साथ चैनल खुला`,
      nav_title: `लास्ज़लो के साथ चैनल खुला`,
      paragraph_one: `इस बार, जब आप लास्ज़लो को ट्रांजैक्शन देते हैं, तो वह मुस्कुराता है और तालियाँ बजाता है! वह रिफंड (चाइल्ड) ट्रांजैक्शन पर हस्ताक्षर करता है और अब आप पैरेंट ट्रांजैक्शन पर हस्ताक्षर करके उसे ब्रॉडकास्ट कर सकते हैं जो फंड को 2-of-2 मल्टीसिग में जमा करता है। पेमेंट चैनल अब खुल गया है!`,
    },
    making_a_payment_one: {
      title: `भुगतान करना`,
      nav_title: `भुगतान करना`,
      heading_one: `भुगतान करना`,
      paragraph_one: `आइए संक्षेप में दोहराएं:`,
      list_one: `आपने अपने और लास्ज़लो के बीच 2-of-2 मल्टीसिग आउटपुट में 100,000 सतोशी भेजे।`,
      list_two: `आपके पास ऑफलाइन एक रिफंड ट्रांजैक्शन है जो उस आउटपुट को खर्च करता है।`,
      list_three: `वह रिफंड ट्रांजैक्शन फंड खर्च करने के दो विकल्प देता है:`,
      list_three_sub_one: `700 ब्लॉक के बाद फीस काटकर आपको पूरे 99,000 सतोशी वापस मिलें, या`,
      list_three_sub_two: `यदि लास्ज़लो को आपसे <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_1</span> प्राइवेट चाबी मिल जाती है, तो उसे सारा पैसा मिले।`,
      list_four: `लास्ज़लो ने पहले ही इस रिफंड ट्रांजैक्शन पर हस्ताक्षर कर दिए हैं, और आप जब चाहें इसे ब्रॉडकास्ट करने के लिए हस्ताक्षर कर सकते हैं।`,
      list_five: `एक बार जब लास्ज़लो ने इस रिफंड (चाइल्ड) ट्रांजैक्शन पर हस्ताक्षर कर दिए, तो आप सुरक्षित रूप से पैरेंट ट्रांजैक्शन पर हस्ताक्षर करके उसे ब्रॉडकास्ट कर सकते थे।`,
      paragraph_two: `जिस ट्रांजैक्शन ने मल्टीसिग आउटपुट को फंड किया, उसे <span className="font-bold">फंडिंग ट्रांजैक्शन</span> (funding transaction) कहा जाता है। ब्लॉकचेन पर इसकी पुष्टि पेमेंट चैनल को <span className="font-bold">खोलती</span> (opens) है।`,
      paragraph_three: `ऑफलाइन रिफंड ट्रांजैक्शन जो फंडिंग ट्रांजैक्शन के आउटपुट को खर्च करता है, उसे <span className="font-bold">कमिटमेंट ट्रांजैक्शन</span> (commitment transaction) कहा जाता है। ब्लॉकचेन पर इसकी पुष्टि चैनल को <span className="font-bold">बंद</span> (close) कर देगी। पहला कमिटमेंट ट्रांजैक्शन आपका पूर्ण रिफंड है क्योंकि आपने अभी तक लास्ज़लो को कोई भुगतान नहीं किया है।`,
      paragraph_four: `जब तक चैनल खुला है, आप और लास्ज़लो नए कमिटमेंट ट्रांजैक्शन पर बातचीत करके और पुराने को रद्द करके एक-दूसरे को ऑफलाइन भुगतान कर सकते हैं। जैसे-जैसे आप अधिक ड्रिंक्स खरीदेंगे, आपकी "रिफंड" राशि कम होती जाएगी और मल्टीसिग में बंद मूल 100,000 सतोशी में लास्ज़लो का हिस्सा बढ़ता जाएगा।`,
    },
    making_a_payment_two: {
      title: `लाइटनिंग लेमोनेड खरीदें!`,
      nav_title: `लाइटनिंग लेमोनेड खरीदें!`,
      heading_one: `लाइटनिंग लेमोनेड खरीदें!`,
      paragraph_one: `अब आखिरकार लास्ज़लो को ऑफ-चेन बिटकॉइन भेजने का समय आ गया है। हम एक अपडेटेड कमिटमेंट ट्रांजैक्शन में उसके लिए 1,000 सतोशी का आउटपुट जोड़ेंगे। हमें पुराने कमिटमेंट ट्रांजैक्शन को कभी ब्रॉडकास्ट न करने का वादा भी करना होगा, जिसमें लास्ज़लो को कोई पैसा नहीं दिया गया था। इसकी गारंटी तब दी जाती है जब हम उसे पुराने कमिटमेंट ट्रांजैक्शन के लिए रिवोकेशन की भेजते हैं।`,
      paragraph_two: `आप इस नई स्थिति के लिए एक और रिवोकेशन की, <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_2</span> जनरेट करते हैं। यदि आप दूसरी ड्रिंक खरीदना चाहें, तो आप <span className="font-bold">इस</span> ट्रांजैक्शन को रद्द कर देंगे।`,
      heading_two: `निर्देश`,
      list_one: `अपने आउटपुट से 1,000 सतोशी घटाएं।`,
      list_two: `दूसरे आउटपुट में 1000 सतोशी जोड़ें और लास्ज़लो के लिए स्क्रिप्ट भरें।`,
      list_three: `साइन करने के लिए "Send to Laszlo" पर क्लिक करके इसे लास्ज़लो को भेजें।`,
      list_four: `अभी खुद साइन न करें!`,
      heading_three: `संकेत`,
      paragraph_three: `आउटपुट 0 इनमें से किसी एक द्वारा खर्च किया जाता है:`,
      hint_one: `'Refund' टैब को अब 'Initial Commitment' के रूप में जाना जाता है। आप इसका उपयोग पिछली स्थिति के लिए लिखी गई स्क्रिप्ट को देखने के लिए कर सकते हैं।`,
      hint_two: `700 ब्लॉक के बाद आप: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap">SIG(YOU) 1 </span>`,
      hint_three: `लास्ज़लो: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> 0 SIG(REVOCATION_YOU_2) SIG(LASZLO) 0 </span>`,
      paragraph_four: `आउटपुट 1 लास्ज़लो द्वारा खर्च किया जाता है: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(LASZLO) </span>`,
    },
    making_a_payment_three: {
      title: `लास्ज़लो की ब्लॉकचेन दुविधा`,
      nav_title: `लास्ज़लो की ब्लॉकचेन दुविधा`,
      paragraph_one: `लास्ज़लो एक सेकंड के लिए इस ट्रांजैक्शन को देखता है और बार के पीछे से एक गिलास उठाता है लेकिन लाइटनिंग लेमोनेड नहीं डालता।`,
      paragraph_two: `—लास्ज़लो: "रुको। अगर तुम इस ट्रांजैक्शन पर हस्ताक्षर नहीं करते, तो मेरे पास कुछ नहीं है। तुम यह लेमोनेड लेकर गायब हो सकते हो, और मैं चेन पर कुछ भी पुष्ट नहीं कर पाऊँगा। शायद तुम्हें पहले हस्ताक्षर करने चाहिए, फिर मुझे भेजना चाहिए ताकि हम दोनों के पास एक प्रति हो?"`,
    },
    making_a_payment_four: {
      title: `होलोकैट की चेतावनी`,
      nav_title: `होलोकैट की चेतावनी`,
      paragraph_one: `तभी होलोकैट मेज पर प्रकट होती है, अपने पिछले पैरों पर खड़ी होकर सामने के पंजे फैलाती है, और म्याऊ करती है।`,
      paragraph_two: `—होलोकैट: "रुको, तुम लास्ज़लो को इस ट्रांजैक्शन के लिए अपना सिग्नेचर नहीं दे सकते! अगली बार जब तुम भुगतान करोगे, तो तुम उसे रिवोकेशन की <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_2</span> दोगे। उसके पास वे सभी 100,000 सतोशी चुराने के लिए आवश्यक सब कुछ होगा!"`,
      paragraph_three: `चीजें थोड़ी उलझ रही हैं। लास्ज़लो को यह सुनिश्चित करने के लिए कुछ चाहिए कि उसे भुगतान मिलेगा। लेकिन उसके पास तुम्हारा ट्रांजैक्शन नहीं हो सकता क्योंकि तब उसके पास तुम्हारे सारे पैसे की पहुँच होगी! लास्ज़लो एक बेहतरीन इंसान है, लेकिन अच्छा होगा कि हमें उस पर भरोसा न करना पड़े।`,
    },
    making_a_payment_five: {
      title: `असिमिट्री (Asymmetry)`,
      nav_title: `असिमिट्री`,
      heading_one: `असिमिट्री`,
      paragraph_one: `हम चाहते हैं कि लास्ज़लो पहले ट्रांजैक्शन पर हस्ताक्षर करे लेकिन हम नहीं चाहते कि उसके पास उस पर हमारा सिग्नेचर हो। हमें उसके लिए एक दूसरा ट्रांजैक्शन बनाना होगा जिसमें हमारा सिग्नेचर <span className="font-bold">हो</span>, लेकिन उसके द्वारा गलत तरीके से पैसे खर्च करने की कोई संभावना न हो।`,
      paragraph_two: `यदि लास्ज़लो का अपना कमिटमेंट ट्रांजैक्शन होने वाला है, तो क्या हम यह भी नहीं चाहते कि वह ट्रांजैक्शन भी रद्द करने योग्य हो? हाँ! वास्तव में, लास्ज़लो का कमिटमेंट ट्रांजैक्शन आपके ट्रांजैक्शन का एक मिरर-इमेज (दर्पण छवि) होगा। रिवोकेबल टाइम लॉक स्क्रिप्ट लास्ज़लो की पहली रिवोकेशन की <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">PUBKEY(REVOCATION_LASZLO_1)</span> का उपयोग करेगी और बड़ी रिफंड राशि सीधे आपको मिल जाएगी।`,
      heading_two: `निर्देश`,
      list_one: `लास्ज़लो के कमिटमेंट ट्रांजैक्शन के लिए राशि और आउटपुट स्क्रिप्ट भरें।`,
      list_two: `इसे साइन करके लास्ज़लो को भेजें, जो फिर आपके कमिटमेंट ट्रांजैक्शन पर साइन करके आपको वापस भेज देगा।`,
      heading_three: `संकेत`,
      hint_one: `अपने कमिटमेंट ट्रांजैक्शन के लिए लिखी गई स्क्रिप्ट देखने के लिए आप 'Commitment_you' टैब पर स्विच कर सकते हैं।`,
      paragraph_three: `आउटपुट 0 इनमें से किसी एक द्वारा खर्च किया जाता है:`,
      hint_two: `700 ब्लॉक के बाद लास्ज़लो: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap">SIG(LASZLO) 1 </span>`,
      hint_three: `आप: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> 0 SIG(REVOCATION_LASZLO_1) SIG(YOU) 0 </span>`,
      paragraph_four: `आउटपुट 1 आपके द्वारा खर्च किया जाता है: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(YOU) </span>`,
    },
    making_a_payment_six: {
      title: `भुगतान पूरा करें`,
      nav_title: `भुगतान पूरा करें`,
      heading_one: `भुगतान पूरा करें`,
      paragraph_one: `आइए एक और बार दोहराएं।`,
      list_one: `एक 2-of-2 आउटपुट ब्लॉकचेन पर पुष्ट हो गया है।`,
      paragraph_two: `कई ऑफ-चेन ट्रांजैक्शन हैं जो 2-of-2 मल्टीसिग में बंद 100,000 सतोशी (सैट) आउटपुट को खर्च करते हैं:`,
      paragraph_three: `आपके पास अंत में ये ट्रांजैक्शन होंगे:`,
      paragraph_four: `कमिटमेंट 1 (आपका)`,
      commitment_one_you: {
        list_one: `<span className="font-semibold">Inout 0:</span> लास्ज़लो द्वारा हस्ताक्षरित`,
        list_two: `<span className="font-semibold">Output 0:</span> 700 ब्लॉक के बाद आपको 99,000 सैट या <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_1</span> के साथ लास्ज़लो को`,
        list_three: `<span className="font-semibold">माइनर फीस:</span> 1,000 सैट`,
      },
      commitment_two_you: {
        list_one: `<span className="font-semibold">Input 0:</span> लास्ज़लो द्वारा हस्ताक्षरित`,
        list_two: `<span className="font-semibold">Output 0:</span> 700 ब्लॉक के बाद आपको 98,000 सैट या <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_2</span> के साथ लास्ज़लो को`,
        list_three: `<span className="font-semibold">Output 1:</span> लास्ज़लो को 1,000 सैट`,
        list_four: `<span className="font-semibold">माइनर फीस:</span> 1,000 सैट`,
      },
      paragraph_five: `कमिटमेंट 2 (आपका)`,
      paragraph_six: `लास्ज़लो के पास अंत में यह ट्रांजैक्शन होगा:`,
      paragraph_seven: `कमिटमेंट 2 (लास्ज़लो का)`,
      commitment_two_laszlo: {
        list_one: `<span className="font-semibold">Input 0:</span> आपके द्वारा हस्ताक्षरित`,
        list_two: `<span className="font-semibold">Output 0:</span> 700 ब्लॉक के बाद लास्ज़लो को 1,000 सैट या <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_LASZLO_1</span> के साथ आपको`,
        list_three: `<span className="font-semibold">Output 1:</span> आपको 98,000 सैट`,
        list_four: `<span className="font-semibold">माइनर फीस:</span> 1,000 सैट`,
      },
      paragraph_eight: `ये तीनों ट्रांजैक्शन हस्ताक्षरित और वैध हैं, लेकिन लास्ज़लो ने अभी तक आपको लाइटनिंग लेमोनेड नहीं दिया है। क्यों? बस एक काम बचा है, लास्ज़लो को अपनी पिछली रिवोकेशन की, <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base">REVOCATION_YOU_1</span> भेजें!`,
      success_bar: `लास्ज़लो को REVOCATION_YOU_1 भेजें`,
    },
    making_a_payment_seven: {
      title: `🍋🍹 आह, बढ़िया।`,
      nav_title: `आह, बढ़िया।`,
      paragraph_one: `🍋🍹 आह, बढ़िया।`,
    },
    making_a_payment_eight: {
      title: `एक और भुगतान करें`,
      nav_title: `एक और भुगतान करें`,
      heading_one: `एक और भुगतान करें`,
      paragraph_one: `रात अभी जवान है। क्या एक और लाइटनिंग लेमोनेड के लिए समय है? अब जबकि आपके और लास्ज़लो के पास असिमिट्रिक ट्रांजैक्शन और रिवोकेशन की के साथ एक फ्लो तैयार है, आइए प्रोटोकॉल को फिर से चलाएं।`,
      paragraph_two: `वर्तमान स्थिति का प्रतिनिधित्व करने वाले दो कमिटमेंट ट्रांजैक्शन आपकी स्क्रीन पर हैं।`,
      heading_two: `निर्देश`,
      list_one: `लास्ज़लो के नए कमिटमेंट ट्रांजैक्शन के लिए राशि और आउटपुट स्क्रिप्ट अपडेट करें।`,
      list_two: `लास्ज़लो के ट्रांजैक्शन पर हस्ताक्षर करें और उसे भेजें।`,
      list_three: `अपना कमिटमेंट ट्रांजैक्शन अपडेट करें: लास्ज़लो आपको <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap">REVOCATION_LASZLO_1</span> भेजकर अपनी पिछली स्थिति रद्द कर देगा। अपने ट्रांजैक्शन में राशि और स्क्रिप्ट अपडेट करें।`,
      list_four: `अपना ट्रांजैक्शन लास्ज़लो को भेजें ताकि वह साइन कर सके।`,
      list_five: `लास्ज़लो के हस्ताक्षर मिलने के बाद, उसे अपनी पिछली रिवोकेशन की, <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base"> REVOCATION_YOU_2 </span> भेजें।`,
      paragraph_three: `मजे करें 🍋🍹`,
      heading_three: `संकेत`,
      paragraph_four: `माइनर फीस के लिए 1,000 सैट अलग रखना न भूलें।`,
      paragraph_five: `आउटपुट 0 इनमें से किसी एक द्वारा खर्च किया जाता है:`,
      step_one: {
        hint_one: `लास्ज़लो, 700 ब्लॉक के बाद: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(LASZLO) 1 </span>`,
        hint_two: `आप: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> 0 SIG(REVOCATION_LASZLO_2) SIG(YOU) 0 </span> `,
        hint_three: `आउटपुट 1 आपके द्वारा खर्च किया जाता है: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(YOU) </span> `,
      },
      step_two: {
        hint_one: `आप, 700 ब्लॉक के बाद: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(YOU) 1 </span>`,
        hint_two: `लास्ज़लो: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> 0 SIG(REVOCATION_YOU_3) SIG(LASZLO) 0 </span> `,
        hint_three: `आउटपुट 1 लास्ज़लो द्वारा खर्च किया जाता है: <span className="rounded-sm px-1.5 py-1 h-[28px] font-mono bg-[#0000004D] m-0.5 text-base whitespace-nowrap"> SIG(LASZLO) </span> `,
      },
    },

    outro_one: {
      title: `उपसंहार`,
      nav_title: `रात भर जारी`,
      paragraph_one: `आप यह पूरी रात कर सकते हैं! खैर, जब तक आपके 100,000 सतोशी लास्ज़लो को नहीं भेज दिए जाते।`,
      paragraph_two: `पानी पीना न भूलें! उनके पास होलोडॉग और नाचोस भी हैं।`,
    },

    outro_two: {
      title: `उपसंहार`,
      nav_title: `घर की ओर`,
      paragraph_one: `एक लंबे और अजीब दिन के बाद, आप अपनी ड्रिंक्स का भुगतान करते हैं और घर की ओर चल देते हैं। लेकिन जैसे ही आप अपने 3D प्रिंटेड बंगले का दरवाज़ा खोलते हैं—ओह, नहीं! यह फिर से वेंडरपूल है! क्या यह सच में हो रहा है या आपने ज़रूरत से ज़्यादा 'मेमपूल मार्गरीटा' पी ली है? हालाँकि उसके साथ हर तरफ होलोकैट्स का एक छोटा दस्ता है, लेकिन वह लड़ाई के मूड में नहीं लग रहा है।`,
      paragraph_two: `—वेंडरपूल: "हम एक-दूसरे को वास्तव में नहीं जानते, भले ही, जैसा कि मेरे दादाजी कहते थे, अजनबियों की नियति अक्सर आपस में जुड़ी होती है। मुझे ज़रूरत है कि तुम मेरी बात सुनो। सातोशी नाकामोतो वाली सारी चीज़ें मेरे परिवार के व्यवसाय को बचाने की एक कोशिश थी। तुम सोच नहीं सकते कि माइनिंग हमारे लिए कितनी मायने रखती थी। मुझे लगता है कि मैं बदलाव के लिए तैयार नहीं था।"`,
    },

    outro_three: {
      title: `उपसंहार`,
      nav_title: `बिटकॉइन समुदाय`,
      paragraph_one: `आप पूछते हैं कि सातोशी नाकामोतो नाम उसके लिए इतना महत्वपूर्ण क्यों था।`,
      paragraph_two: `—वेंडरपूल: "बिटकॉइन में बिट्रे (Bitrey) और वेंडरपूल से बड़ा केवल यही एक नाम है। सातोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति ने मुझसे एक बार कहा था कि बिटकॉइन एक सदी पहले ही अपने निर्माता के नियंत्रण से बहुत आगे निकल गया था। इसीलिए, वेंडरपूल नाम को बचाने के लिए, मैंने एक अधिक प्रमुख नाम पर दावा करने की कोशिश की। नए सिक्के ढालने के रोमांच को तुम नहीं समझ सकते। यह तब मेरे लिए जादू था; यह आज भी मेरे लिए जादू है।"`,
      paragraph_three: `—वेंडरपूल: "मुझे अब एहसास हो गया है कि भले ही मैं सातोशी का परपोता होता, बिटकॉइन नेताओं द्वारा परिभाषित नहीं होता। यह अपने समुदाय द्वारा परिभाषित होता है। सातोशी भी बिटकॉइन को वैसा नहीं बदल सकते जैसा वह बन चुका है। यही बात हमेशा से बिटकॉइन को महान बनाती रही है।"`,
    },

    outro_four: {
      title: `उपसंहार`,
      nav_title: `वेंडरपूल की खलनायकी`,
      paragraph_one: `वेंडरपूल आपकी होलोकैट को उठाता है, और वह पुर्राने (pur) लगती है। लोग जटिल होते हैं, और बिल्लियों से बेहतर यह कोई नहीं जानता।`,
      paragraph_two: `—होलोकैट: "आप खलनायक नहीं हैं, मिस्टर वेंडरपूल। लेकिन हो सकता है कि आपने ज़रूरत से ज़्यादा परवाह की हो।"`,
      paragraph_three: `—वेंडरपूल: क्या यह सच नहीं है।`,
    },

    outro_five: {
      title: `उपसंहार`,
      nav_title: `आपने कर दिखाया!!!`,
      heading_one: `आपने कर दिखाया!!!`,
      paragraph_one: `सातोशी की तरह, आप भी कोई नहीं थे, लेकिन आपके विचारों में दम था, इसलिए लोगों ने आपका अनुसरण किया। सातोशी चले गए हैं, लेकिन उनकी भावना और विचार जीवित हैं। अपने नए बिटकॉइन देव कोडिंग कौशल और दृढ़ता के साथ, आप इस शानदार प्रणाली पर एक स्थायी छाप छोड़ सकते हैं जिसने 100 से अधिक वर्षों से दुनिया को अनुमति-रहित, सेंसरशिप-प्रतिरोधी पैसे के तहत एकजुट किया है। नए रोमांच कोड और विचारों के खुले बाजार में आपका इंतज़ार कर रहे हैं। बिटकॉइन केवल इसलिए जीवित रहता है क्योंकि आप जैसे लोग इसमें योगदान देते हैं। इसीलिए हम सब सातोशी हैं।`,
    },

    outro_six: {
      title: `सेविंग सातोशी के आगे`,
      nav_title: `सेविंग सातोशी के आगे बढ़ना`,
      heading: `बिटकॉइन को अभी भी आपकी मदद की ज़रूरत है...`,
      paragraph_one: `भले ही 2139 दूर लग सकता है, बिटकॉइन का मिशन कालातीत है: ऐसा पैसा बनाना जो निष्पक्ष, खुला और ईमानदार हो। हालाँकि, इस दृष्टि को प्राप्त करने के लिए सभी के प्रयासों की आवश्यकता होगी—आपकी भी।`,
      paragraph_two: `आपके कारनामों ने बिटकॉइन के मौलिक सिद्धांतों की रक्षा करने की आपकी इच्छा को प्रदर्शित किया है, लेकिन यह एक लंबी यात्रा की शुरुआत मात्र है। अब अपने ज्ञान को सार्थक योगदान के माध्यम से कार्य में बदलने का सही समय है।`,
      boss_instructions: `यदि आपको <Link className="underline" href="https://learning.chaincode.com">₿OSS चैलेंज</Link> द्वारा सेविंग सातोशी तक लाया गया था, तो यहाँ आपका अगला सुराग है। उसी प्राइवेट चाबी का उपयोग करते हुए जिससे आप गेम खेल रहे हैं, इस हेक्स-एनकोडेड गुप्त संदेश पर एक XOR ऑपरेशन करें। यदि आपका परिणाम बकवास दिखता है, तो अपने काम की दोबारा जांच करें - सही उत्तर एक दरवाजा खोल देगा।`,
      boss_instructions_two: `<span className="italic">संकेत: आपकी प्राइवेट चाबी भी हेक्स फॉर्मेट में है</span>`,
      paragraph_three: `और अधिक के लिए तैयार हैं? <Link className="underline" href="https://bitcoindevs.xyz/">बिटकॉइन देव प्रोजेक्ट</Link> यहाँ भविष्य की पीढ़ियों का मार्गदर्शन करने के लिए है। आज का बिटकॉइन हीरो बनना बस एक क्लिक दूर है।`,
      paragraph_four: `हम सब सातोशी हैं।`,
    },
    tab_data: {
      signed: `हस्ताक्षरित`,
      pending: `लंबित`,
      deposit: `यह आपके वॉलेट में 101,000 सैट का आउटपुट है जिसे आप लास्ज़लो के साथ ऑफ-चेन भुगतान के लिए उपयोग करने जा रहे हैं।`,
      payment: `यह लास्ज़लो को आपका ऑफ-चेन भुगतान है।`,
      multisig: `यह ट्रांजैक्शन आपके और लास्ज़लो के बीच एक मल्टीसिग आउटपुट को फंड करेगा।`,
      refund_0: `यह ट्रांजैक्शन सुनिश्चित करता है कि यदि लास्ज़लो गायब हो जाए तो फंड खो न जाए।`,
      refund_1: `यह ट्रांजैक्शन सुनिश्चित करता है कि लास्ज़लो गायब होने पर फंड सुरक्षित रहे। यह लास्ज़लो को यह भी सुनिश्चित करता है कि आप लेमोनेड के भुगतान के बाद इसे ब्रॉडकास्ट नहीं करेंगे।`,
      refund_2: `यह ट्रांजैक्शन सुनिश्चित करता है कि फंड खो न जाए। यह आपको भुगतान के तुरंत बाद फंड का दावा करने से भी रोकता है। 700 ब्लॉक की देरी लास्ज़लो को यह नोटिस करने का समय देती है कि आपने उसे धोखा देने की कोशिश की है।`,
      commitment_you: `यह इस पेमेंट चैनल के लिए दूसरा कमिटमेंट ट्रांजैक्शन है, जो लास्ज़लो को 1,000 सैट का भुगतान करता है।`,
      commitment_laszlo: `यह कमिटमेंट ट्रांजैक्शन का लास्ज़लो वाला वर्जन है।`,
    },
    resources: {
      output_zero_sig: `आउटपुट 0 सिग्नेचर`,
      output_one_sig: `आउटपुट 1 सिग्नेचर`,
      sats_distribution: `लास्ज़लो को लाइटनिंग लेमोनेड के लिए पर्याप्त सैट मिलने चाहिए, और वह 1,000 सैट माइनर फीस के लिए जिम्मेदार नहीं है। फीस आपके चेंज से आती है।`,
      output_script: `आउटपुट पर लॉकिंग स्क्रिप्ट में कोई सिग्नेचर नहीं होना चाहिए (जैसे कि <span className="rounded-sm px-1.5 py-1 font-mono bg-[#0000004D] m-1 text-base whitespace-nowrap">OP_PUSH SIG()</span>)। यदि यह आपकी स्क्रिप्ट का हिस्सा है, तो बस इसे हटा दें।`,
      miner_fees_basic: `माइनर फीस के लिए 1,000 सैट अलग रखना न भूलें।`,
      miner_fees: `माइनर फीस के लिए अपने चेंज से 1,000 सैट अलग रखना न भूलें।`,
    },
  },
  challenge_list: {
    coming_soon: 'जल्द आ रहा है। बने रहें।',
  },
  chapter: {
    chapter_locked_one: 'अध्याय पूरा करें',
    chapter_locked_two: 'खोलने के लिए।',
    coming_soon: 'जल्द आ रहा है। बने रहें।',
    description:
      'सातोशी के रहस्यों को जानें और साथ ही बिटकॉइन के बारे में सीखें।',
  },
  hero: {
    title: 'सेविंग सातोशी',
    description: 'बिटकॉइन के रहस्यों के बीच अपना कोडिंग सफर शुरू करें।',
    start_journey: 'शुरू करें',
    tell_more: 'मुझे और बताएँ',
  },
  footer: {
    paragraph_one: 'बिटकॉइन समुदाय द्वारा एक ओपन-सोर्स प्रस्तुति।',
    link: 'कोड देखें',
  },
  navbar: {
    intro: 'परिचय',
    outro: 'उपसंहार',
    chapter: 'अध्याय',
    chapter_complete: 'अध्याय पूर्ण',
    challenge: 'चुनौती',
    help_tooltip: 'मदद चाहिए?',
    your_language: 'आपकी भाषा',
  },
  modal_signin: {
    heading: 'साइन इन करें',
    pre_signin_paragraph_one:
      'अपना अकाउंट और प्रगति बहाल करने के लिए नीचे अपनी प्राइवेट की (private key) दर्ज करें।',
    post_signin_paragraph_one:
      'सातोशी को बचाने के लिए आपकी वापसी देखकर खुशी हुई! आप यहाँ से सीधे अपने पिछले पाठ पर जा सकते हैं।',
    prompt: 'अपनी प्राइवेट की दर्ज करें',
    confirm: 'साइन इन करें',
    create_account: 'अकाउंट नहीं है?',
    login: 'लॉग इन करें',
    welcome_back: 'वापसी पर स्वागत है!',
    progress_redirect: 'मुझे वहाँ ले चलें जहाँ मैंने छोड़ा था',
  },
  modal_logout: {
    heading: 'आप लॉग इन हैं',
    paragraph_one:
      'आपका सत्र तब तक सक्रिय रहेगा जब तक आप नीचे दिए गए बटन का उपयोग करके साइन आउट नहीं करते।',
    private_key: 'आपकी प्राइवेट की',
    signout: 'साइन आउट',
  },
  modal_signup: {
    heading: 'अपनी प्रगति सहेजें',
    paragraph_one:
      'किसी भी डिवाइस और ब्राउज़र पर अपनी प्रगति को सहेजने और लोड करने के लिए एक सरल कोड कॉपी करें और सुरक्षित रखें। यदि आपके पास पहले से कोड है, तो अपनी प्रगति यहाँ लोड करें।',
    subheading_one: 'एक अवतार चुनें',
    subheading_two: 'अपनी प्राइवेट की का बैकअप लें',
    generate:
      'सब तैयार? कोड कॉपी और बैकअप कर लिया? सुनिश्चित करें कि आपने ऐसा किया है, क्योंकि खो जाने पर इसे बहाल नहीं किया जा सकता।',
    confirm: 'हो गया',
    acknowledged:
      'मैं स्वीकार करता हूँ कि मैंने यह प्राइवेट की सहेज ली है और जानता हूँ कि भविष्य की चुनौतियों के लिए मुझे इसकी आवश्यकता होगी।',
  },
  difficulty_selection: {
    NORMAL: 'चुनौतियों की कठिनाई बढ़ाने के लिए हार्ड मोड चालू करें।',
    HARD: 'चुनौतियों की कठिनाई कम करने के लिए हार्ड मोड बंद करें।',
  },
  social: {
    twitter_share: 'X के माध्यम से साझा करें',
    nostr_share: 'Nostr के माध्यम से साझा करें',
    sharing: 'साझा किया जा रहा है...',
    shared: 'साझा किया गया!',
    share_error: 'साझा करने में विफल',
  },
  disclaimer: {
    description:
      'हम आपके जुड़ने से उत्साहित हैं। ध्यान दें कि कुछ चुनौतियों के लिए बुनियादी प्रोग्रामिंग अनुभव की आवश्यकता होती है (संकेत उपलब्ध हैं)। इसे आजमाएँ और अपनी <Link href="https://docs.google.com/forms/d/e/1FAIpQLSf1xpNqUYJyvYL5IZDnxy78273pkqzfYW2Hf91H4Do4KHgy9g/viewform?usp=sf_link" className="underline">प्रतिक्रिया</Link> दें।',
  },
  opcode: {
    run: 'स्क्रिप्ट चलाएँ',
    reset: 'रीसेट करें',
  },
  hasher: {
    placeholder: 'यहाँ टाइप करें...',
    return_hash: 'नीचे आप अपने इनपुट को हैश में बदलते हुए देखेंगे',
  },
  hashrate: {
    start: 'शुरू करें',
    running: 'चल रहा है',
    blocks_found: 'ब्लॉक मिले',
    hashrate: 'हैशरेट',
    partial_solutions: 'आंशिक समाधान',
  },
  runner: {
    run: 'स्क्रिप्ट चलाएँ',
    running: 'चल रहा है',
    pause: 'रोकें',
    result: 'परिणाम',
    computing: 'गणना की जा रही है...',
    evaluation: 'मूल्यांकन',
    script_output: 'स्क्रिप्ट आउटपुट',
    waiting: 'ऊपर आपके इनपुट की प्रतीक्षा है...',
    poor: 'यह वैध कोड है लेकिन वह नहीं जो हमें चाहिए। दोबारा कोशिश करें।',
    good: 'अच्छा काम, यह बिल्कुल सही नहीं है लेकिन फिर भी सही माना गया है। काम जारी रखें या आगे बढ़ें, आपकी मर्जी।',
    success: 'शानदार काम, आपका कोड बहुत अच्छा लग रहा है!',
    language_tabs: {
      locked: 'भाषा अक्षम है क्योंकि आपने यह अध्याय इसमें शुरू किया था:',
      reset: 'टर्मिनल रीसेट करें',
    },
  },
  notfound: {
    first: 'हम्म... हम कहाँ हैं?',
    second: 'यह स्पष्ट नहीं है कि यह जगह क्या है।',
    third: 'हो सकता है कि हम अंतरिक्ष (या समय) में खो गए हों।',
    back_safety: 'वापस सुरक्षित स्थान पर',
  },
  error: {
    first: 'कुछ गलत है!',
    second: 'होलोकैट ने शायद फिर से कुछ केबल चबा लिए हैं। बुरी बिल्ली!',
    reload: 'पुनः प्रयास करें',
  },
  help_page: {
    main_heading: `सीखने के संसाधन`,
    main_subheading: `आगे सीखने के लिए हम कौन सी सहायक जानकारी और संसाधन प्रदान कर सकते हैं?`,
    tips_heading: `संकेत (Tips)`,
    tips_subheading: `यदि शिक्षार्थी अटक जाते हैं तो हम उन्हें क्या विशेष सुझाव देना चाहते हैं?`,
    spoilers_heading: `समाधान (Spoilers)`,
    spoilers_confirm: `हाँ, मैं समाधान देखना चाहता हूँ`,
    pseudo_confirm: `हाँ, मैं स्यूडोकोड (pseudocode) देखना चाहता हूँ`,
    solution: `इस चुनौती का समाधान`,
    pseudo_solution: `इस चुनौती का स्यूडोकोड समाधान`,
    solution_one: `इस चुनौती के पहले भाग का समाधान`,
    feedback: `आपकी प्रतिक्रिया मूल्यवान है और हमें अपने काम को बेहतर बनाने में मदद करती है, कृपया <a href="https://docs.google.com/forms/d/e/1FAIpQLSf1xpNqUYJyvYL5IZDnxy78273pkqzfYW2Hf91H4Do4KHgy9g/viewform" target="_blank" rel="noreferrer">इस लिंक</a> का उपयोग करके हमें फीडबैक दें।`,
    help_suggestion: `यदि आप कभी अटक जाते हैं, तो ऊपर दाएं कोने में "?" बटन दबाएं। यह सहायक संसाधन और सुझाव प्रदान करता है।`,
  },
}

export default translations
