const translations = {
  shared: {
    next: 'जारी रखे',
    start: 'करे',
    copy: 'प्रतिलिपि',
    about: 'अबाउट',
    chapter: 'अध्याय',
    chapters: 'अध्याय',
    challenge: 'चुनौती',
    coming_soon: 'जल्द आ रहा है',
    start_chapter: 'अध्याय प्रारंभ करें',
    back: 'जाए',
  },
  status_bar: {
    begin_message: 'जारी रखने के लिए ऊपर दी गई चुनौती को पूरा करें...',
    error_message: 'हम्म... यह अभी पूरी तरह ठीक नहीं है...',
    in_progress_message: 'अब तक अच्छा लग रहा है ...',
    success_message: 'अच्छी तरह से किया!',
    next: 'अगला',
  },
  ///ABOUT PAGE
  about: {
    title: 'अबाउट',
    mobile_title: 'यह किसके बारे में है',
    subtitle:
      'वर्ष 2139 है। अंतिम बिटकॉइन खनन होने से दो सप्ताह बाद है। सतोशी स्क्वायर में महीनों से एक घड़ी टिक-टिक कर रही है।',
    intro:
      'दुनिया आखिरी ब्लॉक का इंतजार कर रही है। फिर, अचानक, नेटवर्क ठप हो जाता है।<br><br>आपको सतोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति से एक होलोकैट प्राप्त होता है। (यह किसी भी अन्य ई-होलोग्राम की तरह है, लेकिन यह एक बिल्ली के आकार का है)। आप इसकी नाक को उछाल कर प्रलय खोलते हैं, यह सुनने के लिए उत्सुक हैं कि इसे क्या कहना है ...',
    project: {
      title: 'मजे से बनाया है',
      paragraph_one:
        'सातोशी को सहेजना डेवलपर्स के लिए संपर्क का एक हल्का-फुल्का पहला बिंदु है जो बिटकॉइन के विकास के बारे में उत्सुक हैं। सेविंग सातोशी में तकनीकी पाठ और कोड-आधारित चुनौतियों का मिश्रण है, लेकिन बुनियादी कोडिंग कौशल वाले किसी भी व्यक्ति के लिए चुनौतियाँ साध्य होनी चाहिए। यह परियोजना स्वतंत्र और खुला स्रोत है और सभी कलाओं को मिडजर्नी जैसे टेक्स्ट-टू-इमेज (उर्फ एआई) टूल का उपयोग करके उत्पन्न किया गया है।',
      paragraph_two:
        'परियोजना का यह संस्करण वर्तमान में समग्र अनुभव पर प्रतिक्रिया प्राप्त करने और शुरुआती उपयोगकर्ताओं के लिए अवधारणा का प्रमाण प्रदान करने के लक्ष्य के साथ एक डेमो स्थिति में है। इसके आलोक में, उपयोगकर्ता की प्रगति ब्राउज़र में स्थानीय रूप से संग्रहीत की जाती है और छवियों के साथ कहानी को अंतिम रूप नहीं दिया जाता है।',
      paragraph_three:
        'हमें प्राप्त फीडबैक के आधार पर, हम फिर एक आधिकारिक रिलीज़ (हम इसे V1 कहते हैं) की दिशा में काम करेंगे जिसमें 2-3 पूर्ण पाठ अध्याय, खाते और बहुत कुछ शामिल हैं। 10 अध्यायों की योजना बनाई गई है और समय के साथ उन्हें पूरा कर लिया जाएगा। अतिरिक्त सुविधाओं में सहयोगी शिक्षा, बैज, अतिरिक्त-चुनौतीपूर्ण पक्ष खोज, और बहुत कुछ शामिल हो सकते हैं।',
    },
    contributing: {
      title: 'योगदान कैसे करें',
      paragraph_one:
        'हम एक ओपन-सोर्स प्रोजेक्ट हैं, इसलिए इसे आकार देने में आपकी मदद के लिए सभी दरवाजे खुले हैं।',
      feedback: {
        title: 'प्रतिक्रिया',
        paragraph_one:
          'योगदान करने का वास्तव में एक बढ़िया तरीका है अध्याय 1 को पढ़ना और हमें इस फ़ॉर्म का उपयोग करने के आपके समग्र अनुभव पर कोई फ़ीडबैक देना।',
      },
      contribute: {
        title: 'योगदान देना',
        paragraph_one:
          'सभी सुझावों का स्वागत है, सामग्री परिवर्तन, खेल यांत्रिकी सहित - वास्तव में कुछ भी। हम हमेशा समीक्षा और <a href="https://leaf-singer-0fc.notion.site/How-to-QA-5177e63f65a4406da01bc57d886b5ac2" target="_blank" rel="noreferrer">क्यूए-इंग कोड परिवर्तन</a>। कोड सुधार के लिए, आप सीधे किसी समस्या को खोल सकते हैं या GitHub पर पुल अनुरोध सबमिट कर सकते हैं।',
        paragraph_two:
          'यदि आप डिज़ाइन, कहानी, या किसी अन्य चीज़ में शामिल होना चाहते हैं, तो <a href="https://bitcoin.design/contribute/" target="_blank" rel="noreferrer">Bitcoin Design slack</a> में #Saving-satoshi चैनल में हमसे जुड़ें। उल्लेख करें कि आप कैसे योगदान देना चाहते हैं और हम आपको सही दिशा में इंगित करने में मदद करेंगे।',
      },
    },
    contributors: {
      title: 'आनंद लीजिये!',
      contributions_by: 'द्वारा योगदान',
      many_more:
        'और <a href="https://github.com/Saving-satoshi/Saving-satoshi/graphs/contributors" target="_blank" rel="noreferrer">और भी बहुत से लोगो द्वारा</a>।',
    },
    satoshi_needs_you: 'अब जल्दी करो, सातोशी को तुम्हारी जरूरत है।',
  },

  ///CHAPTERS TITLE PAGE
  chapter_one: {
    title: 'स्पष्ट दृष्टि में राज़ ',
    paragraph_one:
      'वर्ष 2139 है। अंतिम बिटकॉइन खनन होने से दो सप्ताह बाद है। सतोशी स्क्वायर में महीनों से एक घड़ी टिक-टिक कर रही है। दुनिया आखिरी ब्लॉक का इंतजार कर रही है। तभी अचानक नेटवर्क ठप हो गया।',
    intro_one: {
      title: 'उत्पत्ति',
      paragraph_one: 'क्षण भर बाद, आपकी होवर स्क्रीन सक्रिय हो जाती है।',
      paragraph_two:
        '-Deborah Chunk: "Thomas Vanderpoole। BitRey के CEO के रूप में, आप दुनिया के सबसे बड़े बिटकॉइन माइनिंग पूल में से एक चलाते हैं। आप बिटकॉइन माइनिंग मशीन भी बनाते हैं। क्या हो रहा हिया? क्या बिटकॉइन मर रहा है?"',
      paragraph_three:
        '-Vanderpoole: "हाँ, मैं करता हूँ, Deborah। उससे पहले मेरे डैडी और उनके डैडी की तरह। Vanderpoole 21,000 ब्लॉक के बाद से खनन कर रहे हैं। इसलिए मैं विश्वास के साथ कह सकता हूं कि दुनिया भर के खनिक अपनी मशीनों को बंद करके इस देरी का कारण बन रहे हैं। यह एक विरोध है। कोई नहीं चाहता कि बिटकॉइन 21 मिलियन पर जारी होना बंद हो। हम केवल फीस पर जीवित नहीं रह सकते हैं।',
      start: 'जारी रखना',
    },
    intro_two: {
      title: 'उत्पत्ति',
      paragraph_one:
        'सतोशी नाकामोतो नाम का उपयोग करने वाले किसी व्यक्ति से आपको एक होलोकैट प्राप्त होता है। (यह किसी भी अन्य ई-होलोग्राम की तरह है, लेकिन यह एक बिल्ली के आकार का है।) आप इसकी नाक को उछाल कर होलोकेट को खोलते हैं।',
      paragraph_two:
        '—“बिटकॉइन मर नहीं रहा है, लेकिन इसे आपकी मदद की जरूरत है। बिल्ली को मत भूलना। – सातोशी नाकामोतो',
      paragraph_three:
        '—सातोशी? सातोशी? नहीं, यह नहीं हो सकता। उन्हें एक सदी से अधिक समय से मृत मान लिया गया है। क्या वे नहीं हैं?',
      paragraph_four: 'क्या वे नहीं हैं?',
      paragraph_five:
        'होलोकैट: "बेहतर होगा कि आप काम पर लग जाएं। मैं मदद कर सकता हूं, लेकिन आपको म्याऊ शुरू करना होगा।',
    },
    genesis_one: {
      title: 'उत्पत्ति',
      heading: 'आपकी पहली चुनौती',
      paragraph_one:
        'बिटकॉइन सेंसरशिप प्रतिरोधी पैसा है। कोई भी व्यक्ति नेटवर्क पर लेन-देन प्रसारित करके पैसा भेज सकता है। प्रसारण के बाद, खनिकों द्वारा लेन-देन को ब्लॉक में पैक किया जाता है। श्रृंखला पर निर्माण के विशेषाधिकार के लिए खनिक अन्य खनिकों के खिलाफ प्रतिस्पर्धा करते हैं। यही बिटकॉइन को विकेंद्रीकृत रखता है।',
      paragraph_two:
        'बिटकॉइन के छद्म नाम के आविष्कारक सतोशी नाकामोटो ने भी पहले बिटकॉइन ब्लॉक का खनन किया। उसने दुनिया को पहले बिटकॉइन लेनदेन में एक गुप्त संदेश छोड़ा था जो कभी भी किया गया था। आपकी पहली चुनौती इसे ढूंढना और डिकोड करना है।',
    },
    genesis_two: {
      title: 'उत्पत्ति',
      heading: 'छिपे हुए संदेश को खोजें',
      paragraph_one:
        'आइए बिटकॉइन ब्लॉकचेन में सबसे पहले ब्लॉक को खोजें। नीचे दिए गए बटन पर क्लिक करके एक <Tooltip id="genesis_two_paragraph_one" content="genesis_two.tooltip_block_explorer" className="underline">ब्लॉक एक्स्प्लोरर</Tooltip> को ठीक ब्लॉक 0 पर खोलिये जिससे उत्पत्ति ब्लॉक कहाँ जाता है ',
      paragraph_two:
        'नीचे स्क्रॉल करें और इस ब्लॉक में संग्रहीत एक लेन-देन पर विवरण का विस्तार करें। "कॉइनबेस" नामक इनपुट खोजें। अब “SCRIPTSIG (<Tooltip id="genesis_two_paragraph_two" content="genesis_two.tooltip_hex" className="underline">HEX</Tooltip>)" लेबल देखें। इसके आगे का मान एक एन्कोडेड संदेश है।',
      paragraph_three: 'उस मान को कॉपी करें और नीचे पेस्ट करें।',
      tooltip_block_explorer:
        '<a href="https://bitcoinops.org/en/topics/block-explorers/" target="_blank" rel="noreferrer">ब्लॉक एक्सप्लोरर</a> एक उपयोगी टूल है जिससे बिटकॉइन लेनदेन के बारे में जल्दी से जानकारी खोजी जा सकती है ।',
      tooltip_hex:
        'हेक्साडेसिमल के लिए लघु, एक अंक प्रणाली जो 16 के आधार का उपयोग करके संख्याओं का प्रतिनिधित्व करती है।',
      view_block_0: 'ब्लॉक 0 देखें',
      placeholder: 'आपको जो वैल्यू मिली है उसे यहां पेस्ट करें',
    },
    genesis_three: {
      title: 'उत्पत्ति',
      heading: 'आइए संदेश को डिकोड करें',
      paragraph_one:
        'आपको जो संदेश मिला वह हेक्स नामक प्रारूप में एन्कोड किया गया था। अब हम इसे ASCII में बदलने के लिए एक कमांड चलाएंगे, जिसे हम पढ़ सकेंगे।',
      paragraph_two:
        'नीचे दिए गए आदेश को टर्मिनल में दाईं ओर कॉपी और पेस्ट करें और "एंटर" दबाएं।',
      terminal_challenge_lines: `यहां अपने आदेश दर्ज करें और एंटर दबाएं...\n चर $scriptSigHex आपके लिए पहले से परिभाषित है।\n\n var $scriptSigHex = '04fff...e6b73'`,
      waiting_for_input:
        'स्क्रिप्ट लिखने और चलाने के लिए आपका इंतज़ार किया जा रहा है...',
      success:
        'बहुत बढ़िया! डिकोड किया गया संदेश जनवरी 3,2009 से <Link href="https://en.bitcoin.it/wiki/Genesis_block" className="underline">The Times</Link> के पहले पन्ने का संदर्भ देता है, उसी दिन सातोशी ने खनन किया था उत्पत्ति ब्लॉक। कितना मजेदार है!?! यह संदेश हमें बिटकॉइन बनाने के लिए उनकी प्रेरणा के बारे में भी कुछ जानकारी देता है।\n\n चलो ऐसे ही चलते रहें।',
    },
    genesis_four: {
      title: 'उत्पत्ति',
      subtitle: 'बधाई! आपने पहली चुनौती पूरी की!',
      paragraph_one:
        'आपको जेनेसिस ब्लॉक में सन्निहित गुप्त संदेश सातोशी नाकामोटो मिला। आपने अभी जो सीखा है, उस पर विस्तार करने का समय आ गया है। अगली चुनौती में कहानी के बारे में एक महत्वपूर्ण सुराग को डिकोड करें।',
    },
    transacting_one: {
      title: 'लेनदेन',
      heading: 'लेन-देन में क्या है?',
      paragraph_one:
        'लेन-देन के दो भाग होते हैं: इनपुट और आउटपुट। पिछले अभ्यास में हमने लेन-देन इनपुट के अंदर पाए गए एक गुप्त संदेश को डिकोड किया था। इस बार हम एक संदेश को डिकोड करेंगे जो आउटपुट भाग से संबंधित है।',
      paragraph_two:
        'निम्नलिखित लेन-देन के लिए, हम OP_RETURN प्रकार के आउटपुट की पहचान करने जा रहे हैं।',
    },
    transacting_two: {
      title: 'लेनदेन',
      heading: 'OP_RETURN',
      paragraph_one:
        'लेन-देन में गुप्त संदेशों को छिपाने का एक और तरीका है। बिटकॉइन में एक विशेष प्रकार का कोड है जिसे OP_RETURN कहा जाता है जो उपयोगकर्ताओं को लेनदेन आउटपुट में संदेश संलग्न करने की अनुमति देता है। आइए देखें कि क्या हम एक खोज सकते हैं।',
      paragraph_two:
        '1. विशिष्ट लेन-देन देखने के लिए <Link href="https://blockstream.info/tx/ee3b8caaeb58245338dd299467de89ec6833d2a4235493c95059934603b5e98d" className="underline">यहां</Link> क्लिक करें।',
      paragraph_three:
        '2. विवरण खोलें और वह भाग ढूंढें जो "OP_RETURN" प्रकार का है।',
      paragraph_four:
        '3. अब "SCRIPTPUBKEY (ASM)" फ़ील्ड खोजें। "OP_RETURN OP_PUSH_BYTES_28" भाग देखें? इन्हें ओपकोड कहा जाता है। हम वास्तव में इसमें रुचि रखते हैं कि उनके बाद क्या आता है।',
      paragraph_five:
        '4. "OP_RETURN OP_PUSHBYTES_28" के बाद संख्याओं की लंबी स्ट्रिंग को कॉपी करें और नीचे पेस्ट करें।',
      input_challenge_label: 'OP_RETURN प्रकार दर्ज करें',
    },
    transacting_three: {
      title: 'लेनदेन',
      heading: 'एक और गुप्त संदेश',
      paragraph_one:
        'हमने लेन-देन आउटपुट के उस हिस्से की पहचान की है जो संदेश को धारण करता है।',
      paragraph_two:
        'अब जो कुछ बचा है, उसे डिकोड करना है, ठीक वैसे ही जैसे हमने पिछले अभ्यास में किया था।',
      paragraph_three:
        '$scriptPubKey बाइट्स फिर से देखने की आवश्यकता है? यह लो।',
      link: 'लेन-देन देखें',
      terminal_challenge_success:
        'यह सही है! अच्छा काम।\n\n जैसा कि आप देख सकते हैं, सुराग एक पता है। यह करने के लिए जाना है।\n\n आपकी अगली चुनौती आपका इंतजार कर रही है।',
      terminal_challenge_lines:
        'यहां अपने आदेश दर्ज करें और एंटर दबाएं...\n\n ध्यान दें कि इस बार आपके लिए $scriptPubKeyBytes परिभाषित नहीं है। आपको इस चर को कोड में उस मान से बदलना होगा जो आपने पिछली चुनौती में पाया था',
      terminal_challenge_error:
        'लगभग! याद रखें कि इस बार आपके लिए वेरिएबल $scriptPubKeyBytes सेट नहीं है।',
    },
    outro_one: {
      title: 'आउट्रो',
      paragraph_one:
        'आप अपने गैरेज में भागते हैं, अपने पिता के पुराने सोलोकॉप्टर में कदम रखते हैं, निर्देशांक में पंच करते हैं, और पते पर अपना रास्ता बनाते हैं।',
      paragraph_two:
        'बिल्ली की एलर्जी इतनी तीव्र होने के बावजूद कि वे होलोग्राम पर भी लागू होती हैं, होलोकैट साथ आता है। आप आपत्ति करते हैं, लेकिन बिल्लियाँ तो बिल्लियाँ रहेंगी।',
      button_text: 'अध्याय 1 समाप्त',
    },
    outro_two: {
      title: 'तुमने कर दिखाया!!!',
      description:
        'अद्भुत। आपने पहला अध्याय पूरा किया और बिटकॉइन के बारे में बहुत कुछ सीखा। जब हम नए अध्याय और चुनौतियाँ लॉन्च करते हैं, यह जानने के लिए हमें <Link href="https://twitter.com/Savingsatoshi" className="underline">@Savingsatoshi</Link> पर फ़ॉलो करें।',
    },
    end: {
      save: 'मेरी प्रगति को सहेंजो',
      next: 'बिना सहेजे जारी रखें',
      feedback: 'अपनी प्रतिक्रिया साझा करें',
    },
  },
  // chapter_two: {
  //   title: "51% हमला",
  //   paragraph_one: "नेटवर्क आउटेज को ब्लॉक सब्सिडी से संबंधित होना चाहिए। यह कोई संयोग नहीं है।",
  //   paragraph_two: "जब आप खनन किए जा रहे कुछ ब्लॉकों के बारे में कुछ असामान्य देखते हैं तो आप अपने कंप्यूटर पर खनन पर कुछ शोध करने की उम्मीद करते हैं। ऐसा लगता है कि वे सभी एक ही जगह से आ रहे हैं, संभवतः एक ही खनन पूल से भी। बाकी खनिकों का क्या हुआ?",
  //   intro_one: {
  //     title: "एक योजना हैश करना",
  //     paragraph_one: "HOLOCAT: “लड़का, क्या डंप है। इस जगह पर कुछ सार्डिन या सूखी मछलियों को रखना बेहतर होगा। मैं कुछ ई-निप के लिए भी समझौता करूँगा।",
  //     paragraph_two: "आप उतरते हैं, अपने आप को स्थिर करते हैं, और प्रवेश के बिंदु की तलाश करते हैं। वहां, उस टूटी हुई खिड़की को चाल चलनी चाहिए। आप एक ईंट के साथ खिड़की से जो बचा है उसे बाहर निकालते हैं, और अंदर कूदते हैं। इमारत हजारों धूल भरी, अच्छी तरह से संरक्षित बिटकॉइन खनिकों से भरी हुई है।",
  //     paragraph_three: '"HOLOCAT: “यह गोदाम नहीं है; यह एक संग्रहालय है। मुझे लगता है कि ये पुराने Vanderpoole परिवार ASIC खनिक हैं। एप्लिकेशन-विशिष्ट एकीकृत सर्किट खनिक बिटकॉइन के शुरुआती दिनों में सभी गुस्से में थे। क्या आप विश्वास कर सकते हैं कि लोगों ने एक समय पर अन्य सिक्कों का खनन किया था?\"'
  //   },
  //   intro_two: {
  //     title: "योजना पर गहन चर्चा करना",
  //     paragraph_one: 'कोने में, एक मंद, बमुश्किल काम करने वाला कंप्यूटर मॉनिटर, जिस पर एक नोट चिपका हुआ है, पलक झपकते बैठता है। नोट कहता है \"उन्हें चालू करें, बेवकूफ।\"',
  //     paragraph_two: 'होलोकैट: \"कितना अशिष्ट है।\"',
  //     paragraph_three: "वाह, एक यांत्रिक कीबोर्ड। होलोकैट कीबोर्ड पर कूदता है और उस पर चलता है, आपको दिखाता है कि किस कुंजी को हिट करना है।"
  //   },
  //   scripting_one: {
  //     title: "स्वचालन",
  //     heading: "आइए कंप्यूटर को हमारे लिए ऐसा करने दें।",
  //     paragraph_one: "ठीक है, इसमें शायद आपको काफ़ी समय लग गया। अब एक हैश खोजने की कल्पना करें जो पाँच या दस शून्य से शुरू हो। यह वह चुनौती है जो बिटकॉइन नेटवर्क खनिकों के सामने रखता है जब वे लेन-देन के साथ नए ब्लॉक जमा करना चाहते हैं।",
  //     paragraph_two: "खनिक वे सभी सामान लेते हैं जो वे एक ब्लॉक, लेन-देन और संबंधित मेटाडेटा के एक समूह में रखना चाहते हैं, और इसे एक यादृच्छिक संख्या के साथ जोड़ते हैं जिसे नॉन कहा जाता है। वे ब्लॉक हैश नामक कुछ बनाने के लिए यह सब हैश फ़ंक्शन में भेजते हैं।",
  //     paragraph_three: "बिटकॉइन नेटवर्क को सेट करने में कठिनाई होती है और केवल ब्लॉक हैश स्वीकार करता है जो एक निश्चित संख्या में शून्य से शुरू होता है। हम इसे \"कठिनाई\" कहते हैं और 2016 के प्रत्येक ब्लॉक में इसका पुनरीक्षण किया जाता है।,
  //     paragraph_four: "अगली चुनौती के लिए, एक स्क्रिप्ट लिखें जो एक हैश ढूंढती है जो पाँच शून्य (\"00000\") से शुरू होती है।
  //   },
  //   scripting_two: {
  //     title: "स्वचालन",
  //     paragraph_one: "ठीक है, अपना खुद का कोड लिखने और चलाने का समय। एक स्क्रिप्ट लिखें जो एक हैश पाता है जो पाँच शून्य (\"00000\") से शुरू होता है।,
  //     paragraph_two: "जब आप \"रन द स्क्रिप्ट\" दबाते हैं, तो खोज हैश फ़ंक्शन को लगातार बढ़ती संख्या के साथ कॉल किया जाएगा (जो कि केवल एक नियमित संख्या है)। गैर के आधार पर हैश की गणना करने और वापस करने के लिए कोड लिखें।,
  //     success: "पाँच शून्य! इतना ही!"
  //   }
  // },
  // chapter_three: {
  //   title: "अपने पुरस्कारों का दावा करना",
  //   paragraph_one: "काहे, वह करीब था। आप अभी भी अमेस्ट्रिस के खिलाफ अपनी लड़ाई से काँप रहे हैं, फिर भी राहत मिली है कि एक जीत संभव थी।",
  //   paragraph_two: "जैसे ही आप अपनी डेस्क पर बैठते हैं, आप एक गहरी सांस लेते हैं और दिन की घटनाओं को फिर से चलाने के लिए आगे बढ़ते हैं। आपके हाथ खुद को रहस्यमय लिफाफे के साथ खेलने में व्यस्त रखते हैं, क्योंकि आपको आश्चर्य होता है कि इसे किसने भेजा है। जो अभी भी वैसे भी लिफाफों का उपयोग करता है, यह 2139 है। इससे भी अधिक उत्सुकता यह है कि इस पर 2008 से एक मोहर है... क्या यह एक और संकेत हो सकता है?",
  //   paragraph_three: "अचानक, आपको एहसास होता है कि आपने एमेस्ट्रिस के साथ अपनी प्रतिस्पर्धा से कभी भी ब्लॉक पुरस्कार का दावा नहीं किया। आपका बिटकॉइन वॉलेट कम चल रहा है, इसलिए अब इसे फिर से टॉप अप करने का अच्छा समय है।"
  // },
  // chapter_four: {
  //   title: "क्या असली सातोशी कृपया खड़े होंगे?",
  //   paragraph_one: "एक रहस्यमय अरबपति सातोशी नाकामोतो होने का दावा कर रहा है। इतने समय के बाद सातोशी आगे क्यों आएंगे? सतोशी के जीवित होने की क्या संभावना है?",
  //   paragraph_two: "जबकि सार्वजनिक बहस काफी हद तक तमाशा पर केंद्रित है, आपको एक आभास है कि क्रिप्टोग्राफी के अपने ज्ञान का उपयोग करके दावे को निरस्त करना संभव हो सकता है।"
  // },
  // chapter_five: {
  //   title: "चाबी रखने वाला"
  // },
  // chapter_six: {
  //   title: "अपराध सबसे अच्छा बचाव है"
  // },
  // chapter_seven: {
  //   title: "इक्कीस"
  // },
  // chapter_eight: {
  //   title: "स्थिरता का मामला"
  // },
  // chapter_nine: {
  //   title: "गणना मत करो, सत्यापित करो।"
  // },
  // chapter_ten: {
  //   title: "10 बिलियन कनेक्शन"
  // },
  challenge_list: {
    coming_soon: 'जल्द आ रहा है। उत्साह से प्रतीक्षा करें।',
  },
  chapter: {
    chapter_locked_one: 'पूरा अध्याय',
    chapter_locked_two: 'खोलने के लिये।',
  },
  hero: {
    title: 'सेविंग सातोशी',
    description: 'बिटकॉइन के रहस्यों के माध्यम से अपना रास्ता कोड करें।',
    start_journey: 'डेमो शुरू करें',
    tell_more: 'मुझे और बताएँ',
  },
  footer: {
    paragraph_one: 'बिटकॉइन समुदाय द्वारा एक ओपन-सोर्स उत्पादन।',
    link: 'कोड की जाँच करें',
  },
  navbar: {
    intro: 'पहचान',
    chapter: 'अध्याय',
    chapter_complete: 'अध्याय पूरा',
    challenge: 'चुनौती',
  },
  modal_login: {
    heading: 'अपनी प्रगति लोड करें',
    paragraph_one:
      'अपने अध्याय और चुनौती की प्रगति, साथ ही साथ अपने अवतार को पुनर्स्थापित करने के लिए नीचे अपना व्यक्तिगत कोड दर्ज करें।',
    clear: 'अभी तक कोई कोड नहीं है?',
    prompt: 'अपने कोड दर्ज करें',
    confirm: 'मेरी प्रगति लोड करें',
    paragraph_two:
      'क्षमा करें, यह इस ब्राउज़र में संग्रहीत प्रगति के लिए सही कोड नहीं है।',
    paragraph_three: 'अभी तक कोई कोड नहीं है या फिर से शुरू करना चाहते हैं?',
    quit: 'सहेजें प्रगति साफ़ करें।',
    success: 'प्रगति भार हुई',
    success_message: 'आप अध्याय के साथ जारी रखने के लिए पूरी तरह तैयार हैं',
  },
  modal_logout: {
    heading: 'आप लोग्ड इन हो चुके हैं',
    paragraph_one:
      'आपकी प्रगति इस ब्राउज़र में संग्रहीत है। आप 30 दिनों के बाद स्वचालित रूप से लॉग आउट हो जाएंगे। ब्रेक लेने के बाद इसे पुनर्स्थापित करने के लिए नीचे दिए गए कोड का प्रयोग करें।',
    signout: 'साइन आउट',
  },
  modal_signup: {
    heading: 'अपनी प्रगति को सहेजना चाहते हैं?',
    paragraph_one:
      'किसी भी डिवाइस और ब्राउज़र पर अपनी प्रगति को सहेजने और लोड करने के लिए सरल कोड को कॉपी और स्टोर करें। यदि आपके पास पहले से कोड है, तो अपनी प्रगति यहां लोड करें।',
    subheading_one: 'एक अवतार चुनें',
    subheading_two: 'अपने व्यक्तिगत कोड का बैकअप लें',
    paragraph_two:
      'सब तैयार? कोड कॉपी किया गया और बैक-अप किया गया? सुनिश्चित करें कि आप ऐसा करते हैं, क्योंकि यदि आप इसे खो देते हैं तो इसे पुनर्प्राप्त नहीं किया जा सकता है।',
    confirm: 'मैंने अपना कोड कॉपी और बैक अप लिया है',
  },
  demo_disclaimer: {
    title: 'यह एक डेमो है',
    description:
      'हम अभी भी इस परियोजना के प्रारंभिक चरण में हैं। अध्याय 1 कार्यात्मक है, शेष विकास के अधीन है। इसे आज़माएं और हमें बताएं कि आप क्या सोचते हैं, हमें <Link href="https://docs.google.com/forms/d/e/1FAIpQLSf1xpNqUYJyvYL5IZDnxy78273pkqzfYW2Hf91H4Do4KHgy9g/viewform?usp=sf_link" className="underline">आपकी प्रतिक्रिया</Link> अच्छी लगेगी।"',
  },
  runner: {
    run: 'स्क्रिप्ट चलाएँ',
    running: 'कार्यरत',
    pause: 'विराम',
    result: 'परिणाम',
    evaluation: 'मूल्यांकन',
    script_output: 'स्क्रिप्ट आउटपुट',
    waiting: 'उपरोक्त आपके इनपुट की प्रतीक्षा कर रहा है...',
  },
}

export default translations
